aura_env.arr  = {
	----------------------------------------------
	--ДРЕНОР
	--NE NADO { name="Лит Об", id=37029}, -- ОБ
	--NE NADO { name="Лит Гер", id=37030}, -- ГЕР
	{ name="Лит Миф", id=37031}, -- МИФ

	{ name="ЦАП Об", id=39502}, -- ОБ
	{ name="ЦАП Гер", id=39504}, -- ГЕР
	{ name="ЦАП Миф", id=39505}, -- МИФ

	----------------------------------------------{ name="ЦАП Об new", id=39499}, -- ОБ
	----------------------------------------------{ name="ЦАП Гер new", id=39500}, -- ГЕР
	----------------------------------------------{ name="ЦАП Миф new", id=39501}, -- МИФ

	----------------------------------------------
	--ЛЕГИОН
	{ name="\nИК Об", id=44283}, -- ОБ
	{ name="ИК Гер", id=44284}, -- ГЕР
	{ name="ИК Миф", id=44285}, -- МИФ

	{ name="ЦН Об", id=45381}, -- ОБ
	{ name="ЦН Гер", id=45382}, -- ГЕР
	{ name="ЦН Миф", id=45383}, -- МИФ

	{ name="Гроб Об", id=47725}, -- ОБ --NE NADO
	{ name="Гроб Гер", id=47726}, -- ГЕР
	{ name="Гроб Миф", id=47727}, -- МИФ

	{ name="Ант Об", id=49133}, -- ОБ
	{ name="Ант Гер", id=49134}, -- гер
	{ name="Ант Миф", id=49135}, -- миф

	----------------------------------------------{ name="Ант Об new", id=49032}, -- ОБ
	----------------------------------------------{ name="Ант Гер new", id=49075}, -- гер
	----------------------------------------------{ name="Ант Миф new", id=49076}, -- миф
	----------------------------------------------
	--БФА
	{ name="\nНи' Об", id=58373}, -- ОБ
	{ name="Ни' Гер", id=58374}, -- ГЕР
	{ name="Ни' Миф", id=58375}, -- МИФ

	--ШЛ
	{ name="\nЗН Об", id=62054}, -- ОБ
	{ name="ЗН Гер", id=62055}, -- ГЕР
	{ name="ЗН Миф", id=62056}, -- МИФ

	{ name="СГ Об", id=64597}, --ОБ
	{ name="СГ Гер", id=64598}, --ГЕР
	{ name="СГ Миф", id=64599}, --МИФ
	----------------------------------------------
	-- ДФ
	{ name="ОБ Хранилище Воплощений", id =71018}, --ОБ
	{ name="ГЕР Хранилище Воплощений", id =71019}, --ГЕР
	{ name="МИФ Хранилище Воплощений", id =71020}, --МИФ


	{ name="ОБ Аберрий", id =76083}, --ОБ
	{ name="ГЕР Аберрий", id =76085}, --ГЕР
	{ name="МИФ Аберрий", id =76086}, --МИФ





}

--{ name="", id=},

