local GlobalAddonName, E = ...
--------------------------------------------------------------------------------
E.OctoTable_QuestID_Paragon = {
	85810, -- Превознесение у Торговой компании
	85809, -- Превознесение у картеля Хитрой Шестеренки
	85808, -- Превознесение у "Мрачных Решал".
	85807, -- Превознесение у картеля Черноводья
	85806, -- Превознесение у картеля Трюмных Вод
	85805, -- Известность у картелей Нижней Шахты
	85471, -- Известность у клуба лояльности Галаджио
	83740, -- Дурная слава у визиря
	83739, -- Дурная слава у генерала
	83738, -- Дурная слава у Прядильщицы
	79220, -- Известность у Ассамблеи глубин
	79219, -- Известность у совета Дорногала
	79218, -- Известность среди Арати Тайносводья
	79196, -- Известность у Отрезанных нитей
	76425, -- Известность у Стражей Сна
	75290, -- Известность среди лоаммских ниффов
	71023, -- Известность в союзе Вальдраккена
	66511, -- Знаменитость среди искарских клыкарров
	66156, -- Известность в Драконьей экспедиции
	65606, -- Знаменитость среди Маруук
	64867, -- Припасы Просветленных
	64267, -- Таинственные подарки Ве'нари
	64266, -- Припасы Кодекса архивариуса
	64012, -- Припасы Легиона Смерти
	61100, -- Припасы Двора Жнецов
	61098, -- Припасы Дикой Охоты
	61097, -- Припасы перерожденных
	61095, -- Припасы Неумирающей армии
	58097, -- Припасы от Ульдумского союза
	58096, -- Припасы от клана Раджани
	55976, -- Припасы Клинков Волн
	55348, -- Припасы от Ржавоболтского сопротивления
	54462, -- Благодарность империи Зандалари
	54461, -- Благодарность жителей Вол'дуна
	54460, -- Благодарность экспедиции Таланджи
	54458, -- Благодарность адмиралтейства Праудмуров
	54457, -- Благодарность ордена Возрождения Шторма
	54456, -- Благодарность ордена Пылающих Углей
	54455, -- Благодарность Армии Чести
	54454, -- Благодарность 7-го легиона
	54453, -- Благодарность Магни
	54451, -- Благодарность тортолланских искателей
	53982, -- Припасы от Освобожденных
	48977, -- Припасы от Армии Света
	48976, -- Припасы от Защитников Аргуса
	46777, -- Награда Армии погибели Легиона
	46749, -- Припасы Стражей
	46748, -- Припасы помраченных
	46747, -- Припасы Ткачей Снов
	46746, -- Припасы валарьяров
	46745, -- Припасы от Двора Фарондиса
	46743, -- Припасы из Крутогорья
}

E.OctoTable_QuestID = {
	38242,
	39246,
}