local GlobalAddonName, E = ...
local AddonTitle = C_AddOns.GetAddOnMetadata(GlobalAddonName, "Title")
--------------------------------------------------------------------------------
E.Octo_Table.interrupts = {
    1766, --рога Пинок
    2139, --маг Антимагия
    6552, --вар Зуботычина
    15487, --прист Безмолвие
    47528, --дк Заморозка разума
    57994, --шаман Пронизывающий ветер
    78675, --друид Столп солнечного света
    96231, --паладин Укор
    106839, --друид Лобовая атака
    116705, --монах Рука-копье
    119910, --варлок Запрет чар
    119914, --варлок Метание топора
    132409, --варлок Запрет чар
    147362, --охотник Встречный выстрел
    183752, --ДХ Прерывание
    187707, --охотник Намордник (сурв)
    351338, --эвокер Подавление
}