local GlobalAddonName, E = ...
local AddonTitle = C_AddOns.GetAddOnMetadata(GlobalAddonName, "Title")
--------------------------------------------------------------------------------
E.Octo_Table.OctoTable_LFGDungeons = {
	-- [1045] = "Случайное подземелье Легиона",
	-- [1046] = "Случайное подземелье Легиона (героич.)",
	-- [301] = "Случайное подземелье Cataclysm (героич.)",
	-- [788] = "Случайное подземелье Warlords of Draenor",
	-- [789] = "Случайное подземелье Warlords of Draenor (героич.)",
	-- [1671] = "Случайное подземелье Battle For Azeroth (героич.)",
	-- [434] = "Случайное подземелье \"Времени Сумерек\" (героич.)",
	[287] = "Корен Худовар",
	[285] = "Всадник без головы",
	-- [2087] = "Случайное подземелье Shadowlands (героич.)",
	-- [258] = "Случайное подземелье классической игры",
	-- [259] = "Случайное подземелье Burning Crusade",
	-- [2350] = "Случайное подземелье (Dragonflight)",
	-- [2351] = "Случайное подземелье в героическом режиме (Dragonflight)",
	-- [260] = "Случайное подземелье Burning Crusade (героич.)",
	-- [463] = "Случайное подземелье Mists of Pandaria",
	-- [462] = "Случайное подземелье Mists of Pandaria (героич.)",
	-- [1670] = "Случайное подземелье Battle For Azeroth",
	-- [261] = "Случайное подземелье Lich King",
	-- [300] = "Случайное подземелье Cataclysm",
	-- [2086] = "Случайное подземелье Shadowlands",
	-- [262] = "Случайное подземелье Lich King (героич.)",
}