local GlobalAddonName, E = ...
--------------------------------------------------------------------------------
E.OctoTable_QuestID_Paragon = {
	83740, -- Дурная слава у визиря
	83739, -- Дурная слава у генерала
	83738, -- Дурная слава у Прядильщицы
	79220, -- Известность у Ассамблеи глубин
	79219, -- Известность у совета Дорногала
	79218, -- Известность среди Арати Тайносводья
	79196, -- Известность у Отрезанных нитей
	76425, -- Известность у Стражей Сна
	75290, -- Известность среди лоаммских ниффов
	71023, -- Известность в союзе Вальдраккена
	66511, -- Знаменитость среди искарских клыкарров
	66156, -- Известность в Драконьей экспедиции
	65606, -- Знаменитость среди Маруук
	64867, -- Припасы Просветленных
	64267, -- Таинственные подарки Ве'нари
	64266, -- Припасы Кодекса архивариуса
	64012, -- Припасы Легиона Смерти
	61100, -- Припасы Двора Жнецов
	61098, -- Припасы Дикой Охоты
	61097, -- Припасы перерожденных
	61095, -- Припасы Неумирающей армии
	58097, -- Припасы от Ульдумского союза
	58096, -- Припасы от клана Раджани
	55976, -- Припасы Клинков Волн
	55348, -- Припасы от Ржавоболтского сопротивления
	54462, -- Благодарность империи Зандалари
	54461, -- Благодарность жителей Вол'дуна
	54460, -- Благодарность экспедиции Таланджи
	54458, -- Благодарность адмиралтейства Праудмуров
	54457, -- Благодарность ордена Возрождения Шторма
	54456, -- Благодарность ордена Пылающих Углей
	54455, -- Благодарность Армии Чести
	54454, -- Благодарность 7-го легиона
	54453, -- Благодарность Магни
	54451, -- Благодарность тортолланских искателей
	53982, -- Припасы от Освобожденных
	48977, -- Припасы от Армии Света
	48976, -- Припасы от Защитников Аргуса
	46777, -- Награда Армии погибели Легиона
	46749, -- Припасы Стражей
	46748, -- Припасы помраченных
	46747, -- Припасы Ткачей Снов
	46746, -- Припасы валарьяров
	46745, -- Припасы от Двора Фарондиса
	46743, -- Припасы из Крутогорья
}
E.OctoTable_QuestID = {
	85574, -- Туманный ящик с праздника
	85523, -- Заплесневевший ящик с праздника
	84909, -- Призрачный ящик с праздника
	84773, -- Кристаллизованный ящик с праздника
	84767, -- Обгорелый ящик с праздника
	84625, -- Неожиданно чистый ящик с праздника
	84624, -- Покрытый песком ящик с праздника
	84470, -- Грязный ящик с праздника
	84426, -- Промокший насквозь ящик с праздника
	83931, -- Потрепанный ящик с праздника
	83794, -- Мокрый ящик с праздника
	82659, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Неруб'арский дворец
	82516, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: заключение пакта
	82512, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: босс вне подземелья
	82511, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Машина пробуждения
	82510, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Неруб'арский дворец
	82509, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Неруб'арский дворец
	82508, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Гнездовье
	82507, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: приорат Священного Пламени
	82506, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: расселина Темного Пламени
	82505, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Каменный Свод
	82504, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Город Нитей
	82503, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Искроварня
	82502, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Ара-Кара, Город Отголосков
	82501, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: "Сияющий Рассвет"
	82500, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Гнездовье
	82499, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: приорат Священного Пламени
	82498, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: расселина Темного Пламени
	82497, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Каменный Свод
	82496, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Город Нитей
	82495, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Искроварня
	82494, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Ара-Кара, Город Отголосков
	82493, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: "Сияющий Рассвет"
	82492, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Город Нитей
	82491, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Ара-Кара, Город Отголосков
	82490, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: приорат Священного Пламени
	82489, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: "Сияющий Рассвет"
	82488, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: расселина Темного Пламени
	82487, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Каменный Свод
	82486, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Гнездовье
	82485, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Искроварня
	82483, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: благодать Света
	82482, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: разнюхивание
	82453, -- |A:Wrapperavailablequesticon:14:14:0:0|a Воспоминание души мира: на бис!
	82452, -- |A:Wrapperavailablequesticon:14:14:0:0|a Воспоминание души мира: локальные задания
	-- 82449, -- |A:Wrapperavailablequesticon:14:14:0:0|a Зов души мира
	82321, -- Воспоминание души мира: древние исследователи
	82286, -- Воспоминание души мира: отвергнутые Древние боги
	82285, -- Воспоминание души мира: раненая душа
	82263, -- Воспоминание души мира: неистовство стихий
	82260, -- Воспоминание души мира: первобытные охотники
	82207, -- Воспоминание души мира: наследник дальних морей
	82164, -- Воспоминание души мира: правление Древних богов
	81985, -- Воспоминание души мира: великие резчики
			84143,
			84144,
			84419,
			84393,
			84363,
			84521,
			84868,
			84236,
			84237,
			84278,
			84296,
			84334,
			84336,
			84563,
			85024,
			84588,
			85025,
			84755,
			85042,
			84756,
			85043,
			85047,
			85060,
			85208,
			85195,
			85475,
			85476,
			85502,
			85503,
}
E.OctoTable_QuestIDTEST = {
			84143,
			84144,
			84419,
			84393,
			84363,
			84521,
			84868,
			84236,
			84237,
			84278,
			84296,
			84334,
			84336,
			84563,
			85024,
			84588,
			85025,
			84755,
			85042,
			84756,
			85043,
			85047,
			85060,
			85208,
			85195,
			85475,
			85476,
			85502,
			85503,
}