local GlobalAddonName, E = ...
--------------------------------------------------------------------------------
E.OctoTable_reputationID_Hidden = {
	2463,
}
E.OctoTable_reputation_ALL = {
	-- https://www.wowhead.com/ru/factions
	2649, --Идет загрузка... id:2649
	2648, --Идет загрузка... id:2648
	2647, --Идет загрузка... id:2647
	2645, --Идет загрузка... id:2645
	2644, --Идет загрузка... id:2644
	2613, --Идет загрузка... id:2613
	2612, --Идет загрузка... id:2612
	2611, --Идет загрузка... id:2611
	2604, --Идет загрузка... id:2604
	2596, --Идет загрузка... id:2596
	2575, --Идет загрузка... id:2575
	2565, --Идет загрузка... id:2565
	2555, --Идет загрузка... id:2555
	2554, --Идет загрузка... id:2554
	2552, --Идет загрузка... id:2552
	2551, --Идет загрузка... id:2551
	2542, --Идет загрузка... id:2542
	2522, --Идет загрузка... id:2522
	2521, --Идет загрузка... id:2521
	2520, --Идет загрузка... id:2520
	2513, --Идет загрузка... id:2513
	2512, --Идет загрузка... id:2512
	2509, --Идет загрузка... id:2509
	2508, --Идет загрузка... id:2508
	2504, --Идет загрузка... id:2504
	2479, --Идет загрузка... id:2479
	2474, --Идет загрузка... id:2474
	2473, --Идет загрузка... id:2473
	2471, --Идет загрузка... id:2471
	2444, --Идет загрузка... id:2444
	2442, --Идет загрузка... id:2442
	2441, --Идет загрузка... id:2441
	2440, --Идет загрузка... id:2440
	2422, --Идет загрузка... id:2422
	2418, --Идет загрузка... id:2418
	2416, --Идет загрузка... id:2416
	2401, --Идет загрузка... id:2401
	2392, --Идет загрузка... id:2392
	2387, --Идет загрузка... id:2387
	2386, --Идет загрузка... id:2386
	2385, --Идет загрузка... id:2385
	2384, --Идет загрузка... id:2384
	2383, --Идет загрузка... id:2383
	2382, --Идет загрузка... id:2382
	2381, --Идет загрузка... id:2381
	2380, --Идет загрузка... id:2380
	2379, --Идет загрузка... id:2379
	2378, --Идет загрузка... id:2378
	2374, --Идет загрузка... id:2374
	2265, --Идет загрузка... id:2265
	2264, --Идет загрузка... id:2264
	2167, --Идет загрузка... id:2167
	2166, --Идет загрузка... id:2166
	2120, --Идет загрузка... id:2120
	2091, --Идет загрузка... id:2091
	2090, --Идет загрузка... id:2090
	2089, --Идет загрузка... id:2089
	2088, --Идет загрузка... id:2088
	2087, --Идет загрузка... id:2087
	2086, --Идет загрузка... id:2086
	2085, --Идет загрузка... id:2085
	2063, --Идет загрузка... id:2063
	1989, --Идет загрузка... id:1989
	1947, --Идет загрузка... id:1947
	1888, --Идет загрузка... id:1888
	1815, --Идет загрузка... id:1815
	1732, --Идет загрузка... id:1732
	1520, --Идет загрузка... id:1520

	-- 1117, --Низина Шолазар id:1117
	-- 2373, --Освобожденные id:2373
	-- 2158, --Жители Вол'дуна id:2158
	-- 2111, --Зандаларские динозавры id:2111
	-- 2103, --Империя Зандалари id:2103
	-- 1352, --Пандарены Хоцзинь id:1352
	-- 1178, --Батальон Адского Крика id:1178
	-- 1133, --Картель Трюмных Вод id:1133
	-- 1124, --Похитители Солнца id:1124
	-- 1085, --Армия Песни Войны id:1085
	-- 1064, --Таунка id:1064
	-- 941, --Маг'хары id:941
	-- 922, --Транквиллион id:922
	-- 911, --Луносвет id:911
	-- 892, --Силы Орды id:892
	-- 889, --Всадники Песни Войны id:889
	-- 729, --Азеротский клан Северного Волка id:729
	-- 530, --Племя Черного Копья id:530
	-- 169, --Картель Хитрой Шестеренки id:169
	-- 81, --Громовой Утес id:81
	-- 76, --Оргриммар id:76
	-- 68, --Подгород id:68
	-- 67, --Орда id:67
	-- 2640, --Бранн Бронзобород id:2640
	-- 2615, --Азеротские Архивы id:2615
	-- 2607, --Визирь id:2607
	-- 2605, --Генерал id:2605
	-- 2601, --Прядильщица id:2601
	-- 2600, --Отрезанные нити id:2600
	-- 2594, --Ассамблея глубин id:2594
	-- 2593, --Команда Бочконога id:2593
	-- 2590, --Совет Дорногала id:2590
	-- 2574, --Стражи Сна id:2574
	-- 2570, --Арати Тайносводья id:2570
	-- 2569, --The War Within id:2569
	-- 2568, --Гонщик Мерцающего Огга id:2568
	-- 2564, --Лоаммские ниффы id:2564
	-- 2553, --Соридорми id:2553
	-- 2550, --Кобальтовая ассамблея id:2550
	-- 2544, --Консорциум ремесленников – филиал на Драконьих островах id:2544
	-- 2526, --Фурболги из клана Зимней Шкуры id:2526
	-- 2524, --Обсидиановые Хранители id:2524
	-- 2523, --Темные Когти id:2523
	-- 2518, --Сабеллиан id:2518
	-- 2517, --Гневион id:2517
	-- 2511, --Искарские клыкарры id:2511
	-- 2510, --Союз Вальдраккена id:2510
	-- 2507, --Драконья экспедиция id:2507
	-- 2506, --Dragonflight id:2506
	-- 2503, --Кентавры Маруук id:2503
	-- 2478, --Просветленные id:2478
	-- 2472, --Кодекс архивариуса id:2472
	-- 2470, --Легион Смерти id:2470
	-- 2469, --Понимание фракталов id:2469
	-- 2465, --Дикая Охота id:2465
	-- 2464, --Двор Ночи id:2464
	-- 2463, --Чесночник id:2463
	-- 2462, --Штопальщики id:2462
	-- 2461, --Изобретатель чумы Марилет id:2461
	-- 2460, --Камнелоб id:2460
	-- 2459, --Сика id:2459
	-- 2458, --Клейя и Пелагий id:2458
	-- 2457, --Великий мастер Воул id:2457
	-- 2456, --Дроман Алиот id:2456
	-- 2455, --Хранитель склепа Каззир id:2455
	-- 2454, --Чуфа id:2454
	-- 2453, --Рендл и Дуборыл id:2453
	-- 2452, --Полемарх Адрест id:2452
	-- 2451, --Капитан-егерь Корейн id:2451
	-- 2450, --Александрос Могрейн id:2450
	-- 2449, --Графиня id:2449
	-- 2448, --Миканикос id:2448
	-- 2447, --Леди Лунная Ягода id:2447
	-- 2446, --Баронесса Вайш id:2446
	-- 2445, --Пепельный двор id:2445
	-- 2439, --Нераскаявшиеся id:2439
	-- 2432, --Ве'нари id:2432
	-- 2431, --Owen Test id:2431
	-- 2427, --Молодой акир id:2427
	-- 2417, --Ульдумский союз id:2417
	-- 2415, --Раджани id:2415
	-- 2414, --Темные Земли id:2414
	-- 2413, --Двор Жнецов id:2413
	-- 2410, --Неумирающая армия id:2410
	-- 2407, --Перерожденные id:2407
	-- 2400, --Клинки Волн id:2400
	-- 2398, --Фуражир из улья Медокрылов id:2398
	-- 2397, --Пчеломатка улья Медокрылов id:2397
	-- 2396, --Трутень из улья Медокрылов id:2396
	-- 2395, --Улей Медокрылов id:2395
	-- 2391, --Ржавоболтское сопротивление id:2391
	-- 2390, --Вим Соленодух id:2390
	-- 2389, --Нери Остроерш id:2389
	-- 2388, --Поэн Солежабрик id:2388
	-- 2377, --Мастер клинка Иновари id:2377
	-- 2376, --Оракул Ори id:2376
	-- 2375, --Мастер охоты Акана id:2375
	-- 2372, --Арена "Морд'Бой" id:2372
	-- 2371, --Потасовочная "У Бизмо" id:2371
	-- 2370, --Обучение динозавров – Дикорог id:2370
	-- 2233, --Dino Training - Pterrodax id:2233
	-- 2170, --Защитники Аргуса id:2170
	-- 2165, --Армия Света id:2165
	-- 2164, --Защитники Азерот id:2164
	-- 2163, --Тортолланские искатели id:2163
	-- 2162, --Орден Возрождения Шторма id:2162
	-- 2161, --Орден Пылающих Углей id:2161
	-- 2160, --Адмиралтейство Праудмуров id:2160
	-- 2159, --7-й легион id:2159
	-- 2157, --Армия Чести id:2157
	-- 2156, --Экспедиция Таланджи id:2156
	-- 2135, --Хроми id:2135
	-- 2104, --Battle for Azeroth id:2104
	-- 2102, --Бесс id:2102
	-- 2101, --Ша'лет id:2101
	-- 2100, --Корбин id:2100
	-- 2099, --Акуле Речной Рог id:2099
	-- 2098, --Хранительница Рейна id:2098
	-- 2097, --Илиссия Водная id:2097
	-- 2045, --Армия погибели Легиона id:2045
	-- 2018, --Отмщение Когтя id:2018
	-- 2011, --Потасовочная "У Бизмо" (3-й сезон) id:2011
	-- 2010, --Арена "Морд'Бой" (3-й сезон) id:2010
	-- 1984, --Спасатели id:1984
	-- 1975, --Кудесник Маргосс id:1975
	-- 1948, --Валарьяры id:1948
	-- 1919, --Жажда магии Вальтруа id:1919
	-- 1900, --Двор Фарондиса id:1900
	-- 1899, --Лунные стражи id:1899
	-- 1894, --Стражи id:1894
	-- 1883, --Ткачи Снов id:1883
	-- 1862, --Жажда магии Окулета id:1862
	-- 1861, --Arcane Thirst (Silgryn) DEPRECATED id:1861
	-- 1860, --Жажда магии Талисры id:1860
	-- 1859, --Помраченные id:1859
	-- 1850, --Охотники за саблеронами id:1850
	-- 1849, --Орден Пробудившихся id:1849
	-- 1848, --Охотники за головами id:1848
	-- 1847, --Длань Пророка id:1847
	-- 1834, --Legion id:1834
	-- 1828, --Племена Крутогорья id:1828
	-- 1741, --Леорадж id:1741
	-- 1740, --Аеда Ясная Заря id:1740
	-- 1739, --Вивианна id:1739
	-- 1738, --Защитница Иллона id:1738
	-- 1737, --Жрец Когтя Ишааль id:1737
	-- 1736, --Тормок id:1736
	-- 1735, --Телохранители из казарм id:1735
	-- 1733, --Делвар Железный Кулак id:1733
	-- 1731, --Совет экзархов id:1731
	-- 1711, --Археологическое общество Хитрой Шестеренки id:1711
	-- 1710, --Защитники Ша'тар id:1710
	-- 1708, --Клан Веселого Черепа id:1708
	-- 1691, --Потасовочная "У Бизмо" (сезон 2) id:1691
	-- 1690, --Арена "Морд'Бой" (сезон 2) id:1690
	-- 1682, --Авангард Ринна id:1682
	-- 1681, --Копье Вол'джина id:1681
	-- 1515, --Араккоа-изгои id:1515
	-- 1492, --Император Шаохао id:1492
	-- 1445, --Клан Северного Волка id:1445
	-- 1444, --Warlords of Draenor id:1444
	-- 1440, --Восстание Черного Копья id:1440
	-- 1435, --Натиск Шадо-Пан id:1435
	-- 1419, --Потасовочная "У Бизмо" (сезон 1) id:1419
	-- 1388, --Войска Похитителей Солнца id:1388
	-- 1387, --Армия Кирин-Тора id:1387
	-- 1376, --Операция "Заслон" id:1376
	-- 1375, --Армия Покорителей id:1375
	-- 1374, --Арена "Морд'Бой" (сезон 1) id:1374
	-- 1359, --Черный принц id:1359
	-- 1358, --Нат Пэгл id:1358
	-- 1357, --Номи id:1357
	-- 1353, --Пандарены Тушуй id:1353
	-- 1351, --Хмелевары id:1351
	-- 1345, --Хранители истории id:1345
	-- 1341, --Небожители id:1341
	-- 1337, --Клакси id:1337
	-- 1302, --Рыболовы id:1302
	-- 1283, --Фермер Фун id:1283
	-- 1282, --Рыба Тростниковая Шкура id:1282
	-- 1281, --Джина Грязный Коготь id:1281
	-- 1280, --Тина Грязный Коготь id:1280
	-- 1279, --Хаохань Грязный Коготь id:1279
	-- 1278, --Шо id:1278
	-- 1277, --Чи-Чи id:1277
	-- 1276, --Старик Горная Лапа id:1276
	-- 1275, --Элла id:1275
	-- 1273, --Йогу Пьяный id:1273
	-- 1272, --Земледельцы id:1272
	-- 1271, --Орден Облачного Змея id:1271
	-- 1270, --Шадо-Пан id:1270
	-- 1269, --Золотой Лотос id:1269
	-- 1245, --Mists of Pandaria id:1245
	-- 1242, --Цзинь-юй Жемчужного Плавника id:1242
	-- 1228, --Лесные хозены id:1228
	-- 1216, --Академия Шан Си id:1216
	-- 1204, --Хиджальские мстители id:1204
	-- 1177, --Защитники Тол Барада id:1177
	-- 1174, --Клан Громового Молота id:1174
	-- 1173, --Рамкахены id:1173
	-- 1172, --Клан Драконьей Пасти id:1172
	-- 1171, --Теразан id:1171
	-- 1169, --Гильдия id:1169
	-- 1168, --Гильдия id:1168
	-- 1162, --Cataclysm id:1162
	-- 1158, --Стражи Хиджала id:1158
	-- 1156, --Пепельный союз id:1156
	-- 1135, --Служители Земли id:1135
	-- 1134, --Гилнеас id:1134
	-- 1126, --Зиморожденные id:1126
	-- 1119, --Сыны Ходира id:1119
	-- 1118, --World of Warcraft id:1118
	-- 1106, --Серебряный Авангард id:1106
	-- 1105, --Оракулы id:1105
	-- 1104, --Племя Бешеного Сердца id:1104
	-- 1098, --Рыцари Черного Клинка id:1098
	-- 1097, --Wrath of the Lich King id:1097
	-- 1094, --Серебряный Союз id:1094
	-- 1091, --Драконий союз id:1091
	-- 1090, --Кирин-Тор id:1090
	-- 1077, --Армия Расколотого Солнца id:1077
	-- 1073, --Калу'ак id:1073
	-- 1072, --[DNT] AC Major Faction Child Renown Test id:1072
	-- 1068, --Лига исследователей id:1068
	-- 1067, --Карающая Длань id:1067
	-- 1052, --Экспедиция Орды id:1052
	-- 1050, --Экспедиция Отважных id:1050
	-- 1038, --Огри'ла id:1038
	-- 1037, --Авангард Альянса id:1037
	-- 1031, --Стражи небес Ша'тар id:1031
	-- 1015, --Крылья Пустоты id:1015
	-- 1012, --Пеплоусты-служители id:1012
	-- 1011, --Нижний Город id:1011
	-- 990, --Песчаная Чешуя id:990
	-- 989, --Хранители Времени id:989
	-- 980, --The Burning Crusade id:980
	-- 978, --Куренай id:978
	-- 970, --Спореггар id:970
	-- 967, --Аметистовое Око id:967
	-- 949, --Тестовая фракция 1 id:949
	-- 948, --Тестовая фракция 2 id:948
	-- 947, --Траллмар id:947
	-- 946, --Оплот Чести id:946
	-- 942, --Кенарийская экспедиция id:942
	-- 936, --Город Шаттрат id:936
	-- 935, --Ша'тар id:935
	-- 934, --Провидцы id:934
	-- 933, --Консорциум id:933
	-- 932, --Алдоры id:932
	-- 930, --Экзодар id:930
	-- 910, --Род Ноздорму id:910
	-- 909, --Ярмарка Новолуния id:909
	-- 891, --Силы Альянса id:891
	-- 890, --Среброкрылые Часовые id:890
	-- 809, --Шен'дралар id:809
	-- 749, --Гидраксианские Повелители Вод id:749
	-- 730, --Стража Грозовой Вершины id:730
	-- 609, --Круг Кенария id:609
	-- 589, --Укротители ледопардов id:589
	-- 577, --Круговзор id:577
	-- 576, --Древобрюхи id:576
	-- 529, --Серебряный Рассвет id:529
	-- 510, --Осквернители id:510
	-- 509, --Лига Аратора id:509
	-- 470, --Кабестан id:470
	-- 469, --Альянс id:469
	-- 369, --Прибамбасск id:369
	-- 349, --Черный Ворон id:349
	-- 270, --Племя Зандалари id:270
	-- 93, --Кентавры из племени Маграм id:93
	-- 92, --Кентавры из племени Гелкис id:92
	-- 87, --Пираты Кровавого Паруса id:87
	-- 72, --Штормград id:72
	-- 70, --Синдикат id:70
	-- 69, --Дарнас id:69
	-- 59, --Братство Тория id:59
	-- 54, --Гномреган id:54
	-- 47, --Стальгорн id:47
	-- 21, --Пиратская Бухта id:21
}
-- E.OctoTable_reputation_ALL = {
--     2640, 2615, 2607, 2605, 2601, 2600, 2594, 2593, 2590, 2574, 2570, 2569,
--     2568, 2564, 2553, 2550, 2544, 2526, 2524, 2523, 2518, 2517, 2511, 2510,
--     2507, 2506, 2503, 2478, 2472, 2470, 2469, 2465, 2464, 2463, 2462, 2461,
--     2460, 2459, 2458, 2457, 2456, 2455, 2454, 2453, 2452, 2451, 2450, 2449,
--     2448, 2447, 2446, 2445, 2439, 2432, 2431, 2427, 2417, 2415, 2414, 2413,
--     2410, 2407, 2398, 2397, 2396, 2391, 2390, 2389, 2388, 2377, 2376, 2375,
--     2373, 2372, 2371, 2370, 2233, 2170, 2165, 2164, 2163, 2162, 2161, 2160,
--     2159, 2158, 2157, 2156, 2135, 2111, 2104, 2103, 2102, 2101, 2100, 2099,
--     2098, 2097, 2045, 2018, 2011, 2010, 1984, 1975, 1948, 1919, 1900, 1899,
--     1894, 1883, 1862, 1861, 1860, 1859, 1850, 1849, 1848, 1847, 1834, 1828,
--     1741, 1740, 1739, 1738, 1737, 1736, 1735, 1733, 1731, 1711, 1710, 1708,
--     1691, 1690, 1682, 1681, 1515, 1492, 1445, 1444, 1440, 1435, 1419, 1388,
--     1387, 1376, 1375, 1374, 1359, 1358, 1357, 1352, 1351, 1345, 1341, 1337,
--     1302, 1283, 1282, 1281, 1280, 1279, 1278, 1277, 1276, 1275, 1273, 1272,
--     1271, 1270, 1269, 1245, 1242, 1228, 1216, 1204, 1178, 1173, 1172, 1171,
--     1169, 1168, 1162, 1158, 1156, 1135, 1133, 1126, 1124, 1119, 1118, 1106,
--     1105, 1104, 1098, 1097, 1091, 1090, 1085, 1077, 1073, 1072, 1067, 1064,
--     1052, 1038, 1031, 1015, 1012, 1011, 990, 989, 980, 978, 970, 967, 949, 948,
--     947, 946, 942, 941, 935, 934, 933, 932, 922, 911, 910, 909, 892, 889, 809,
--     749, 729, 609, 577, 576, 530, 529, 510, 509, 470, 369, 349, 270, 93, 92, 87,
--     81, 76, 70, 68, 67, 59, 21, 2649, 2648, 2647, 2645, 2644, 2613, 2612, 2611,
--     2604, 2596, 2579, 2575, 2565, 2555, 2554, 2552, 2551, 2542, 2522, 2521,
--     2520, 2513, 2512, 2509, 2508, 2504, 2479, 2474, 2473, 2471, 2444, 2442,
--     2441, 2440, 2422, 2418, 2416, 2401, 2400, 2395, 2392, 2387, 2386, 2385,
--     2384, 2383, 2382, 2381, 2380, 2379, 2378, 2374, 2265, 2264, 2167, 2166,
--     2120, 2091, 2090, 2089, 2088, 2087, 2086, 2085, 2063, 1989, 1947, 1888,
--     1815, 1732, 1520, 1353, 1177, 1174, 1134, 1117, 1094, 1068, 1050, 1037, 936,
--     930, 891, 890, 730, 589, 469, 169, 72, 69, 54, 47,
-- }
E.OctoTable_FACTIONTABLE = {
	[1072] = {icon = 0, name = "[DNT] AC Major Faction Child Renown Test", faction = "-", other = "Кентавры Маруук",},
	[2159] = {icon = 2024072, name = "7-й легион", faction = "-", other = "Battle for Azeroth",},
	-- [2384] = {icon = 0, name = "7-й легион (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1861] = {icon = 0, name = "Arcane Thirst (Silgryn) DEPRECATED", faction = "-", other = "Помраченные",},
	[2063] = {icon = 0, name = "Arne Test - Paragon Reputation Stormwind", faction = "-", other = "Другое",},
	[2104] = {icon = 0, name = "Battle for Azeroth", faction = "-", other = "Другое",},
	[1162] = {icon = 0, name = "Cataclysm", faction = "-", other = "Другое",},
	[2233] = {icon = 0, name = "Dino Training - Pterrodax", faction = "-", other = "Battle for Azeroth",},
	[2506] = {icon = 0, name = "Dragonflight", faction = "-", other = "Другое",},
	[1834] = {icon = 0, name = "Legion", faction = "-", other = "Другое",},
	[1245] = {icon = 0, name = "Mists of Pandaria", faction = "-", other = "Другое",},
	[2431] = {icon = 0, name = "Owen Test", faction = "-", other = "Другое",},
	[980] = {icon = 0, name = "The Burning Crusade", faction = "-", other = "Другое",},
	[2569] = {icon = 0, name = "The War Within", faction = "-", other = "Другое",},
	[1444] = {icon = 0, name = "Warlords of Draenor", faction = "-", other = "Другое",},
	[1118] = {icon = 0, name = "World of Warcraft", faction = "-", other = "Другое",},
	[1097] = {icon = 0, name = "Wrath of the Lich King", faction = "-", other = "Другое",},
	[1037] = {icon = "NONE", name = "Авангард Альянса", faction = "-", other = "Wrath of the Lich King",},
	[1682] = {icon = 1042294, name = "Авангард Ринна", faction = "-", other = "Силы Альянса",},
	[2160] = {icon = 2012311, name = "Адмиралтейство Праудмуров", faction = "Альянс", other = "Battle for Azeroth",},
	-- [2379] = {icon = "NONE", name = "Адмиралтейство Праудмуров (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1740] = {icon = "NONE", name = "Аеда Ясная Заря", faction = "-", other = "Телохранители из казарм",},
	[2615] = {icon = "NONE", name = "Азеротские Архивы", faction = "-", other = "Драконья экспедиция",},
	[729] = {icon = "NONE", name = "Азеротский клан Северного Волка", faction = "-", other = "Силы Орды",},
	[1216] = {icon = "NONE", name = "Академия Шан Си", faction = "-", other = "Mists of Pandaria",},
	[2099] = {icon = 236575, name = "Акуле Речной Рог", faction = "-", other = "Legion",},
	[932] = {icon = 135026, name = "Алдоры", faction = "-", other = "Город Шаттрат",},
	[2450] = {icon = "NONE", name = "Александрос Могрейн", faction = "-", other = "Пепельный двор",},
	[469] = {icon = "NONE", name = "Альянс", faction = "-", other = "World of Warcraft",},
	[967] = {icon = "NONE", name = "Аметистовое Око", faction = "-", other = "The Burning Crusade",},
	-- [2401] = {icon = "NONE", name = "Анкоа из клана Клинков Волн (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1515] = {icon = 1042646, name = "Араккоа-изгои", faction = "-", other = "Warlords of Draenor",},
	[2570] = {icon = "NONE", name = "Арати Тайносводья", faction = "-", other = "The War Within",},
	-- [2611] = {icon = "NONE", name = "Арати Тайносводья (идеал)", faction = "-", other = "The War Within",},
	[2372] = {icon = "NONE", name = "Арена \"Морд'Бой\"", faction = "-", other = "Силы Орды",},
	[2010] = {icon = "NONE", name = "Арена \"Морд'Бой\" (3-й сезон)", faction = "-", other = "Силы Орды",},
	[1374] = {icon = "NONE", name = "Арена \"Морд'Бой\" (сезон 1)", faction = "-", other = "Силы Орды",},
	[1690] = {icon = "NONE", name = "Арена \"Морд'Бой\" (сезон 2)", faction = "-", other = "Силы Орды",},
	[1387] = {icon = "NONE", name = "Армия Кирин-Тора", faction = "-", other = "Mists of Pandaria",},
	[1085] = {icon = "NONE", name = "Армия Песни Войны", faction = "-", other = "Экспедиция Орды",},
	[2045] = {icon = "NONE", name = "Армия погибели Легиона", faction = "-", other = "Legion",},
	-- [2091] = {icon = "NONE", name = "Армия погибели Легиона (идеал)", faction = "-", other = "Legion",},
	[1375] = {icon = "NONE", name = "Армия Покорителей", faction = "-", other = "Mists of Pandaria",},
	[1077] = {icon = "NONE", name = "Армия Расколотого Солнца", faction = "-", other = "Город Шаттрат",},
	[2165] = {icon = "NONE", name = "Армия Света", faction = "-", other = "Legion",},
	-- [2166] = {icon = "NONE", name = "Армия Света (идеал)", faction = "-", other = "Legion",},
	[2157] = {icon = "NONE", name = "Армия Чести", faction = "-", other = "Battle for Azeroth",},
	-- [2385] = {icon = "NONE", name = "Армия Чести (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1711] = {icon = "NONE", name = "Археологическое общество Хитрой Шестеренки", faction = "-", other = "Warlords of Draenor",},
	[2594] = {icon = "NONE", name = "Ассамблея глубин", faction = "-", other = "The War Within",},
	-- [2613] = {icon = "NONE", name = "Ассамблея глубин (идеал)", faction = "-", other = "The War Within",},
	[2446] = {icon = "NONE", name = "Баронесса Вайш", faction = "-", other = "Пепельный двор",},
	[1178] = {icon = "NONE", name = "Батальон Адского Крика", faction = "-", other = "Cataclysm",},
	[2102] = {icon = 236575, name = "Бесс", faction = "-", other = "Legion",},
	[2640] = {icon = "NONE", name = "Бранн Бронзобород", faction = "-", other = "The War Within",},
	[59] = {icon = "NONE", name = "Братство Тория", faction = "-", other = "World of Warcraft",},
	[1948] = {icon = "NONE", name = "Валарьяры", faction = "-", other = "Legion",},
	-- [2086] = {icon = "NONE", name = "Валарьяры (идеал)", faction = "-", other = "Legion",},
	[2432] = {icon = "NONE", name = "Ве'нари", faction = "-", other = "Темные Земли",},
	-- [2474] = {icon = "NONE", name = "Ве'нари (идеал)", faction = "-", other = "Темные Земли",},
	[2457] = {icon = "NONE", name = "Великий мастер Воул", faction = "-", other = "Пепельный двор",},
	[1739] = {icon = "NONE", name = "Вивианна", faction = "-", other = "Телохранители из казарм",},
	[2607] = {icon = "NONE", name = "Визирь", faction = "-", other = "Отрезанные нити",},
	-- [2647] = {icon = "NONE", name = "Визирь (идеал)", faction = "-", other = "Отрезанные нити",},
	[2390] = {icon = "NONE", name = "Вим Соленодух", faction = "-", other = "Battle for Azeroth",},
	[1388] = {icon = "NONE", name = "Войска Похитителей Солнца", faction = "-", other = "Mists of Pandaria",},
	[1440] = {icon = "NONE", name = "Восстание Черного Копья", faction = "-", other = "Mists of Pandaria",},
	[889] = {icon = "NONE", name = "Всадники Песни Войны", faction = "-", other = "Силы Орды",},
	[1815] = {icon = "NONE", name = "Выжившие из Гилнеаса", faction = "-", other = "Legion",},
	[2644] = {icon = "NONE", name = "Вылазки: 1-й сезон", faction = "-", other = "The War Within",},
	[2605] = {icon = "NONE", name = "Генерал", faction = "-", other = "Отрезанные нити",},
	-- [2649] = {icon = "NONE", name = "Генерал (идеал)", faction = "-", other = "Отрезанные нити",},
	[749] = {icon = "NONE", name = "Гидраксианские Повелители Вод", faction = "-", other = "World of Warcraft",},
	[1134] = {icon = "NONE", name = "Гилнеас", faction = "Альянс", other = "Альянс",},
	[1168] = {icon = "NONE", name = "Гильдия", faction = "-", other = "Гильдия",},
	[1169] = {icon = "NONE", name = "Гильдия", faction = "-", other = "Другое",},
	[2517] = {icon = "NONE", name = "Гневион", faction = "-", other = "Союз Вальдраккена",},
	[54] = {icon = "NONE", name = "Гномреган", faction = "Альянс", other = "Альянс",},
	[2568] = {icon = "NONE", name = "Гонщик Мерцающего Огга", faction = "-", other = "Dragonflight",},
	[936] = {icon = "NONE", name = "Город Шаттрат", faction = "-", other = "The Burning Crusade",},
	[2449] = {icon = "NONE", name = "Графиня", faction = "-", other = "Пепельный двор",},
	[81] = {icon = "NONE", name = "Громовой Утес", faction = "-", other = "Орда",},
	[69] = {icon = "NONE", name = "Дарнас", faction = "Альянс", other = "Альянс",},
	[2413] = {icon = "NONE", name = "Двор Жнецов", faction = "-", other = "Темные Земли",},
	-- [2442] = {icon = "NONE", name = "Двор Жнецов (Идеал)", faction = "-", other = "Темные Земли",},
	[2464] = {icon = "NONE", name = "Двор Ночи", faction = "-", other = "Темные Земли",},
	[1900] = {icon = "NONE", name = "Двор Фарондиса", faction = "-", other = "Legion",},
	-- [2087] = {icon = "NONE", name = "Двор Фарондиса (идеал)", faction = "-", other = "Legion",},
	[1733] = {icon = "NONE", name = "Делвар Железный Кулак", faction = "-", other = "Телохранители из казарм",},
	[1281] = {icon = "NONE", name = "Джина Грязный Коготь", faction = "-", other = "Земледельцы",},
	[2465] = {icon = "NONE", name = "Дикая Охота", faction = "-", other = "Темные Земли",},
	-- [2444] = {icon = "NONE", name = "Дикая Охота (Идеал)", faction = "-", other = "Темные Земли",},
	[1847] = {icon = "NONE", name = "Длань Пророка", faction = "-", other = "Warlords of Draenor",},
	[1091] = {icon = "NONE", name = "Драконий союз", faction = "-", other = "Wrath of the Lich King",},
	[2507] = {icon = "NONE", name = "Драконья экспедиция", faction = "-", other = "Dragonflight",},
	-- [2508] = {icon = "NONE", name = "Драконья экспедиция (идеал)", faction = "-", other = "Dragonflight",},
	[576] = {icon = "NONE", name = "Древобрюхи", faction = "-", other = "World of Warcraft",},
	[1732] = {icon = "NONE", name = "Дренорcкая Экспедиция Хитрой Шестеренки", faction = "-", other = "Warlords of Draenor",},
	[2456] = {icon = "NONE", name = "Дроман Алиот", faction = "-", other = "Пепельный двор",},
	[1919] = {icon = "NONE", name = "Жажда магии Вальтруа", faction = "-", other = "Помраченные",},
	[1862] = {icon = "NONE", name = "Жажда магии Окулета", faction = "-", other = "Помраченные",},
	[1860] = {icon = "NONE", name = "Жажда магии Талисры", faction = "-", other = "Помраченные",},
	[2158] = {icon = "NONE", name = "Жители Вол'дуна", faction = "Орда", other = "Battle for Azeroth",},
	-- [2382] = {icon = "NONE", name = "Жители Вол'дуна (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1737] = {icon = "NONE", name = "Жрец Когтя Ишааль", faction = "-", other = "Телохранители из казарм",},
	[2111] = {icon = "NONE", name = "Зандаларские динозавры", faction = "-", other = "Battle for Azeroth",},
	[2164] = {icon = "NONE", name = "Защитники Азерот", faction = "-", other = "Battle for Azeroth",},
	-- [2386] = {icon = "NONE", name = "Защитники Азерот (идеал)", faction = "-", other = "Battle for Azeroth",},
	[2170] = {icon = "NONE", name = "Защитники Аргуса", faction = "-", other = "Legion",},
	-- [2167] = {icon = "NONE", name = "Защитники Аргуса (идеал)", faction = "-", other = "Другое",},
	[1177] = {icon = "NONE", name = "Защитники Тол Барада", faction = "-", other = "Cataclysm",},
	[1710] = {icon = "NONE", name = "Защитники Ша'тар", faction = "-", other = "Warlords of Draenor",},
	[1738] = {icon = "NONE", name = "Защитница Иллона", faction = "-", other = "Телохранители из казарм",},
	[2645] = {icon = "NONE", name = "Земельники", faction = "-", other = "Совет Дорногала",},
	[1272] = {icon = "NONE", name = "Земледельцы", faction = "-", other = "Mists of Pandaria",},
	[1126] = {icon = "NONE", name = "Зиморожденные", faction = "-", other = "Авангард Альянса",},
	[1269] = {icon = "NONE", name = "Золотой Лотос", faction = "-", other = "Mists of Pandaria",},
	[1520] = {icon = "NONE", name = "Изгнанники клана Призрачной Луны", faction = "-", other = "Warlords of Draenor",},
	[2461] = {icon = "NONE", name = "Изобретатель чумы Марилет", faction = "-", other = "Пепельный двор",},
	[2097] = {icon = 236575, name = "Илиссия Водная", faction = "-", other = "Legion",},
	[1947] = {icon = "NONE", name = "Иллидари", faction = "-", other = "Legion",},
	[1492] = {icon = "NONE", name = "Император Шаохао", faction = "-", other = "Mists of Pandaria",},
	[2103] = {icon = "NONE", name = "Империя Зандалари", faction = "Орда", other = "Battle for Azeroth",},
	-- [2378] = {icon = "NONE", name = "Империя Зандалари (идеал)", faction = "-", other = "Battle for Azeroth",},
	[2511] = {icon = "NONE", name = "Искарские клыкарры", faction = "-", other = "Dragonflight",},
	-- [2551] = {icon = "NONE", name = "Искарские клыкарры (идеал)", faction = "-", other = "Dragonflight",},
	[1273] = {icon = "NONE", name = "Йогу Пьяный", faction = "-", other = "Земледельцы",},
	[470] = {icon = "NONE", name = "Кабестан", faction = "-", other = "Картель Хитрой Шестеренки",},
	[1073] = {icon = "NONE", name = "Калу'ак", faction = "-", other = "Wrath of the Lich King",},
	[2460] = {icon = "NONE", name = "Камнелоб", faction = "-", other = "Пепельный двор",},
	[2451] = {icon = "NONE", name = "Капитан-егерь Корейн", faction = "-", other = "Пепельный двор",},
	[1067] = {icon = "NONE", name = "Карающая Длань", faction = "-", other = "Экспедиция Орды",},
	[1133] = {icon = "NONE", name = "Картель Трюмных Вод", faction = "-", other = "Орда",},
	[169] = {icon = "NONE", name = "Картель Хитрой Шестеренки", faction = "-", other = "World of Warcraft",},
	[942] = {icon = "NONE", name = "Кенарийская экспедиция", faction = "-", other = "The Burning Crusade",},
	[92] = {icon = "NONE", name = "Кентавры из племени Гелкис", faction = "-", other = "World of Warcraft",},
	[93] = {icon = "NONE", name = "Кентавры из племени Маграм", faction = "-", other = "World of Warcraft",},
	[2503] = {icon = "NONE", name = "Кентавры Маруук", faction = "-", other = "Dragonflight",},
	-- [2504] = {icon = "NONE", name = "Кентавры Маруук (идеал)", faction = "-", other = "Dragonflight",},
	[1090] = {icon = "NONE", name = "Кирин-Тор", faction = "-", other = "Wrath of the Lich King",},
	[1337] = {icon = "NONE", name = "Клакси", faction = "-", other = "Mists of Pandaria",},
	[2512] = {icon = "NONE", name = "Клан Айлааг", faction = "-", other = "Кентавры Маруук",},
	[1708] = {icon = "NONE", name = "Клан Веселого Черепа", faction = "-", other = "Warlords of Draenor",},
	[1174] = {icon = "NONE", name = "Клан Громового Молота", faction = "-", other = "Cataclysm",},
	[1172] = {icon = "NONE", name = "Клан Драконьей Пасти", faction = "-", other = "Cataclysm",},
	[2555] = {icon = "NONE", name = "Клан Кейган", faction = "-", other = "Dragonflight",},
	-- [2521] = {icon = "NONE", name = "Клан Нокуд (идеал)", faction = "-", other = "Dragonflight",},
	[2520] = {icon = "NONE", name = "Клан Нокхуд", faction = "-", other = "Dragonflight",},
	[2513] = {icon = "NONE", name = "Клан Он'ир", faction = "-", other = "Кентавры Маруук",},
	[1445] = {icon = "NONE", name = "Клан Северного Волка", faction = "-", other = "Warlords of Draenor",},
	[2522] = {icon = "NONE", name = "Клан Тирай", faction = "-", other = "Кентавры Маруук",},
	[2554] = {icon = "NONE", name = "Клан Тогус", faction = "-", other = "Кентавры Маруук",},
	[2542] = {icon = "NONE", name = "Клан Укхел", faction = "-", other = "Dragonflight",},
	[2509] = {icon = "NONE", name = "Клан Шикаар", faction = "-", other = "Кентавры Маруук",},
	[2458] = {icon = "NONE", name = "Клейя и Пелагий", faction = "-", other = "Пепельный двор",},
	[2400] = {icon = "NONE", name = "Клинки Волн", faction = "-", other = "Battle for Azeroth",},
	[2550] = {icon = "NONE", name = "Кобальтовая ассамблея", faction = "-", other = "Союз Вальдраккена",},
	[2472] = {icon = "NONE", name = "Кодекс архивариуса", faction = "-", other = "Темные Земли",},
	-- [2473] = {icon = "NONE", name = "Кодекс архивариуса (идеал)", faction = "-", other = "Темные Земли",},
	[2593] = {icon = "NONE", name = "Команда Бочконога", faction = "-", other = "Другое",},
	-- [2604] = {icon = "NONE", name = "Команда Бочконога (идеал)", faction = "-", other = "Другое",},
	[933] = {icon = "NONE", name = "Консорциум", faction = "-", other = "The Burning Crusade",},
	[2544] = {icon = "NONE", name = "Консорциум ремесленников – филиал на Драконьих островах", faction = "-", other = "Союз Вальдраккена",},
	[1681] = {icon = "NONE", name = "Копье Вол'джина", faction = "-", other = "Силы Орды",},
	[2100] = {icon = 236575, name = "Корбин", faction = "-", other = "Legion",},
	[609] = {icon = "NONE", name = "Круг Кенария", faction = "-", other = "World of Warcraft",},
	[577] = {icon = "NONE", name = "Круговзор", faction = "-", other = "Картель Хитрой Шестеренки",},
	[1015] = {icon = "NONE", name = "Крылья Пустоты", faction = "-", other = "The Burning Crusade",},
	[1975] = {icon = "NONE", name = "Кудесник Маргосс", faction = "-", other = "Legion",},
	[2265] = {icon = "NONE", name = "Кул-Тирас - долина Штормов", faction = "-", other = "Орден Возрождения Шторма",},
	[2264] = {icon = "NONE", name = "Кул-Тирас - Друствар", faction = "-", other = "Орден Пылающих Углей",},
	[2120] = {icon = "NONE", name = "Кул-Тирас - Тирагард", faction = "Альянс", other = "Адмиралтейство Праудмуров",},
	[978] = {icon = "NONE", name = "Куренай", faction = "-", other = "The Burning Crusade",},
	[2470] = {icon = "NONE", name = "Легион Смерти", faction = "-", other = "Темные Земли",},
	-- [2471] = {icon = "NONE", name = "Легион Смерти (идеал)", faction = "-", other = "Темные Земли",},
	[2447] = {icon = "NONE", name = "Леди Лунная Ягода", faction = "-", other = "Пепельный двор",},
	[1741] = {icon = "NONE", name = "Леорадж", faction = "-", other = "Телохранители из казарм",},
	[1228] = {icon = "NONE", name = "Лесные хозены", faction = "-", other = "Mists of Pandaria",},
	[509] = {icon = "NONE", name = "Лига Аратора", faction = "-", other = "Силы Альянса",},
	[1068] = {icon = "NONE", name = "Лига исследователей", faction = "-", other = "Авангард Альянса",},
	[2564] = {icon = "NONE", name = "Лоаммские ниффы", faction = "-", other = "Dragonflight",},
	-- [2565] = {icon = "NONE", name = "Лоаммские ниффы (идеал)", faction = "-", other = "Dragonflight",},
	[1899] = {icon = "NONE", name = "Лунные стражи", faction = "-", other = "Legion",},
	[1989] = {icon = "NONE", name = "Лунные стражи", faction = "-", other = "Legion",},
	[911] = {icon = "NONE", name = "Луносвет", faction = "Орда", other = "Орда",},
	[941] = {icon = "NONE", name = "Маг'хары", faction = "-", other = "The Burning Crusade",},
	[2377] = {icon = "NONE", name = "Мастер клинка Иновари", faction = "-", other = "Battle for Azeroth",},
	[2375] = {icon = "NONE", name = "Мастер охоты Акана", faction = "-", other = "Battle for Azeroth",},
	[2448] = {icon = "NONE", name = "Миканикос", faction = "-", other = "Пепельный двор",},
	[2427] = {icon = "NONE", name = "Молодой акир", faction = "-", other = "Battle for Azeroth",},
	[1358] = {icon = "NONE", name = "Нат Пэгл", faction = "-", other = "Рыболовы",},
	[1435] = {icon = "NONE", name = "Натиск Шадо-Пан", faction = "-", other = "Mists of Pandaria",},
	[1341] = {icon = "NONE", name = "Небожители", faction = "-", other = "Mists of Pandaria",},
	[2439] = {icon = "NONE", name = "Нераскаявшиеся", faction = "-", other = "Темные Земли",},
	[2389] = {icon = "NONE", name = "Нери Остроерш", faction = "-", other = "Battle for Azeroth",},
	[2410] = {icon = "NONE", name = "Неумирающая армия", faction = "-", other = "Темные Земли",},
	-- [2440] = {icon = "NONE", name = "Неумирающая армия (Идеал)", faction = "-", other = "Темные Земли",},
	[1011] = {icon = "NONE", name = "Нижний Город", faction = "-", other = "Город Шаттрат",},
	[1117] = {icon = "NONE", name = "Низина Шолазар", faction = "-", other = "Wrath of the Lich King",},
	[1357] = {icon = "NONE", name = "Номи", faction = "-", other = "Другое",},
	[2422] = {icon = "NONE", name = "Ночной народец", faction = "-", other = "Дикая Охота",},
	[2524] = {icon = "NONE", name = "Обсидиановые Хранители", faction = "Альянс", other = "Альянс",},
	[2370] = {icon = "NONE", name = "Обучение динозавров – Дикорог", faction = "-", other = "Battle for Azeroth",},
	[1038] = {icon = "NONE", name = "Огри'ла", faction = "-", other = "The Burning Crusade",},
	[1376] = {icon = "NONE", name = "Операция \"Заслон\"", faction = "-", other = "Mists of Pandaria",},
	[946] = {icon = "NONE", name = "Оплот Чести", faction = "-", other = "The Burning Crusade",},
	[2376] = {icon = "NONE", name = "Оракул Ори", faction = "-", other = "Battle for Azeroth",},
	[1105] = {icon = "NONE", name = "Оракулы", faction = "-", other = "Низина Шолазар",},
	[76] = {icon = "NONE", name = "Оргриммар", faction = "-", other = "Орда",},
	[67] = {icon = "NONE", name = "Орда", faction = "-", other = "World of Warcraft",},
	[2162] = {icon = "NONE", name = "Орден Возрождения Шторма", faction = "-", other = "Battle for Azeroth",},
	-- [2381] = {icon = "NONE", name = "Орден Возрождения Шторма (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1271] = {icon = "NONE", name = "Орден Облачного Змея", faction = "-", other = "Mists of Pandaria",},
	[1849] = {icon = "NONE", name = "Орден Пробудившихся", faction = "-", other = "Warlords of Draenor",},
	[2161] = {icon = "NONE", name = "Орден Пылающих Углей", faction = "-", other = "Battle for Azeroth",},
	-- [2383] = {icon = "NONE", name = "Орден Пылающих Углей (идеал)", faction = "-", other = "Battle for Azeroth",},
	[2373] = {icon = "NONE", name = "Освобожденные", faction = "-", other = "Battle for Azeroth",},
	-- [2374] = {icon = "NONE", name = "Освобожденные (идеал)", faction = "-", other = "Battle for Azeroth",},
	[510] = {icon = "NONE", name = "Осквернители", faction = "-", other = "Силы Орды",},
	[2018] = {icon = "NONE", name = "Отмщение Когтя", faction = "-", other = "Legion",},
	[2600] = {icon = "NONE", name = "Отрезанные нити", faction = "-", other = "The War Within",},
	-- [2596] = {icon = "NONE", name = "Отрезанные нити (идеал)", faction = "-", other = "The War Within",},
	[1848] = {icon = "NONE", name = "Охотники за головами", faction = "-", other = "Warlords of Draenor",},
	[1850] = {icon = "NONE", name = "Охотники за саблеронами", faction = "-", other = "Warlords of Draenor",},
	[1353] = {icon = "NONE", name = "Пандарены Тушуй", faction = "Альянс", other = "Альянс",},
	[1352] = {icon = "NONE", name = "Пандарены Хоцзинь", faction = "-", other = "Орда",},
	[2445] = {icon = "NONE", name = "Пепельный двор", faction = "-", other = "Темные Земли",},
	[1156] = {icon = "NONE", name = "Пепельный союз", faction = "-", other = "Wrath of the Lich King",},
	[1012] = {icon = "NONE", name = "Пеплоусты-служители", faction = "-", other = "The Burning Crusade",},
	[2407] = {icon = "NONE", name = "Перерожденные", faction = "-", other = "Темные Земли",},
	-- [2441] = {icon = "NONE", name = "Перерожденные (Идеал)", faction = "-", other = "Темные Земли",},
	[990] = {icon = "NONE", name = "Песчаная Чешуя", faction = "-", other = "The Burning Crusade",},
	[21] = {icon = "NONE", name = "Пиратская Бухта", faction = "-", other = "Картель Хитрой Шестеренки",},
	[87] = {icon = "NONE", name = "Пираты Кровавого Паруса", faction = "-", other = "World of Warcraft",},
	[1828] = {icon = "NONE", name = "Племена Крутогорья", faction = "-", other = "Legion",},
	-- [2085] = {icon = "NONE", name = "Племена Крутогорья (идеал)", faction = "-", other = "Legion",},
	[1104] = {icon = "NONE", name = "Племя Бешеного Сердца", faction = "-", other = "Низина Шолазар",},
	[270] = {icon = "NONE", name = "Племя Зандалари", faction = "-", other = "World of Warcraft",},
	[530] = {icon = "NONE", name = "Племя Черного Копья", faction = "-", other = "Орда",},
	[68] = {icon = "NONE", name = "Подгород", faction = "Орда", other = "Орда",},
	[2452] = {icon = "NONE", name = "Полемарх Адрест", faction = "-", other = "Пепельный двор",},
	[1859] = {icon = "NONE", name = "Помраченные", faction = "Орда", other = "Legion",},
	-- [2089] = {icon = "NONE", name = "Помраченные (идеал)", faction = "-", other = "Legion",},
	[2469] = {icon = "NONE", name = "Понимание фракталов", faction = "-", other = "Темные Земли",},
	[2371] = {icon = "NONE", name = "Потасовочная \"У Бизмо\"", faction = "-", other = "Силы Альянса",},
	[2011] = {icon = "NONE", name = "Потасовочная \"У Бизмо\" (3-й сезон)", faction = "-", other = "Силы Альянса",},
	[1419] = {icon = "NONE", name = "Потасовочная \"У Бизмо\" (сезон 1)", faction = "-", other = "Силы Альянса",},
	[1691] = {icon = "NONE", name = "Потасовочная \"У Бизмо\" (сезон 2)", faction = "-", other = "Силы Альянса",},
	[1124] = {icon = "NONE", name = "Похитители Солнца", faction = "-", other = "Экспедиция Орды",},
	[2388] = {icon = "NONE", name = "Поэн Солежабрик", faction = "-", other = "Battle for Azeroth",},
	[369] = {icon = "NONE", name = "Прибамбасск", faction = "-", other = "Картель Хитрой Шестеренки",},
	[934] = {icon = "NONE", name = "Провидцы", faction = "-", other = "Город Шаттрат",},
	[2478] = {icon = "NONE", name = "Просветленные", faction = "-", other = "Темные Земли",},
	-- [2479] = {icon = "NONE", name = "Просветленные (идеал)", faction = "-", other = "Темные Земли",},
	[2601] = {icon = "NONE", name = "Прядильщица", faction = "-", other = "Отрезанные нити",},
	-- [2648] = {icon = "NONE", name = "Прядильщица (идеал)", faction = "-", other = "Отрезанные нити",},
	[2397] = {icon = "NONE", name = "Пчеломатка улья Медокрылов", faction = "-", other = "Другое",},
	[2415] = {icon = "NONE", name = "Раджани", faction = "-", other = "Battle for Azeroth",},
	-- [2416] = {icon = "NONE", name = "Раджани (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1173] = {icon = "NONE", name = "Рамкахены", faction = "-", other = "Cataclysm",},
	[2453] = {icon = "NONE", name = "Рендл и Дуборыл", faction = "-", other = "Пепельный двор",},
	[2391] = {icon = "NONE", name = "Ржавоболтское сопротивление", faction = "-", other = "Battle for Azeroth",},
	-- [2392] = {icon = "NONE", name = "Ржавоболтское сопротивление (идеал)", faction = "-", other = "Battle for Azeroth",},
	[910] = {icon = "NONE", name = "Род Ноздорму", faction = "-", other = "World of Warcraft",},
	[1282] = {icon = "NONE", name = "Рыба Тростниковая Шкура", faction = "-", other = "Земледельцы",},
	[1302] = {icon = "NONE", name = "Рыболовы", faction = "-", other = "Mists of Pandaria",},
	[1098] = {icon = "NONE", name = "Рыцари Черного Клинка", faction = "-", other = "Wrath of the Lich King",},
	[2518] = {icon = "NONE", name = "Сабеллиан", faction = "-", other = "Союз Вальдраккена",},
	[1106] = {icon = "NONE", name = "Серебряный Авангард", faction = "-", other = "Wrath of the Lich King",},
	[529] = {icon = "NONE", name = "Серебряный Рассвет", faction = "-", other = "World of Warcraft",},
	[1094] = {icon = "NONE", name = "Серебряный Союз", faction = "-", other = "Авангард Альянса",},
	[2459] = {icon = "NONE", name = "Сика", faction = "-", other = "Пепельный двор",},
	[891] = {icon = "NONE", name = "Силы Альянса", faction = "-", other = "World of Warcraft",},
	[892] = {icon = "NONE", name = "Силы Орды", faction = "-", other = "World of Warcraft",},
	[70] = {icon = "NONE", name = "Синдикат", faction = "-", other = "World of Warcraft",},
	[1135] = {icon = "NONE", name = "Служители Земли", faction = "-", other = "Cataclysm",},
	[2590] = {icon = "NONE", name = "Совет Дорногала", faction = "-", other = "The War Within",},
	-- [2612] = {icon = "NONE", name = "Совет Дорногала (идеал)", faction = "-", other = "The War Within",},
	[1731] = {icon = "NONE", name = "Совет экзархов", faction = "-", other = "Warlords of Draenor",},
	[2553] = {icon = "NONE", name = "Соридорми", faction = "-", other = "Союз Вальдраккена",},
	[2510] = {icon = "NONE", name = "Союз Вальдраккена", faction = "-", other = "Dragonflight",},
	-- [2552] = {icon = "NONE", name = "Союз Вальдраккена (идеал)", faction = "-", other = "Dragonflight",},
	[1984] = {icon = "NONE", name = "Спасатели", faction = "-", other = "Legion",},
	[970] = {icon = "NONE", name = "Спореггар", faction = "-", other = "The Burning Crusade",},
	[890] = {icon = "NONE", name = "Среброкрылые Часовые", faction = "-", other = "Силы Альянса",},
	[47] = {icon = "NONE", name = "Стальгорн", faction = "Альянс", other = "Альянс",},
	[1276] = {icon = "NONE", name = "Старик Горная Лапа", faction = "-", other = "Земледельцы",},
	[730] = {icon = "NONE", name = "Стража Грозовой Вершины", faction = "-", other = "Силы Альянса",},
	[1894] = {icon = "NONE", name = "Стражи", faction = "-", other = "Legion",},
	-- [2090] = {icon = "NONE", name = "Стражи (идеал)", faction = "-", other = "Legion",},
	[1031] = {icon = "NONE", name = "Стражи небес Ша'тар", faction = "-", other = "Город Шаттрат",},
	[2574] = {icon = "NONE", name = "Стражи Сна", faction = "-", other = "Dragonflight",},
	-- [2575] = {icon = "NONE", name = "Стражи Сна (идеал)", faction = "-", other = "Dragonflight",},
	[1158] = {icon = "NONE", name = "Стражи Хиджала", faction = "-", other = "Cataclysm",},
	[1119] = {icon = "NONE", name = "Сыны Ходира", faction = "-", other = "Wrath of the Lich King",},
	[1064] = {icon = "NONE", name = "Таунка", faction = "-", other = "Экспедиция Орды",},
	[1735] = {icon = "NONE", name = "Телохранители из казарм", faction = "-", other = "Warlords of Draenor",},
	[2414] = {icon = "NONE", name = "Темные Земли", faction = "-", other = "Другое",},
	[2523] = {icon = "NONE", name = "Темные Когти", faction = "Орда", other = "Орда",},
	[1171] = {icon = "NONE", name = "Теразан", faction = "-", other = "Cataclysm",},
	[949] = {icon = "NONE", name = "Тестовая фракция 1", faction = "-", other = "Другое",},
	[948] = {icon = "NONE", name = "Тестовая фракция 2", faction = "-", other = "Тестовая фракция 1",},
	[1280] = {icon = "NONE", name = "Тина Грязный Коготь", faction = "-", other = "Земледельцы",},
	[1883] = {icon = "NONE", name = "Ткачи Снов", faction = "-", other = "Legion",},
	-- [2088] = {icon = "NONE", name = "Ткачи Снов (идеал)", faction = "-", other = "Legion",},
	[1736] = {icon = "NONE", name = "Тормок", faction = "-", other = "Телохранители из казарм",},
	[2163] = {icon = "NONE", name = "Тортолланские искатели", faction = "-", other = "Battle for Azeroth",},
	-- [2387] = {icon = "NONE", name = "Тортолланские искатели (идеал)", faction = "-", other = "Battle for Azeroth",},
	[947] = {icon = "NONE", name = "Траллмар", faction = "-", other = "The Burning Crusade",},
	[922] = {icon = "NONE", name = "Транквиллион", faction = "-", other = "The Burning Crusade",},
	[2396] = {icon = "NONE", name = "Трутень из улья Медокрылов", faction = "-", other = "Другое",},
	[589] = {icon = "NONE", name = "Укротители ледопардов", faction = "-", other = "World of Warcraft",},
	[2395] = {icon = "NONE", name = "Улей Медокрылов", faction = "-", other = "Battle for Azeroth",},
	[2417] = {icon = "NONE", name = "Ульдумский союз", faction = "-", other = "Battle for Azeroth",},
	-- [2418] = {icon = "NONE", name = "Ульдумский союз (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1283] = {icon = "NONE", name = "Фермер Фун", faction = "-", other = "Земледельцы",},
	[2398] = {icon = "NONE", name = "Фуражир из улья Медокрылов", faction = "-", other = "Другое",},
	[2526] = {icon = "NONE", name = "Фурболги из клана Зимней Шкуры", faction = "-", other = "Dragonflight",},
	[1279] = {icon = "NONE", name = "Хаохань Грязный Коготь", faction = "-", other = "Земледельцы",},
	[1204] = {icon = "NONE", name = "Хиджальские мстители", faction = "-", other = "Cataclysm",},
	[1351] = {icon = "NONE", name = "Хмелевары", faction = "-", other = "Mists of Pandaria",},
	[989] = {icon = "NONE", name = "Хранители Времени", faction = "-", other = "The Burning Crusade",},
	[1345] = {icon = "NONE", name = "Хранители истории", faction = "-", other = "Mists of Pandaria",},
	[2455] = {icon = "NONE", name = "Хранитель склепа Каззир", faction = "-", other = "Пепельный двор",},
	[2098] = {icon = 236575, name = "Хранительница Рейна", faction = "-", other = "Legion",},
	[2135] = {icon = "NONE", name = "Хроми", faction = "-", other = "Legion",},
	[1242] = {icon = "NONE", name = "Цзинь-юй Жемчужного Плавника", faction = "-", other = "Mists of Pandaria",},
	[349] = {icon = "NONE", name = "Черный Ворон", faction = "-", other = "World of Warcraft",},
	[1359] = {icon = "NONE", name = "Черный принц", faction = "-", other = "Mists of Pandaria",},
	[2463] = {icon = "NONE", name = "Чесночник", faction = "-", other = "Темные Земли",},
	[1277] = {icon = "NONE", name = "Чи-Чи", faction = "-", other = "Земледельцы",},
	[2454] = {icon = "NONE", name = "Чуфа", faction = "-", other = "Пепельный двор",},
	[2101] = {icon = 236575, name = "Ша'лет", faction = "-", other = "Legion",},
	[935] = {icon = "NONE", name = "Ша'тар", faction = "-", other = "Город Шаттрат",},
	[1270] = {icon = "NONE", name = "Шадо-Пан", faction = "-", other = "Mists of Pandaria",},
	[809] = {icon = "NONE", name = "Шен'дралар", faction = "-", other = "World of Warcraft",},
	[1278] = {icon = "NONE", name = "Шо", faction = "-", other = "Земледельцы",},
	[2462] = {icon = "NONE", name = "Штопальщики", faction = "-", other = "Темные Земли",},
	[72] = {icon = "NONE", name = "Штормград", faction = "Альянс", other = "Альянс",},
	[930] = {icon = "NONE", name = "Экзодар", faction = "Альянс", other = "Альянс",},
	[1052] = {icon = "NONE", name = "Экспедиция Орды", faction = "-", other = "Wrath of the Lich King",},
	[1050] = {icon = "NONE", name = "Экспедиция Отважных", faction = "-", other = "Авангард Альянса",},
	[2156] = {icon = "NONE", name = "Экспедиция Таланджи", faction = "-", other = "Battle for Azeroth",},
	-- [2380] = {icon = "NONE", name = "Экспедиция Таланджи (идеал)", faction = "-", other = "Battle for Azeroth",},
	[1275] = {icon = "NONE", name = "Элла", faction = "-", other = "Земледельцы",},
	[1888] = {icon = "NONE", name = "Яндвикские врайкулы", faction = "-", other = "Legion",},
	[909] = {icon = "NONE", name = "Ярмарка Новолуния", faction = "-", other = "World of Warcraft",},
}

