local GlobalAddonName, E = ...
local AddonTitle = C_AddOns.GetAddOnMetadata(GlobalAddonName, "Title")
--------------------------------------------------------------------------------
E.Octo_Table.OctoTable_itemID_Config = {
	-- 224073, -- Зачарованный позолоченный герб Предвестницы
	-- 224072, -- Зачарованный рунический герб Предвестницы
	-- 224069, -- Зачарованный истертый герб Предвестницы
	-- 220790, -- Формирующийся рунический герб Предвестницы
	-- 220789, -- Формирующийся позолоченный герб Предвестницы
	-- 220788, -- Формирующийся истертый герб Предвестницы
	-- 200652, -- Мешочек алхимических приправ
	-- 200095, -- Горшок с припасами
	-- 166750, -- Настой десяти краев
	-- 137642, -- Почетный знак
	-- 122284, -- Жетон WoW
	-- 188152,
	-- 37011, -- Волшебная метла
	-- 33226, -- Тыквовинские сладости
	-- 224412,
	-- 222955,
	-- 222922,
}
E.Octo_Table.OctoTable_itemID_ALL = {
	-- 71083,
	-- 219150,
	-- 232877, -- Своевременный мешочек с полезными вещицами
	-- 232366, -- Искаженный временем ключ от реликвария
	-- 232365, -- Искаженный временем ключ от реликвария
	-- 231510, -- Искаженный временем ключ от реликвария
	-- 229899, -- Осколок ключа от сундука
	-- 229359, -- Мешочек с полезными вещицами Хроми
	-- 226813, -- Золотой камень доблести
	-- 226505, -- Нерубский ткач самоцветов
	-- 224556, -- Сейф славного соперника
	-- 224461, -- Кости Маннорота
	-- 224073, -- Зачарованный позолоченный герб Предвестницы
	-- 224072, -- Зачарованный рунический герб Предвестницы
	-- 224069, -- Зачарованный истертый герб Предвестницы
	-- 223909, -- Средний бронзовый ларь
	-- 221509, -- Оружие путешественника во времени
	-- 220790, -- Формирующийся рунический герб Предвестницы
	-- 220789, -- Формирующийся позолоченный герб Предвестницы
	-- 220788, -- Формирующийся истертый герб Предвестницы
	-- 220773, -- Праздничный комплект рунических гербов Предвестницы
	-- 220769, -- Алгарийский знак признания
	-- 220767, -- Триумфальная сумка с резными гербами Предвестницы
	-- 220520, -- Сияющий отголосок
	-- 218114, -- Око пробуждения
	-- 217930, -- Сертификат Ноствина
	-- 217409, -- Знак признания Аспектов
	-- 217382, -- Рубиновый драконий камень
	-- 216665, -- Пространственный сжиматель для банка отряда
	-- 213089, -- Старинный бронзовый слиток
	-- 212493, -- Странный кусок воска
	-- 212384, -- Неспокойная сумка с пробужденными гребнями дракона
	-- 212367, -- Пригоршня пробужденных гребней змея
	-- 211952, -- Сумка с пробужденными гребнями дракона
	-- 211951, -- Мешочек с пробужденными гребнями дракончика
	-- 211950, -- Оживленная пригоршня пробужденных гребней змея
	-- 211516, -- Искра пробуждения
	-- 211515, -- Расщепленная искра пробуждения
	-- 211495, -- Сновидческая руна усиления
	-- 211297, -- Расколотая искра Знамения
	-- 211296, -- Искра Знамения
	-- 211279, -- Тайник с сокровищами Бесконечности
	-- 210944, -- Изумрудный знак искусности
	-- 210871, -- Большой уголь Фир'алата
	-- 210780, -- Малый уголь Фир'алата
	-- 210776, -- Малый настой Сна
	-- 210737, -- Папка с исследовательскими записями
	-- 210494, -- Раскаленная сущность
	-- 210436, -- Колыбель природы
	-- 210346, -- Самопекущееся печенье на травах
	-- 210333, -- Плащ бесконечных возможностей
	-- 210254, -- Кокон Прилива Снов
	-- 210049, -- Легенда об Элун'ахире
	-- 210041, -- Партия товаров
	-- 209856, -- Капсула растянутого времени
	-- 209419, -- Обугленные останки элементалей
	-- 208951, -- Параказуальная друза
	-- 208945, -- Параказуальный ящик
	-- 208821, -- Знак признания Аспектов
	-- 208649, -- "О природе Сна"
	-- 208619, -- "Трагедия Эринетрии"
	-- 208153, -- Хризалида Дикого Сна
	-- 208068, -- Гнилая вкуснятина
	-- 207728, -- Фир'алат Воздаятель Снов
	-- 207584, -- Ящик нестабильной реальности
	-- 207583, -- Ящик коллапсировавшей реальности
	-- 207582, -- Ящик измененной реальности
	-- 207030, -- Капсула растянутого времени
	-- 207002, -- Инкапсулированная судьба
	-- 206366, -- Надтреснутый трофей раздора
	-- 206350, -- Сияющие останки
	-- 206144, -- Любопытный изначальный гриб
	-- 206143, -- Наполненные энергией временные споры
	-- 206142, -- Зелье с камешками
	-- 206141, -- Радужная улиточья слизь
	-- 206140, -- Успокаивающий изумрудный чай
	-- 206139, -- Нестабильные багровые угли
	-- 206046, -- Тронутая бездной реликвия
	-- 206034, -- Набросок шипящей руны
	-- 206031, -- Витиеватые руны закали
	-- 206030, -- Знамя с роскошной вышивкой
	-- 206028, -- Сундук с золотом
	-- 206025, -- Израсходованная аптечка с эластичными бинтами
	-- 206021, -- Фосфоресцирующая чешуйка Коб'рока
	-- 206019, -- Брошенный запасной парашют
	-- 206017, -- Скрижаль уробороса
	-- 206016, -- Скрижаль уробороса
	-- 206015, -- Скрижаль уробороса
	-- 206014, -- Скрижаль уробороса
	-- 206013, -- Чертежи души
	-- 206012, -- Чертежи разума
	-- 206011, -- Чертежи кости
	-- 206010, -- Чертежи плоти
	-- 206009, -- Скрижаль уробороса
	-- 205999, -- Вулканический резец
	-- 205989, -- Символ дружбы
	-- 205988, -- Копье старейшины закали
	-- 205987, -- Серный спасательный круг
	-- 205986, -- Старый потертый горн
	-- 205984, -- Выменянная карта раскопок
	-- 205982, -- Потерянная карта раскопок
	-- 205903, -- Обменный камушек
	-- 205878, -- Земляной камень обсидианового аспекта
	-- 205686, -- Щелкающая клешня
	-- 205370, -- Дар исследователя
	-- 205369, -- Дар признательного исследователя
	-- 205368, -- Дар благодарного исследователя
	-- 205367, -- Дар обязанного исследователя
	-- 205347, -- Ниффские припасы
	-- 205288, -- Зарытые вещи ниффов
	-- 205250, -- Подарок Ее Ароматейшества
	-- 205249, -- Жгучие благовония ниффов
	-- 205225, -- Знак признания Аспектов
	-- 205219, -- Бесполезный бартерный булыжник
	-- 205216, -- Слегка сколотые самоцветы
	-- 205214, -- Редкие резные раковины
	-- 205213, -- Подозрительный грибок
	-- 205212, -- Костная слизь
	-- 205211, -- Питательная протожидкость
	-- 205188, -- Бартерный булыжник
	-- 205151, -- Извилиск
	-- 205001, -- Резонирующий магический кристалл
	-- 204999, -- Сияющая водяная сфера
	-- 204990, -- Покрытый лавой сумрачный кристалл
	-- 204988, -- Пропитанные серой кожи
	-- 204987, -- Закаленный лавой "нож" кожевника
	-- 204986, -- Напитанное огнем прогорклое масло
	-- 204985, -- Обменный кирпич
	-- 204855, -- Разогнанное ядро решимости
	-- 204853, -- Использованный дракотистовый бур
	-- 204850, -- Пригоршня каз'горитовых болтов
	-- 204843, -- Драконий знак искусности
	-- 204727, -- Желанная безделушка
	-- 204726, -- Огромный сундук дракона
	-- 204725, -- Большой сундук дракона
	-- 204724, -- Малый сундук дракона
	-- 204723, -- Большой сундук дракончика
	-- 204722, -- Огромный сундук дракончика
	-- 204721, -- Малый сундук дракончика
	-- 204710, -- Закаленная в пламени Тьмы броневая пластина
	-- 204697, -- Зачарованный гребень Аспекта из пламени Тьмы
	-- 204682, -- Зачарованный гребень змея из пламени Тьмы
	-- 204681, -- Зачарованный гребень дракончика из пламени Тьмы
	-- 204579, -- Концентрированная некротическая магия
	-- 204578, -- Концентрированная тайная магия
	-- 204577, -- Концентрированная магия природы
	-- 204576, -- Концентрированная темная магия
	-- 204575, -- Концентрированная магия земли
	-- 204574, -- Концентрированная магия льда
	-- 204573, -- Концентрированная магия огня
	-- 204560, -- Лазурный кристалл прорицателя
	-- 204559, -- Сущность прорицания
	-- 204558, -- Свиток зоркости из реликвария
	-- 204475, -- Сломанный драконий генератор червоточин
	-- 204471, -- Бракованный набор для выживания
	-- 204470, -- Спешно отбракованная бомба
	-- 204469, -- Потерянные схемы потоков лавы Аберрия
	-- 204464, -- Сущность пламени Тьмы
	-- 204463, -- Дракотист
	-- 204440, -- Искра пламени Тьмы
	-- 204403, -- Мешочек с мешочком странных вещиц
	-- 204383, -- Мешочек странных вещиц
	-- 204381, -- Сияющая сумка с припасами союза Вальдраккена
	-- 204380, -- Сияющий мешок с припасами кентавров Маруук
	-- 204379, -- Сияющая сумка с искарскими припасами
	-- 204378, -- Сияющая сумка с припасами Драконьей экспедиции
	-- 204359, -- Кошелек гонщика Запретного края
	-- 204352, -- Остатки слизи стихий
	-- 204276, -- Неведомое запретное знание
	-- 204233, -- Непробиваемое ядро стихий
	-- 204232, -- Коготь вожака лис-виверн
	-- 204231, -- Королевская баранья шкура
	-- 204230, -- Крепкое омытое копье
	-- 204229, -- Мерцающая руна Чаротрикса
	-- 204228, -- Непереваренный лепесток хоэнвейса
	-- 204227, -- Самотекучий антифриз
	-- 204226, -- Пепел пламенного копыта
	-- 204225, -- Безупречное перо ветра
	-- 204224, -- Крупица магического познания
	-- 204222, -- Аметриновый осколок-проводник
	-- 204217, -- Нестабильный элементий
	-- 204215, -- Дремлющий изначальный фрагмент
	-- 204191, -- Малый обсидиановый герб чести
	-- 204190, -- Обсидиановый герб чести
	-- 204189, -- Великий обсидиановый герб чести
	-- 204188, -- Малый обсидиановый трофей завоеваний
	-- 204187, -- Обсидиановый трофей завоеваний
	-- 204186, -- Великий обсидиановый трофей завоеваний
	-- 203710, -- Негасимый ключ
	-- 203702, -- Экспериментальный объединитель
	-- 203683, -- Оберег Фиракка
	-- 203681, -- Штормовой сундук воинов стихий
	-- 203430, -- Оберег Игиры
	-- 203224, -- Сундук с лишними припасами Вальдраккена
	-- 203222, -- Комплект с лишними припасами Маруук
	-- 203220, -- Сумка с лишними искарскими припасами
	-- 203217, -- Ящик с лишними припасами экспедиции
	-- 202872, -- Знак благословения
	-- 202871, -- Драконий артефакт
	-- 202870, -- Таинственные записи
	-- 202670, -- Запечатанный свиток знаний
	-- 202669, -- Запечатанный свиток рыбы
	-- 202668, -- Запечатанный свиток духа
	-- 202667, -- Запечатанный свиток артефакта
	-- 202395, -- Обертка Warcraft Rumble
	-- 202371, -- Сияющий сундук воинов стихий
	-- 202196, -- Ключ от Зкерского хранилища
	-- 202173, -- Магмовая частица
	-- 202171, -- Обсидиановый драконий камень
	-- 202163, -- Призовой сундучок Warcraft Rumble
	-- 202162, -- Монета Warcraft Rumble
	-- 202152, -- Заряженный молнией манипулятор
	-- 202142, -- Сейф Драконьей Погибели
	-- 202098, -- Яркий ящик разной руды
	-- 202097, -- Навороченный набор шикарных шкур
	-- 202094, -- Знак кентавров Маруук
	-- 202093, -- Знак союза Вальдраккена
	-- 202092, -- Знак искарских клыкарров
	-- 202091, -- Знак Драконьей экспедиции
	-- 202080, -- Тайник с сокровищами из хранилища
	-- 202079, -- Тайник с сокровищами из хранилища
	-- 202052, -- Терпение Дозорного Времени
	-- 202017, -- Спасенные фурболгские артефакты
	-- 202016, -- Заряженная кость
	-- 202014, -- Насыщенная пыльца
	-- 202011, -- Заряженный стихиями камень
	-- 201991, -- Печатка Сарги
	-- 201924, -- Знак союза Вальдраккена
	-- 201923, -- Знак кентавров Маруук
	-- 201922, -- Знак искарских клыкарров
	-- 201921, -- Знак Драконьей экспедиции
	-- 201836, -- Знак признания Аспектов
	-- 201817, -- Сумеречный тайник
	-- 201782, -- Благословение Тира
	-- 201781, -- Память Тира
	-- 201756, -- Набитый монетами кошелек
	-- 201755, -- Сейф обсидианового главного кузнеца
	-- 201728, -- Сейф Вакрила
	-- 201462, -- Желудок любопытной формы
	-- 201439, -- Восстановленный сон
	-- 201352, -- Сумка с реагентами для кожи
	-- 201326, -- Драконья сумка сотрудничества
	-- 201325, -- Драконья руна усиления
	-- 201301, -- Радужная руда
	-- 201300, -- Радужные куски руды
	-- 201278, -- Редкие записи шкуродера
	-- 201277, -- Редкие записи рудокопа
	-- 201276, -- Редкие записи травника
	-- 201275, -- Редкие схемы кожевника
	-- 201274, -- Редкие иллюстрации ювелира
	-- 201273, -- Редкие черновики инженера
	-- 201272, -- Редкие исследования зачаровывателя
	-- 201271, -- Редкие схемы портного
	-- 201270, -- Редкие исследования алхимика
	-- 201269, -- Редкие рунические наброски начертателя
	-- 201268, -- Редкие схемы кузнеца
	-- 201250, -- Сейф победоносного соперника
	-- 201023, -- Драконий трактат о снятии шкур
	-- 201020, -- Шелковый сюрприз
	-- 201018, -- Побывавший в деле барабан
	-- 201017, -- Огневой самоцвет
	-- 201016, -- Гармонический кристальный гармонизатор
	-- 201015, -- Поддельная колода карт Новолуния
	-- 201014, -- Ракета "Бумтир"
	-- 201013, -- Останки со следами магии
	-- 201012, -- Зачарованные обломки
	-- 201011, -- Магические клещи
	-- 201010, -- Диаграмма оружия куалаши
	-- 201009, -- Наброски рукавицы сокольничего
	-- 201008, -- Расплавленный слиток
	-- 201006, -- Драконий плавень
	-- 201005, -- Любопытные слитки
	-- 201003, -- Мохнатый кисель
	-- 200982, -- Пыльные записи шкуродера
	-- 200981, -- Пыльные записи рудокопа
	-- 200980, -- Пыльные записи травника
	-- 200979, -- Пыльные схемы кожевника
	-- 200978, -- Пыльные иллюстрации ювелира
	-- 200977, -- Пыльные черновики инженера
	-- 200976, -- Пыльные исследования зачаровывателя
	-- 200975, -- Пыльные схемы портного
	-- 200974, -- Пыльные исследования алхимика
	-- 200973, -- Пыльные рунические наброски начертателя
	-- 200972, -- Пыльные схемы кузнеца
	-- 200846, -- Стрелы без оперения
	-- 200811, -- Капля сгустившегося сока
	-- 200764, -- Осклизлые блестяшки
	-- 200686, -- Изначальное средоточие
	-- 200678, -- Сноцвет
	-- 200677, -- Лепесток сноцвета
	-- 200652, -- Мешочек алхимических приправ
	-- 200611, -- Награда за гонку драконов – 3-е место
	-- 200610, -- Награда за гонку драконов – 2-е место
	-- 200609, -- Награда за гонку драконов – 1-е место
	-- 200516, -- Трофеи великой охоты
	-- 200515, -- Трофеи великой охоты
	-- 200513, -- Трофеи великой охоты
	-- 200468, -- Трофеи великой охоты
	-- 200455, -- Знак союза Вальдраккена
	-- 200454, -- Знак кентавров Маруук
	-- 200453, -- Знак искарских клыкарров
	-- 200452, -- Знак Драконьей экспедиции
	-- 200300, -- Мешок добычи
	-- 200289, -- Знак союза Вальдраккена
	-- 200288, -- Знак кентавров Маруук
	-- 200287, -- Знак искарских клыкарров
	-- 200285, -- Знак Драконьей экспедиции
	-- 200224, -- Знак Сарги
	-- 200095, -- Горшок с припасами
	-- 200073, -- Вальдраккенские сокровища
	-- 200072, -- Сейф Драконьей Погибели
	-- 200070, -- Обсидиановый сейф
	-- 200069, -- Обсидиановый тайник
	-- 199839, -- Тусклая первобытная вода
	-- 199838, -- Тусклая первобытная буря
	-- 199837, -- Тусклая первобытная земля
	-- 199836, -- Тусклый первобытный огонь
	-- 199475, -- Переполненная сумка с припасами союза Вальдраккена
	-- 199474, -- Переполненный мешок с припасами кентавров Маруук
	-- 199473, -- Переполненная сумка с искарскими припасами
	-- 199472, -- Переполненная сумка с припасами Драконьей экспедиции
	-- 199197, -- Бутилированная сущность
	-- 199192, -- Кошелек участника драконьей гонки
	-- 199128, -- Полевые заметки мастера снятия шкур
	-- 199122, -- Полевые заметки рудокопа
	-- 199115, -- Полевые заметки травника
	-- 198978, -- До смешного удачный шов
	-- 198977, -- Нить Он'ары
	-- 198976, -- Исключительно мягкая кожа
	-- 198975, -- Окостеневшая шкура
	-- 198974, -- Украшение с удивительным узором
	-- 198973, -- Светящаяся реликвия
	-- 198972, -- Драконьи чары
	-- 198971, -- Любопытная джарадинская руна
	-- 198970, -- Бесконечные разъемы
	-- 198969, -- Метка хранителя
	-- 198968, -- Амулет воина стихий
	-- 198967, -- Первозданный эфир
	-- 198966, -- Расплавленная капля
	-- 198965, -- Фрагмент первобытной земли
	-- 198964, -- Стихийная щепка
	-- 198963, -- Разлагающаяся мокрота
	-- 198869, -- Большая сумка с припасами союза Вальдраккена
	-- 198868, -- Маленькая сумка с припасами союза Вальдраккена
	-- 198866, -- Маленькая сумка с искарскими припасами
	-- 198864, -- Крупный мешок с припасами кентавров Маруук
	-- 198863, -- Маленькая сумка с припасами Драконьей экспедиции
	-- 198841, -- Крупный образец необычной шкуры
	-- 198837, -- Обрезки необычной шкуры
	-- 198789, -- Неповрежденная катушка конденсатора
	-- 198712, -- Образец огненного порошка
	-- 198711, -- Сумка браконьера
	-- 198710, -- Фляга с подозрительной водой
	-- 198704, -- Пульсирующая руна земли
	-- 198703, -- Памятка по языку жестов
	-- 198702, -- Опаленная чужеземная ткань
	-- 198699, -- Таинственное знамя
	-- 198697, -- Контрабандное снадобье
	-- 198696, -- Благословленная ветром шкура
	-- 198693, -- Пыльная карта Новолуния
	-- 198692, -- Примечательный обрывок ковра
	-- 198690, -- Прогнившая чешуя
	-- 198687, -- Тщательно охраняемая блестяшка
	-- 198686, -- Заиндевевший пергамент
	-- 198685, -- Хорошо изолированная кружка
	-- 198684, -- Крошечное знамя бронзовых драконов
	-- 198683, -- Обработанные шкуры
	-- 198682, -- Друза алекстразита
	-- 198680, -- Гнилое одеяло Бурошкуров
	-- 198670, -- Высокий малигит
	-- 198669, -- Как обучить дракончика
	-- 198667, -- Запасные инструменты джарадинов
	-- 198664, -- Кристаллические заросли
	-- 198663, -- Закаленное льдом зелье
	-- 198662, -- Интригующий рулон синей ткани
	-- 198660, -- Разбитый ключ
	-- 198659, -- Книга забывчивого ученика
	-- 198658, -- Насыщенное гнилью дубильное масло
	-- 198656, -- Красивый самоцвет художника
	-- 198613, -- Эскизы кожевенника
	-- 198612, -- Образцы огранки для ювелира
	-- 198611, -- Инженерные детали
	-- 198610, -- Письмена зачаровывателя
	-- 198609, -- Образцы для портного
	-- 198608, -- Алхимические заметки
	-- 198607, -- Символы начертателя
	-- 198606, -- Бумага кузнеца
	-- 198599, -- Экспериментальный образец разложения
	-- 198510, -- Драконий трактат об инженерном деле
	-- 198454, -- Драконий трактат о кузнечном деле
	-- 198438, -- Драконий рецепт в бутылке
	-- 198395, -- Тусклый моллюск с шипами
	-- 198156, -- Генератор червоточин: Драконьи острова
	-- 198046, -- Концентрированный изначальный настой
	-- 197921, -- Изначальный настой
	-- 195502, -- Плененный сердечник Терроса
	-- 195496, -- Око мстительного урагана
	-- 194337, -- Жидкая храбрость
	-- 194081, -- Мутировавший корень
	-- 194080, -- Необычный бутон
	-- 194079, -- Чистый самородок серевита
	-- 194078, -- Идеальная драконитовая чешуйка
	-- 194077, -- Безупречная крепкая чешуя
	-- 194076, -- Экзотическая эластичная кожа
	-- 194072, -- Мешок золота
	-- 194068, -- Чешуя прародителей
	-- 194067, -- Гниющая туша
	-- 194066, -- Мерзлая шкура
	-- 194064, -- Фигурная жеода
	-- 194063, -- Сияющий фрагмент
	-- 194062, -- Неподатливый каменный обломок
	-- 194061, -- Удушающие споры
	-- 194055, -- Первозданная почва
	-- 194054, -- Выкопанный саженец
	-- 194041, -- Побег струецвета
	-- 194040, -- Шкура синекожего
	-- 194039, -- Горячий образец руды
	-- 193913, -- Целые части тела животного
	-- 193910, -- Расплавленная чешуя дракона
	-- 193907, -- Отколотый камень Тира
	-- 193905, -- Торговый журнал искарских клыкарров
	-- 193904, -- Острое перо феникса
	-- 193903, -- Сердечник дозорного
	-- 193902, -- Заржавленное устройство титанов
	-- 193901, -- Изначальная пыль
	-- 193900, -- Призматическая линза
	-- 193899, -- Катушка изначальной нити
	-- 193898, -- Игла из темной кости
	-- 193897, -- Пробужденный катализатор
	-- 193891, -- Экспериментальное вещество
	-- 193201, -- Деталь ключа
	-- 192132, -- Драконитовое точило для клинков
	-- 192131, -- Вальдраккенская цепь для оружия
	-- 192130, -- Оружейная форма Расколотого Пламени
	-- 191915, -- Косматик
	-- 191264, -- Собранный обсидиановый ключ
	-- 190455, -- Концентрированное изначальное средоточие
	-- 190454, -- Истощенный изначальный хаос
	-- 190453, -- Искра искусности
	-- 190189, -- Пустынная реликвия
	-- 189765, -- Мешок с припасами кентавров Маруук
	-- 188152, -- Осколок управления вратами
	-- 187508, -- Клетка с дрессированным громитом
	-- 185834, -- Ориборейские награды
	-- 183616, -- Проклятый сувенир
	-- 180817, -- Шифр перемещения
	-- 174768, -- Проклятая реликвия
	-- 174767, -- Реликвия могу
	-- 174766, -- Реликвия богомолов
	-- 174765, -- Реликвия тол'виров
	-- 174764, -- Фрагмент реликвии тол'виров
	-- 174761, -- Реликвия акиров
	-- 174760, -- Фрагмент реликвии богомолов
	-- 174759, -- Фрагмент реликвии могу
	-- 174758, -- Искаженный Бездной фрагмент реликвии
	-- 174756, -- Фрагмент реликвии акиров
	-- 173363, -- Сосуд жутких видений
	-- 172924, -- Генератор червоточин: Темные Земли
	-- 169610, -- Ящик "ЗПЧСТ"
	-- 169223, -- Ашжра'камас, Покров Решимости
	-- 168946, -- Набор деталей для переработки
	-- 168832, -- Гальванический осциллятор
	-- 168808, -- Генератор червоточин: Зандалар
	-- 168807, -- Генератор червоточин: Кул-Тирас
	-- 168327, -- Цепь зажигания
	-- 168217, -- Закаленная пружина
	-- 168216, -- Закаленная обшивка
	-- 168215, -- Фрезерованный шестеренный механизм
	-- 167862, -- Набор для сборки планера Орды
	-- 166971, -- Разряженный аккумулятор
	-- 166970, -- Аккумулятор
	-- 166846, -- Запасные части
	-- 166751, -- Настой десяти краев
	-- 166750, -- Настой десяти краев
	-- 158075, -- Сердце Азерот
	-- 151652, -- Генератор червоточин: Аргус
	-- 141652, -- Камень поиска маны
	-- 141605, -- Свисток распорядителя полетов
	-- 140192, -- Камень возвращения в Даларан
	-- 138729, -- Зелье обостренных чувств
	-- 138728, -- Зелье обыкновенной невидимости
	-- 138727, -- Зелье непокорности
	-- 138488, -- Зелье соленой воды
	-- 138486, -- Зелье "третьего дыхания"
	-- 137642, -- Почетный знак
	-- 128353, -- Адмиральский компас
	-- 124640, -- Чернильно-черное зелье
	-- 124124, -- Кровь Саргераса
	-- 122457, -- Идеальный тренировочный камень для питомцев
	-- 122284, -- Жетон WoW
	-- 113681, -- Обломки доспехов Железной Орды
	-- 113509, -- Сотворенные булочки из маны
	-- 112059, -- Центрифуга червоточины
	-- 111820, -- Перестановочный бластер
	-- 110560, -- Камень возвращения в гарнизон
	-- 109599, -- Нейроглушитель
	-- 109076,
	-- 92471, -- Дневник Джубеки
	-- 92441, -- Кодекс Зеррата
	-- 92426, -- Запечатанный фолиант Потерянного Легиона
	-- 87215, -- Генератор червоточин: Пандария
	-- 86547, -- Осколок небес
	-- 83078, -- Наследие мастеров (ч. I)
	-- 81055, -- Билет на аттракцион ярмарки Новолуния
	-- 71998, -- Эссенция разрушения
	-- 69237, -- Живой огонь
	-- 64527, -- Наручи гладиаторской битвы
	-- 52253, -- Музыкальная шкатулка Сильваны
	-- 52252, -- Гербовая накидка Светоносного
	-- 52251, -- Медальон Джайны
	-- 52201, -- Благоволение Мурадина
	-- 52200, -- Поводья багрового коня смерти
	-- 52078, -- Сфера хаоса
	-- 52019, -- Ленточка Прелести
	-- 51321, -- Кровь Сильваны
	-- 51320, -- Знак Серебряной Длани
	-- 51319, -- Тренировочный меч Артаса
	-- 51318, -- Медальон Джайны
	-- 51317, -- Осколок души Александроса
	-- 51316, -- Незапечатанный сундук
	-- 50274, -- Осколок Льда Тьмы
	-- 49908, -- Древнейший саронит
	-- 49888, -- Грань Тьмы
	-- 49623, -- Темная Скорбь
	-- 49040, -- Дживс
	-- 48933, -- Генератор червоточин: Нордскол
	-- 47556, -- Сфера рыцаря
	-- 45087, -- Руническая сфера
	-- 44812, -- Индейкомет
	-- 43102, -- Ледяной шар
	-- 37829, -- Призовой жетон Хмельного фестиваля
	-- 37011, -- Волшебная метла
	-- 36942, -- Ледяная Скорбь
	-- 34664, -- Частица солнца
	-- 33226, -- Тыквовинские сладости
	-- 32428, -- Сердце тьмы
	-- 30183, -- Воронка Пустоты
	-- 24919, -- Башмаки Темной Чешуи
	-- 24918, -- Пояс Темной Чешуи
	-- 24917, -- Наручи Пустоверти
	-- 24916, -- Наплечные щитки Пустоверти
	-- 24915, -- Набедренники Пустоверти
	-- 23572, -- Изначальная Пустота
	-- 23247, -- Пылающий цвет
	-- 8529, -- Эликсир Гогельмогеля
	6948, -- Камень возвращения
}
E.Octo_Table.OctoTable_itemID_AutoOpen = {
	227450,
	224784,
	217011,
	217012,
	217013,
	215362,
	200095,
	226263,
	225239,
	233014, -- Сундук с сокровищами торжества бронзовых драконов
	232877, -- Своевременный мешочек с полезными вещицами
	229359, -- Мешочек с полезными вещицами Хроми
	224556, -- Сейф славного соперника
	223953, -- Прощальные дары путешественника во времени
	223909, -- Средний бронзовый ларь
	223908, -- Малый бронзовый ларь
	221509, -- Оружие путешественника во времени
	218130, -- Ларь искателя приключений
	213190, -- Сохранившийся фолиант джарадинов
	213186, -- Пыльный фолиант ниффов
	213185, -- Пыльный фолиант кентавров
	211414, -- Цветущий тайник Сна
	211413, -- Расцветающий тайник Сна
	211411, -- Разрастающийся тайник Сна
	211410, -- Расцветший тайник дикарей
	211394, -- Тайник собранных семян сна
	211389, -- Тайник с интенсивно цветущими сокровищами
	211373, -- Сумка множества чудес
	211303, -- Мешок с припасами дриад.
	211279, -- Тайник с сокровищами Бесконечности
	210992, -- Переполненная сокровищница Стражей сна
	210872, -- Сумка снов
	210657, -- Слегка помятый подарок
	210549, -- Кошелек гонщика Сна
	210224, -- Маленький изумрудный цветок
	210218, -- Большая награда Сна
	210217, -- Маленькая награда Сна
	210063, -- Сумка захватчика с полезными вещами
	210062, -- Железная сумка с полезными вещами
	209871, -- Подарок к Зимнему Покрову
	209833, -- Ящик с доспехами преданного Сну
	209026, -- Набитая добычей тыква
	209024, -- Заполненная добычей тыква
	208211, -- Подарок на годовщину
	208142, -- Зарытая сумка
	208090, -- Сжатая паракаузальность
	207584, -- Ящик нестабильной реальности
	207583, -- Ящик коллапсировавшей реальности
	207582, -- Ящик измененной реальности
	206271, -- Сокровища Коварнессы
	206039, -- Комплект вражды
	205983, -- Нюхопомрачительные ниффские сокровища
	205968, -- Переполненная сумка с лоаммскими припасами
	205965, -- Большая сумка с лоаммскими припасами
	205964, -- Маленькая сумка с лоаммскими припасами
	205877, -- Ларь искателя приключений
	205371, -- Собранные припасы признательного исследователя
	205370, -- Дар исследователя
	205369, -- Дар признательного исследователя
	205368, -- Дар благодарного исследователя
	205367, -- Дар обязанного исследователя
	205347, -- Ниффские припасы
	205346, -- Спрятанное сокровище ниффов
	205288, -- Зарытые вещи ниффов
	205247, -- Грязный позванивающий мешочек
	205226, -- Кошелек пещерного гонщика
	204911, -- Скопление спор
	204712, -- Переполненный мешок с припасами лоаммских ниффов
	204359, -- Кошелек гонщика Запретного края
	203700, -- Рваная подарочная упаковка
	203699, -- Рваная подарочная упаковка
	203681, -- Штормовой сундук воинов стихий
	203476, -- Сундук воинов стихий
	203222, -- Комплект с лишними припасами Маруук
	203220, -- Сумка с лишними искарскими припасами
	203217, -- Ящик с лишними припасами экспедиции
	202371, -- Сияющий сундук воинов стихий
	202172, -- Переполненная сумка монет
	202171, -- Обсидиановый драконий камень
	202142, -- Сейф Драконьей Погибели
	201818, -- Сумеречный тайник
	201756, -- Набитый монетами кошелек
	201754, -- Сундук обсидианового главного кузнеца
	201439, -- Восстановленный сон
	201326, -- Драконья сумка сотрудничества
	201250, -- Сейф победоносного соперника
	200516, -- Трофеи великой охоты
	200515, -- Трофеи великой охоты
	200513, -- Трофеи великой охоты
	200468, -- Трофеи великой охоты
	200073, -- Вальдраккенские сокровища
	200072, -- Сейф Драконьей Погибели
	200070, -- Обсидиановый сейф
	200069, -- Обсидиановый тайник
	199341, -- Отрыгнутый мешок сокровищ рогоплава
	199192, -- Кошелек участника драконьей гонки
	198869, -- Большая сумка с припасами союза Вальдраккена
	198868, -- Маленькая сумка с припасами союза Вальдраккена
	198867, -- Большая сумка с искарскими припасами
	198866, -- Маленькая сумка с искарскими припасами
	198865, -- Большая сумка с припасами Драконьей экспедиции
	198864, -- Крупный мешок с припасами кентавров Маруук
	198863, -- Маленькая сумка с припасами Драконьей экспедиции
	191139, -- Дар старейшин Просветленных
	190178, -- Сумка с первозданными материалами
	189765, -- Мешок с припасами кентавров Маруук
	187574, -- Полное ведро брокера
	187561, -- Подарок к Зимнему Покрову
	187551, -- Сундучок с кортийскими припасами
	187520, -- Слегка помятый подарок
	187440, -- Шлем с плюмажем из перьев
	187354, -- Брошенная сумка брокера
	187278, -- Пронзенная когтями шкатулка Верных Утробе
	186708, -- Стакан для кистей с золотом
	186706, -- Шляпа с золотом
	186692, -- Шлем с золотом
	186691, -- Сумка с золотом
	186688, -- Ведерко с золотом
	186533, -- Тайник с сокровищами Святилища
	186196, -- Трофейный сундук Легиона Смерти
	185993, -- Трофейный сундук перерожденных
	185992, -- Трофейный сундук Неумирающей армии
	185991, -- Трофейный сундук Дикой Охоты
	185990, -- Трофейный сундук Жнецов
	185972, -- Тайник мучителя
	185906, -- Подарок на годовщину
	185765, -- Груз толстых загрубевших шкур
	184642, -- Тайник защитника-травника
	184641, -- Тайник защитника-горняка
	184640, -- Тайник защитника-шкуродера
	184638, -- Рыбный тайник героя
	184636, -- Тайник странствующего шкуродера
	184635, -- Тайник странствующего горняка
	184634, -- Тайник странствующего травника
	184633, -- Мясной тайник защитника
	184631, -- Тайник странствующего зачаровывателя
	184630, -- Тайник странствующего портного
	184395, -- Тайник павшего искателя приключений
	183702, -- Великолепие природы
	183701, -- Материалы для ритуалов очищения
	183699, -- Изысканные ингредиенты
	181741, -- Дар идеала
	181733, -- Дар верных долгу
	181732, -- Дар честолюбивых
	181557, -- Благосклонность Двора
	181556, -- Дар Двора
	181476, -- Дар Дикой Охоты
	181475, -- Дар хранителей рощи
	181372, -- Дар перерожденных
	180985, -- Набитая сумка ученика
	180984, -- Набитая сумка подмастерья
	180981, -- Большая сумка ученика
	180980, -- Большая сумка подмастерья
	180977, -- Сумка хранителя духов
	180976, -- Сумка умельца
	180975, -- Сумка подмастерья
	180974, -- Сумка ученика
	178128, -- Сумка с блестяшками
	174959, -- Тайник роя богомолов
	173372, -- Тайник Темной Империи
	171305, -- Найденный контейнер с экипировкой
	170074, -- Посеченный сейф Молота Ашрана
	168740, -- Запечатанный подарок "Блескотрона-7000"
	156698, -- Излучающая спокойствие сумка с полезными предметами
	156689, -- Опаленная сумка с полезными предметами
	156688, -- Обледеневшая сумка с полезными предметами
	156683, -- Сумка с полезными вещами
	156682, -- Сумка с полезными вещами из иного мира
	153248, -- Сокровище Света
	153132, -- Сундук с аргусским снаряжением
	153122, -- Магический тайник змееустов
	149574, -- Набитая добычей тыква
	149504, -- Особенный подарок от "Пастбищ Дымного Леса"
	147432, -- Снаряжение защитника
	144345, -- Горка товаров для питомцев
	144330, -- Зубчатый контейнер
	140227, -- Добыча кровавого охотника
	140226, -- Подсвеченный маной мешок
	140225, -- Трофейная броня
	140224, -- Разделанное мясо
	140221, -- Мешочек с найденными самоцветами
	140220, -- Трофейная ткань
	139137, -- Вещи колдуньи
	133549, -- Грязные ботинки
	132892, -- Запечатанный подарок "Блескотрона-6000"
	117394, -- Сумка с замороженными товарами
	117393, -- Сундук сокровищ в форме бочонка
	117392, -- Заполненная добычей тыква
	116762, -- Украденный подарок
	116404, -- Дары странников
	113258, -- Запечатанный подарок "Блескотрона-5000"
	104272, -- Небесный сундук сокровищ
	103624, -- Сокровища Дола
	93724, -- Приз ярмарки Новолуния
	92718, -- Кошелек бойца
	90840, -- Сияющий мешок с золотом мародера
	87217, -- Небольшой мешок с полезными вещами
	86623, -- Запечатанный подарок "Блескотрона-4000"
	78910, -- Мешок жетонов
	78904, -- Мешочек жетонов
	54537, -- Коробочка в виде сердца
	54516, -- Заполненная добычей тыква
	52002, -- Сумка с полезными вещами
	49909, -- Коробка шоколадных конфет
	46007, -- Мешок рыбацких сокровищ
	44475, -- Усиленный ящик
	44113, -- Маленький мешочек со специями
	37586, -- Пригоршня конфет
	35348, -- Мешок рыбацких сокровищ
	35313, -- Раздувшаяся колючеусая форель
	34863, -- Мешок рыбацких сокровищ
	33857, -- Ящик мяса
	33844, -- Бочка с рыбой
	32724, -- Покрытый тиной предмет
	21363, -- Подарок в разноцветной упаковке
	21327, -- Тикающий подарок
	21310, -- Подарок в яркой упаковке
	21191, -- Тщательно упакованный подарок
	20393, -- Сумка с лакомствами
	17727, -- Подарочный набор от "Пастбищ Дымного Леса"
	17726, -- Особый подарок от "Пастбищ Дымного Леса"
	17685, -- Образчик продукции "Пастбищ Дымного Леса"
	15874, -- Мягкотелый моллюск
	7973, -- Моллюск-болтун
}
E.Octo_Table.OctoTable_itemID_Ignore_List = {
	[224837] = true,
	[34008] = true,
	[49040] = true,
	[49888] = true,
	[49908] = true,
	[77530] = true,
	[77530] = true,
	[81055] = true,
	[90146] = true,
	[109076] = true,
	[111820] = true,
	[154172] = true,
	[154173] = true,
	[154174] = true,
	[154175] = true,
	[154176] = true,
	[154177] = true,
	[166751] = true,
	[167555] = true,
	[180653] = true,
	[188152] = true,
	[193201] = true,
	[201437] = true,
	[203703] = true,
	[204682] = true,
	[204985] = true,
	[205151] = true,
	[205188] = true,
	[205982] = true,
	[206009] = true,
	[206010] = true,
	[206011] = true,
	[206012] = true,
	[206013] = true,
	[206014] = true,
	[206015] = true,
	[206016] = true,
	[206017] = true,
	[206021] = true,

	[207030] = true,
	[208153] = true,
	[208485] = true,
	[211495] = true,
}
E.Octo_Table.OctoTable_itemID_ItemsDelete = {
	211376, -- Проросшее семя
	210737, -- Папка с исследовательскими записями
	210656, -- Носки к Зимнему Покрову
	210501, -- Гербовая накидка Стражей Сна
	210434, -- Маска Урсола
	210412, -- Цветущий чудозмейчик
	210346, -- Самопекущееся печенье на травах
	210049, -- Легенда об Элун'ахире
	209419, -- Обугленные останки элементалей
	208937, -- Грязный журнал
	208825, -- Гоночный пояс младшего хранителя времени
	208649, -- "О природе Сна"
	208619, -- "Трагедия Эринетрии"
	208396, -- Расщепленная искра снов
	208144, -- Депеша реставратора номер два
	208067, -- Сочное семя сна
	208066, -- Малое семя сна
	208047, -- Огромное семя сна
	207802, -- Записки Бобби о мыслительной шапке
	207026, -- Слияние Прилива Снов
	206961, -- Зачарованный гребень Аспекта из Сна
	206960, -- Зачарованный гребень змея из Сна
	206959, -- Искра снов
	204717, -- Расщепленная искра пламени Тьмы
	204715, -- Выкопанная ароматная монета
	204682, -- Зачарованный гребень змея из пламени Тьмы
	204440, -- Искра пламени Тьмы
	204215, -- Дремлющий изначальный фрагмент
	202039, -- Субстанция шторма
	200865, -- Мерцающая друза изерилла
	199906, -- Реликвия титанов
	199211, -- Первобытная сущность
	198817, -- Прочный кристалл
	198816, -- Аэрокосмический драконит
	198815, -- Пепел
	198814, -- Взрывоопасные испарения
	198357, -- Защитная эгида
	198058, -- Тренировочная матрица титанов III
	198048, -- Тренировочная матрица титанов I
	198046, -- Концентрированный изначальный настой
	197921, -- Изначальный настой
	197747, -- Ребрышки могучего мамонта
	197746, -- Бок зуброна
	197743, -- Филе чирка
	197742, -- Мясо ребристого моллюска
	194968, -- Лазурная иглоспинка
	194967, -- Мелкокрылая рыба-пегас
	194966, -- Тысячезубая пиранья
	194730, -- Чешуебрюхая скумбрия
	192055, -- Артефакт Драконьих островов
	191784, -- Драконий осколок знания
	191570, -- Драконий алхимический раствор
	191529, -- Блистательное озарение
	191396, -- Зелье порывов ветра
	191394, -- Зелье утихшего ветра
	191393, -- Зелье утихшего ветра
	191385, -- Воздушное зелье маны
	191384, -- Воздушное зелье маны
	191379, -- Освежающее лечебное зелье
	191378, -- Освежающее лечебное зелье
	191363, -- Зелье ледяной концентрации
	191357, -- Флакон стихийного хаоса
	190456, -- Рвение мастера
	190453, -- Искра искусности
	180594, -- Огрубевшая кость
	180478, -- Великолепная шкура
	180477, -- Элизийские перья
	172013, -- Праздничный фейерверк
	139004, -- Волшебная палочка – банши
	128646, -- Волшебная палочка – неруб
	128645, -- Волшебная палочка – горгулья
	128644, -- Волшебная палочка – создание
	124124, -- Кровь Саргераса
	120945, -- Первобытный дух
	116854, -- Волшебная палочка – паук
	116853, -- Волшебная палочка – упырь
	116851, -- Волшебная палочка – поганище
	116850, -- Волшебная палочка – вурдалак
	116848, -- Волшебная палочка – слизняк
	86143, -- Бинты для боевых питомцев
	82392, -- Гринделия
	81055, -- Билет на аттракцион ярмарки Новолуния
	43463, -- Свиток ловкости VII
	42780, -- Реликвия Ульдуара
	37604, -- Зубочистка
	37584, -- Успокоительная мятная конфетка
	37583, -- Г.Л.А.Д.О.С.Т.И.
	37582, -- Коричная огненная глыба
	35953, -- Карибу в медовом соусе
	35947, -- Искрящийся морозный гриб
	35188, -- Ухо прихвостня Эрнестуэя
	34068, -- Утяжеленный фонарь из тыквы
	33470, -- Ледяная ткань
	33460, -- Свиток универсальности VI
	33458, -- Свиток интеллекта VI
	33454, -- Соленая оленина
	33452, -- Лишайник с медом
	33448, -- Рунический флакон с зельем маны
	33445, -- Мятный чай с медом
	33444, -- Едкая тюленья сыворотка
	33226, -- Тыквовинские сладости
	22832, -- Гигантский флакон с зельем маны
	22829, -- Гигантский флакон с лечебным зельем
	22578, -- Частица воды
	21325, -- Механический Гринч
	21254, -- Печенье Зимнего Покрова
	20414, -- Волшебная палочка - костюм огонька
	20413, -- Волшебная палочка - случайный костюм
	20411, -- Волшебная палочка - костюм скелета
	20410, -- Волшебная палочка - костюм летучей мыши
	20409, -- Волшебная палочка - костюм призрака
	20399, -- Волшебная палочка - костюм лепрогнома
	20398, -- Волшебная палочка - костюм ниндзя
	20397, -- Волшебная палочка - костюм пирата
	17712, -- Набор для переодевания Зимнего Покрова
	13446, -- Огромный флакон с лечебным зельем
	13444, -- Огромный флакон с зельем маны
	159, -- Освежающая ключевая вода

}
E.Octo_Table.OctoTable_itemID_ItemsUsable = {
	[201437] = 5,
	[31373] = 5,
	[169491] = 3,
	[174756] = 6,
	[174758] = 6,
	[174759] = 6,
	[174760] = 6,
	[174764] = 6,
	[187219] = 6,
	[187728] = 10,
	[190198] = 5,
	[191160] = 5,
	[192658] = 20,
	[203430] = 5,
	[203683] = 5,
	[203710] = 3,
	[204352] = 50,
	[209419] = 20,
}
E.Octo_Table.OctoTable_itemID_ItemsUsable_Cosmetic = {
	212638,
	212640,
	212793,
	212773,
	213375,
	212645,
	213177,
	213186,
	213176,
	212641,
	212639,
	212642,
	213359,
	213183,
	213389,
	213192,
	213204,
	213382,
	213215,
	213208,
	205223,
	213200,
	213357,
	213365,
	212769,
	212977,
	213020,
	212687,
	213024,
	213025,
	213023,
	213021,
	212978,
	212762,
	192796,
	208450,
	208451,
	212371,
	208452,
	208453,
	208454,
	208455,
	208456,
	208457,
	208458,
	208459,
	208546,
	208547,
	212633,
	212634,
	212635,
	212636,
	212637,
	212794,
	212870,
	212941,
	213274,
	213275,
	213276,
	213536,
	210480,
	210481,
	210479,
	210478,
	210476,
	210482,
	210483,
	210485,
	210484,
	210487,
	210471,
	210486,
	3889,
	3892,
	6835, 6836, 8749, 10506, 12185,
	13895, 13896, 13897, 13898, 13899, 13900, 19028, 21154, 21157, 21538,
	21539, 21541, 21542, 21544, 22206, 22276, 22277, 22278, 22279, 22280,
	22281, 22282, 22742, 22743, 22744, 22745, 23323, 23324, 23909, 24580,
	25345, 30719, 33047, 33292, 33436, 33438, 33862, 33863, 33966, 34085,
	34086, 34087, 34683, 34685, 34827, 34828, 38089, 38160, 38161, 38162,
	38163, 38276, 38277, 38278, 38285, 38286, 44647, 44648, 44800, 44803,
	45067, 45072, 45998, 46735, 46860, 46861, 49715, 49916, 50160, 50161,
	50741, 52485, 52486, 52487, 52489, 54451, 56836, 58255, 59600, 60222,
	61509, 63205, 70923, 74278, 74282, 74283, 77550, 77551, 77556, 77560,
	77561, 77564, 77572, 77574, 77577, 77578, 77581, 77596, 77601, 77611,
	77618, 77623, 77628, 77638, 77643, 77649, 77655, 77661, 77663, 77668,
	77673, 77675, 77680, 77682, 77686, 77687, 77689, 77691, 77696, 77706,
	77711, 77714, 77715, 77717, 77740, 77744, 77745, 77758, 77760, 77769,
	77774, 77777, 77782, 77794, 77797, 77798, 77807, 77812, 77818, 77825,
	77829, 77838, 77847, 77848, 77852, 77857, 77859, 77864, 77866, 77877,
	77881, 77891, 77892, 77896, 77902, 77906, 77915, 77921, 77924, 77926,
	78188, 78189, 78190, 78199, 78200, 78206, 78209, 78212, 78213, 78214,
	78216, 78228, 78230, 78231, 78239, 78244, 78245, 78249, 78250, 78252,
	78258, 78263, 78265, 78266, 78268, 78269, 78275, 78276, 78280, 78284,
	78287, 78294, 78296, 78301, 78305, 78315, 78320, 78324, 78329, 78331,
	78340, 78341, 88710, 89801, 90042, 90053, 90054, 90055, 90061, 90062,
	90063, 90065, 90072, 90073, 90074, 90083, 90093, 90098, 90100, 90101,
	90102, 90117, 90124, 90133, 90134, 90140, 90141, 90142, 90143, 90148,
	90152, 90744, 90844, 90845, 90846, 95474, 95475, 97213, 97901, 105743,
	105745, 105746, 105747, 105751, 106306, 106347, 113791, 113793, 113794,
	113795, 113798, 113799, 113801, 113802, 113803, 113805, 113806, 113807,
	113809, 113810, 113811, 113812, 113813, 113814, 113815, 113818, 116052,
	116133, 116134, 116136, 116137, 116450, 117405, 117406, 117407, 117408,
	117409, 117410, 117411, 117412, 117413, 117483, 118366, 118367, 118368,
	118370, 118395, 118396, 118397, 118398, 118399, 118400, 118401, 118402,
	118403, 118404, 118405, 118406, 118407, 118408, 118409, 118410, 118411,
	118412, 118413, 118559, 118560, 118562, 118563, 118568, 118671, 118672,
	118673, 118674, 118918, 119424, 119430, 121364, 128218, 128363, 128364,
	128365, 128455, 128458, 128459, 128465, 128470, 128472, 128473, 130064,
	134110, 134111, 134112, 135548, 138730, 139133, 139134, 139135, 139136,
	139137, 139293, 139294, 139295, 139296, 139297, 139298, 139299, 139304,
	139391, 140999, 141000, 141001, 141002, 143334, 143335, 143337, 143338,
	143340, 143341, 143342, 143344, 143345, 143346, 143348, 143349, 143350,
	143351, 143352, 143353, 143355, 143357, 143359, 143364, 143367, 144342,
	147885, 151352, 151353, 151354, 151355, 151397, 151524, 151675, 151676,
	151677, 151678, 151768, 151769, 151770, 151771, 151804, 151806, 151883,
	151893, 151897, 151905, 152094, 153115, 154791, 155880, 156670, 156673,
	156675, 156677, 156680, 156681, 156690, 156691, 156692, 156695, 156700,
	156701, 156704, 156705, 156889, 156897, 156905, 156913, 160223, 160226,
	160229, 160230, 160289, 160290, 160993, 160999, 161000, 161001, 161002,
	161009, 161012, 161013, 161051, 161052, 161056, 161057, 161064, 162590,
	162592, 162593, 162595, 162610, 162690, 163119, 164369, 164993, 164998,
	165004, 165007, 165931, 165932, 165933, 165935, 165936, 166348, 166349,
	166350, 166353, 166356, 166547, 166549, 166550, 167813, 167818, 167826,
	168004, 168071, 168079, 168088, 168108, 168282, 168286, 168287, 168288,
	168291, 168293, 168298, 168659, 169208, 169448, 170063, 170205, 170206,
	170207, 171256, 171324, 171326, 171329, 171331, 171333, 171337, 171339,
	171340, 171341, 172075, 172076, 172078, 172080, 172082, 172373, 172374,
	172380, 172952, 173524, 173961, 173962, 173963, 173966, 173968, 173969,
	173979, 173980, 174001, 174002, 174005, 174006, 174221, 174224, 174313,
	174855, 175249, 177200, 177208, 177213, 177216, 177217, 177670, 177679,
	177847, 177853, 177857, 177858, 177859, 178183, 178186, 178192, 178198,
	178199, 178201, 178514, 178972, 179509, 179516, 179533, 179585, 179596,
	179654, 179671, 179672, 179790, 179791, 179796, 179797, 179898, 179906,
	179953, 179962, 179963, 179964, 179972, 180005, 180243, 180596, 180751,
	180752, 180755, 180760, 180939, 180940, 180941, 180958, 180963, 181006,
	181008, 181017, 181044, 181053, 181071, 181080, 181098, 181112, 181116,
	181141, 181142, 181143, 181146, 181148, 181150, 181151, 181152, 181154,
	181286, 181287, 181288, 181289, 181290, 181291, 181292, 181294, 181295,
	181296, 181297, 181301, 181302, 181304, 181305, 181306, 181307, 181308,
	181309, 181310, 181311, 181312, 181800, 181801, 181804, 181805, 181806,
	181807, 181808, 181809, 181810, 181811, 181925, 181927, 181928, 181935,
	181936, 181941, 182214, 182217, 182218, 182225, 182226, 182235, 182244,
	182305, 182370, 182374, 182428, 182432, 182435, 182436, 182439, 182481,
	182485, 182494, 182495, 182503, 182512, 182516, 182521, 182530, 182539,
	182548, 183451, 183705, 183706, 183707, 183708, 183709, 183710, 183711,
	183712, 183975, 184083, 184154, 184156, 184537, 184540, 184542, 184828,
	184829, 184830, 184831, 184832, 184833, 184836, 184837, 184939, 184943,
	184948, 184951, 184952, 184957, 184961, 184966, 184969, 184970, 184971,
	184976, 184979, 184983, 184984, 184986, 184987, 184988, 184991, 184992,
	184994, 184995, 184996, 184999, 185000, 185002, 185003, 185008, 185009,
	185014, 185015, 185017, 185019, 185024, 185026, 185028, 185033, 185039,
	185042, 185046, 185057, 185058, 185061, 185066, 185069, 185076, 185079,
	185080, 185081, 185082, 185084, 185085, 185089, 185092, 185093, 185094,
	185102, 185107, 185110, 185111, 185116, 185117, 185119, 185120, 185972,
	186090, 186091, 186092, 186093, 186562, 186977, 186978, 187009, 187010,
	187016, 187019, 187021, 187024, 187025, 187031, 187034, 187035, 187038,
	187040, 187041, 187042, 187043, 187044, 187045, 187046, 187081, 187082,
	187083, 187084, 187087, 187088, 187091, 187092, 187094, 187095, 187096,
	187097, 187098, 187099, 187101, 187240, 187241, 187242, 187243, 187245,
	187248, 187250, 187251, 187252, 187253, 187562, 187780, 187781, 187914,
	188135, 188236, 188237, 188243, 188244, 188248, 188249, 188256, 188257,
	188258, 188259, 188260, 188535, 188543, 188544, 188550, 188551, 188559,
	188566, 188568, 188575, 188583, 188584, 188589, 188590, 188592, 188599,
	188607, 188614, 188622, 188623, 188686, 188687, 188688, 188690, 188744,
	188745, 188746, 188747, 188748, 188749, 188750, 188752, 188753, 189870,
	189871, 189873, 189878, 189879, 189881, 189882, 189885, 189886, 189892,
	189893, 189897, 189898, 190064, 190065, 190071, 190076, 190077, 190078,
	190080, 190087, 190092, 190093, 190094, 190097, 190133, 190139, 190140,
	190142, 190143, 190145, 190146, 190147, 190148, 190149, 190150, 190151,
	190155, 190160, 190167, 190199, 190200, 190202, 190204, 190214, 190215,
	190216, 190217, 190220, 190226, 190230, 190376, 190427, 190429, 190433,
	190434, 190438, 190441, 190444, 190447, 190448, 190449, 190488, 190489,
	190490, 190493, 190494, 190544, 190546, 190556, 190557, 190558, 190559,
	190560, 190562, 190570, 190578, 190599, 190600, 190638, 190673, 190681,
	190683, 190684, 190686, 190687, 190689, 190690, 190693, 190697, 190705,
	190710, 190712, 190720, 190778, 190783, 190785, 190789, 190791, 190792,
	190795, 190798, 190800, 190801, 190802, 190806, 190808, 190813, 190814,
	190815, 190817, 190821, 190824, 190826, 190828, 190829, 190830, 190831,
	190832, 190833, 190843, 190845, 190846, 190855, 190870, 190871, 190876,
	190882, 190883, 190884, 190885, 190886, 190906, 190909, 190910, 190916,
	190931, 190937, 190945, 190946, 190948, 190950, 190951, 191604, 191617,
	191618, 191619, 191620, 191621, 191622, 191625, 191626, 191627, 191628,
	191631, 191775, 191776, 191779, 191832, 191833, 191836, 191957, 192456,
	193069, 193371, 193610, 194325, 194326, 194748, 197101, 198337, 198338,
	198339, 198340, 198341, 198387, 198547, 198551, 198553, 198556, 198557,
	198559, 198560, 198562, 198717, 198746, 198752, 198759, 198761, 198767,
	199539, 199542, 199543, 199545, 199546, 199549, 199550, 199648, 199654,
	199655, 199656, 199659, 199660, 199664, 199669, 199693, 199701, 199703,
	199733, 199735, 199736, 199737, 199738, 199739, 199740, 199741, 199745,
	199772, 199773, 199774, 199775, 199820, 199823, 199856, 199857, 199858,
	199859, 199860, 199862, 199863, 199867, 199875, 199879, 199881, 200485,
	200499, 200511, 200517, 200522, 200525, 200534, 200540, 200541, 200543,
	200545, 200546, 200547, 200559, 200882, 200919, 200954, 200955, 200957,
	200958, 200959, 200962, 200983, 200985, 200986, 200987, 200988, 200990,
	200992, 200993, 200995, 200997, 200998, 201024, 201027, 201029, 201031,
	201035, 201037, 201038, 201039, 201048, 201049, 201050, 201051, 201052,
	201054, 201365, 201368, 201369, 201373, 201380, 201381, 201382, 201388,
	201389, 201390, 201391, 201392, 201395, 201429, 201430, 201432, 201442,
	201443, 201444, 201445, 201447, 201448, 201455, 201456, 201458, 201459,
	201460, 201461, 202123, 202131, 202137, 202190, 202191, 202192, 202193,
	202248, 202295, 202296, 202297, 202298, 202300, 202301, 202303, 202304,
	202305, 202306, 202307, 202308, 203152, 203155, 203156, 203158, 203159,
	203160, 203164, 203165, 203166, 203174, 203176, 203179, 203185, 203186,
	203187, 203188, 203189, 203190, 203194, 203195, 203196, 203679, 203995,
	204081, 204082, 204084, 204086, 204182, 204354, 204355, 204404, 204444,
	204571, 204874, 204875, 204876, 204879, 204880, 204882, 205415, 205421,
	205955, 205971, 205972, 205981, 206004, 206005, 206007, 206020, 206039,
	206137, 206146, 206147, 206148, 206149, 206152, 206154, 206156, 206275,
	206276, 206288, 206297, 206298, 206308, 206309, 206319, 206562, 206588,
	206589, 206590, 206592, 206593, 206764, 206765, 206766, 206767, 206768,
	206769, 206776, 206777, 206778, 206779, 206780, 206781, 206782, 206783,
	206784, 206785, 206786, 206789, 206790, 206791, 206792, 206793, 206794,
	206795, 206796, 206797, 206798, 206799, 206801, 206802, 206803, 206807,
	206808, 206814, 206821, 206825, 206834, 206835, 206839, 206840, 206843,
	206844, 206845, 206846, 206854, 206855, 206858, 206860, 206864, 206869,
	206871, 206873, 206874, 206875, 206879, 206881, 206883, 206892, 206900,
	206901, 206906, 206912, 206921, 206925, 206926, 206927, 206928, 206997,
	207015, 207016, 207053, 207075, 207077, 207093, 207094, 207757, 207758,
	207759, 207760, 207761, 207762, 207763, 207764, 207765, 207766, 207767,
	207768, 207769, 207770, 207771, 207772, 207773, 207774, 207775, 207776,
	207777, 207778, 207779, 207957, 207959, 208039, 208040, 208061, 208062,
	208063, 208064, 208065, 208109, 208110, 208111, 208112, 208113, 208114,
	208115, 208116, 208117, 208118, 208120, 208122, 208125, 208126, 208149,
	208150, 208161, 208162, 208163, 208164, 208165, 208166, 208171, 208173,
	208174, 208175, 208198, 208199, 208207, 208397, 208398, 208402, 208403,
	208406, 208407, 208408, 208411, 208423, 208474, 208476, 208477, 208478,
	208488, 208515, 208600, 208620, 208621, 208623, 208624, 208625, 208626,
	208627, 208628, 208630, 208631, 208632, 208633, 208634, 208635, 208636,
	208637, 208638, 208639, 208640, 208641, 208642, 208643, 208648, 208650,
	208651, 208652, 208653, 208654, 208655, 208656, 208657, 208659, 208660,
	208661, 208662, 208677, 208683, 208684, 208685, 208686, 208688, 208693,
	208694, 208695, 208696, 208697, 208698, 208706, 208707, 208708, 208709,
	208710, 208711, 208712, 208713, 208714, 208715, 208716, 208717, 208718,
	208719, 208720, 208721, 208722, 208723, 208735, 208755, 208759, 208761,
	208762, 208763, 208786, 208787, 208788, 208791, 208792, 208795, 208807,
	208810, 208811, 208817, 208818, 208819, 208820, 208824, 208832, 208874,
	208876, 208882, 208939, 208940, 208941, 208959, 208962, 209038, 209044,
	209065, 209068, 209320, 209321, 209327, 209328, 209329, 209333, 209334,
	209335, 209960, 209961, 209962, 209963, 209964, 209965, 209966, 209967,
	209968, 209969, 209970, 209971, 209972, 209973, 209974, 209975, 209976,
	209977, 209978, 209979, 209980, 209981, 209982, 209983, 209984, 209985,
	209986, 209987, 209988, 209989, 209990, 209991, 209992, 209993, 209994,
	209995, 210021, 210029, 210030, 210031, 210032, 210033, 210034, 210035,
	210036, 210037, 210038, 210039, 210054, 210065, 210066, 210067, 210068,
	210071, 210072, 210073, 210074, 210075, 210076, 210265, 210414, 210415,
	210418, 210433, 210434, 210492, 210493, 210502, 210503, 210504, 210506,
	210507, 210508, 210509, 210510, 210511, 210512, 210513, 210514, 210515,
	210516, 210517, 210518, 210519, 210520, 210521, 210552, 210631, 210659,
	210660, 210661, 210662, 210663, 210664, 210666, 210675, 210676, 210677,
	210678, 210679, 210680, 210682, 210685, 210686, 210788, 210789, 210843,
	210844, 210846, 210848, 210849, 210850, 210851, 210852, 210853, 210854,
	210855, 210856, 210857, 210858, 210859, 210860, 210861, 210862, 210863,
	210865, 210866, 210867, 210868, 210869, 210999, 211001, 211002, 211064,
	211066, 211068, 211069, 211070, 211071, 211072, 211088, 211090, 211091,
	211092, 211093, 211094, 211095, 211096, 211097, 211098, 211099, 211113,
	211114, 211115, 211116, 211117, 211118, 211119, 211120, 211121, 211129,
	211130, 211137, 211145, 211158, 211159, 211164, 211255, 211256, 211258,
	211259, 211267, 211268, 211294, 211295, 211298, 211299, 211381,
}
E.Octo_Table.OctoTable_itemID_ItemsUsable_Mount = {
	211873, 1132, 2411, 2414, 5655, 5656, 5665, 5864, 5873, 8563, 8586, 8588, 8591,
	8595, 8629, 8631, 8632, 12302, 12303, 12351, 12353, 12354, 13086, 13317,
	13321, 13322, 13327, 13328, 13329, 13331, 13332, 13334, 13335, 15277,
	15292, 15293, 18766, 18767, 18772, 18773, 18776, 18777, 18778, 18785,
	18787, 18788, 18790, 18791, 18793, 18795, 18797, 18902, 19029, 19030,
	19872, 19902, 21176, 21218, 21321, 21323, 21324, 23720, 25470, 25471,
	25472, 25529, 25533, 28481, 28915, 28936, 29102, 29103, 29220, 29221,
	29224, 29227, 29228, 29231, 29465, 29466, 29467, 29468, 29469, 29470,
	29471, 29472, 29743, 29744, 29745, 29747, 30480, 30609, 31829, 31830,
	31835, 32314, 32316, 32317, 32318, 32319, 32458, 32768, 32857, 32858,
	32859, 32860, 32861, 32862, 33809, 33976, 33977, 33999, 34060, 34061,
	34092, 34129, 35513, 37011, 37012, 37676, 37719, 37828, 40775, 41508,
	43516, 43599, 43951, 43952, 43953, 43954, 43955, 43956, 43958, 43959,
	43961, 43962, 43986, 44077, 44080, 44083, 44086, 44151, 44160, 44164,
	44168, 44175, 44177, 44178, 44223, 44224, 44230, 44234, 44235, 44413,
	44554, 44558, 44689, 44707, 44842, 44843, 45125, 45586, 45589, 45591,
	45592, 45593, 45595, 45596, 45597, 45693, 45725, 45801, 45802, 46099,
	46100, 46102, 46109, 46171, 46708, 46743, 46744, 46745, 46746, 46747,
	46748, 46749, 46750, 46751, 46752, 46813, 46814, 46815, 46816, 47100,
	47101, 47179, 47180, 47840, 49044, 49046, 49096, 49098, 49177, 49282,
	49283, 49284, 49285, 49286, 49290, 49636, 50250, 50435, 50818, 51954,
	51955, 52200, 54068, 54069, 54465, 54537, 54797, 54811, 54860, 60954,
	62298, 62461, 62462, 62900, 62901, 63039, 63040, 63041, 63042, 63043,
	63044, 63045, 63046, 63125, 64883, 64998, 64999, 65356, 65891, 67107,
	67151, 68008, 68823, 68824, 68825, 69213, 69224, 69226, 69228, 69230,
	69747, 69846, 70909, 70910, 71339, 71665, 71718, 71954, 72140, 72145,
	72146, 72575, 72582, 73766, 73838, 73839, 74269, 76755, 76889, 76902,
	77067, 77068, 77069, 77956, 78919, 78924, 79771, 79802, 81354, 81559,
	82453, 82765, 82811, 83086, 83087, 83088, 83089, 83090, 84101, 85262,
	85429, 85430, 85666, 85785, 85870, 87250, 87251, 87768, 87769, 87771,
	87773, 87774, 87775, 87776, 87777, 87781, 87782, 87783, 87788, 87789,
	87791, 87795, 87800, 87803, 89154, 89304, 89305, 89306, 89307, 89362,
	89363, 89390, 89391, 89783, 89785, 90655, 90710, 90711, 90712, 91010,
	91802, 92724, 93168, 93169, 93385, 93386, 93662, 93666, 93671, 94228,
	94229, 94230, 94231, 94290, 94291, 94292, 94293, 94296, 95041, 95057,
	95059, 95341, 95416, 95564, 95565, 97989, 98104, 98259, 98405, 98618,
	101675, 102514, 102533, 103638, 104011, 104208, 104246, 104253, 104269,
	104325, 104326, 104327, 104329, 106246, 107951, 108883, 109013, 112326,
	112327, 115363, 115484, 116383, 116655, 116656, 116658, 116659, 116660,
	116661, 116663, 116664, 116665, 116666, 116667, 116668, 116669, 116670,
	116671, 116672, 116673, 116674, 116675, 116676, 116767, 116768, 116769,
	116771, 116772, 116773, 116774, 116775, 116776, 116778, 116779, 116780,
	116781, 116782, 116784, 116785, 116786, 116788, 116789, 116791, 116792,
	116794, 117392, 118515, 118676, 119180, 120968, 121815, 122469, 122703,
	123890, 123974, 124540, 127140, 128025, 128277, 128282, 128311, 128422,
	128425, 128480, 128526, 128527, 128670, 128671, 128706, 129280, 129922,
	129923, 129962, 131734, 133543, 137570, 137573, 137574, 137575, 137576,
	137577, 137578, 137579, 137580, 137614, 137615, 137686, 138201, 138258,
	138387, 138811, 140228, 140230, 140232, 140233, 140353, 140354, 140407,
	140408, 140500, 141216, 141217, 141713, 141843, 141846, 141848, 142224,
	142225, 142226, 142227, 142228, 142231, 142232, 142233, 142236, 142237,
	142369, 142398, 142403, 142436, 142437, 142552, 143489, 143490, 143491,
	143492, 143493, 143502, 143503, 143504, 143505, 143631, 143637, 143638,
	143643, 143649, 143764, 143864, 146897, 146898, 146899, 147804, 147805,
	147806, 147807, 147835, 147901, 151617, 151618, 151623, 152788, 152789,
	152790, 152791, 152794, 152797, 152814, 152815, 152816, 152840, 152841,
	152842, 152843, 152844, 152869, 152870, 152901, 152903, 152904, 152905,
	152912, 152923, 153041, 153042, 153043, 153044, 153191, 153485, 153493,
	153539, 153540, 153594, 155656, 155662, 156486, 156487, 156564, 156798,
	156879, 156884, 157870, 159146, 159842, 159921, 160589, 160829, 161134,
	161215, 161330, 161331, 161479, 161664, 161665, 161666, 161667, 161773,
	161774, 161879, 161908, 161909, 161910, 161911, 161912, 163042, 163063,
	163121, 163123, 163127, 163128, 163131, 163183, 163186, 163216, 163573,
	163574, 163575, 163576, 163577, 163578, 163579, 163582, 163583, 163584,
	163585, 163586, 163589, 163644, 163645, 163646, 163706, 163981, 163982,
	164250, 164571, 164762, 165019, 165020, 166428, 166432, 166433, 166434,
	166435, 166436, 166437, 166438, 166442, 166443, 166463, 166464, 166465,
	166466, 166467, 166468, 166469, 166470, 166471, 166518, 166539, 166705,
	166724, 166745, 166774, 166775, 166776, 166803, 167167, 167170, 167171,
	167751, 167894, 167895, 168055, 168056, 168329, 168370, 168408, 168823,
	168826, 168827, 168829, 168830, 169162, 169163, 169194, 169198, 169199,
	169200, 169201, 169202, 169203, 170069, 172012, 172022, 172023, 173297,
	173299, 173713, 173714, 173887, 173989, 174066, 174067, 174641, 174649,
	174653, 174654, 174752, 174753, 174754, 174769, 174770, 174771, 174836,
	174840, 174841, 174842, 174859, 174860, 174861, 174862, 174872, 180263,
	180413, 180414, 180415, 180461, 180581, 180582, 180646, 180649, 180721,
	180722, 180723, 180724, 180725, 180726, 180727, 180728, 180729, 180730,
	180731, 180748, 180761, 180762, 180763, 180764, 180765, 180766, 180767,
	180768, 180772, 180773, 180945, 180948, 181300, 181316, 181317, 181815,
	181818, 181819, 181820, 181821, 181822, 182074, 182075, 182076, 182077,
	182078, 182079, 182080, 182081, 182082, 182084, 182085, 182209, 182332,
	182589, 182596, 182614, 182650, 182717, 182954, 183052, 183053, 183518,
	183615, 183617, 183618, 183715, 183740, 183741, 183798, 183800, 183801,
	183937, 184013, 184062, 184103, 184158, 184160, 184161, 184162, 184166,
	184167, 184168, 184183, 185965, 185973, 185990, 185991, 185992, 185996,
	186000, 186103, 186177, 186469, 186476, 186477, 186478, 186479, 186480,
	186482, 186483, 186485, 186487, 186488, 186489, 186490, 186492, 186493,
	186494, 186495, 186637, 186638, 186641, 186642, 186643, 186644, 186645,
	186646, 186647, 186648, 186649, 186650, 186651, 186652, 186653, 186654,
	186655, 186656, 186657, 186659, 186713, 187028, 187029, 187182, 187183,
	187525, 187595, 187629, 187630, 187631, 187632, 187638, 187639, 187640,
	187641, 187642, 187644, 187660, 187663, 187664, 187665, 187666, 187667,
	187668, 187669, 187670, 187671, 187672, 187673, 187675, 187676, 187677,
	187678, 187679, 187681, 187682, 187683, 188674, 188696, 188700, 188736,
	188808, 188809, 188810, 189507, 189978, 190168, 190169, 190170, 190231,
	190539, 190580, 190581, 190613, 190636, 190765, 190766, 190767, 190768,
	190771, 191114, 191123, 191290, 191566, 191838, 192557, 192601, 192761,
	192762, 192764, 192772, 192775, 192777, 192779, 192784, 192785, 192786,
	192790, 192791, 192799, 192800, 192806, 192807, 194034, 194106, 194521,
	194549, 194705, 198654, 198808, 198809, 198810, 198811, 198821, 198824,
	198825, 198870, 198871, 198872, 198873, 199412, 200118, 200468, 201425,
	201426, 201440, 201454, 201702, 201704, 201719, 201720, 201788, 201789,
	202086, 204091, 204361, 204382, 204798, 205155, 205197, 205203, 205204,
	205205, 205207, 205209, 205233, 205245, 205246, 206027, 206156, 206162,
	206167, 206566, 206567, 206585, 206673, 206674, 206675, 206676, 206678,
	206679, 206680, 206976, 207821, 207963, 207964, 208152, 208216, 208433,
	208572, 208598, 209060, 209947, 209949, 209950, 209951, 210022, 210057,
	210058, 210059, 210060, 210061, 210069, 210070, 210345, 210412, 210769,
	210774, 210775, 210831, 210833, 210919, 210945, 210946, 210948, 210969,
	211075, 211087, 211089, 213604, 213584, 213609, 213624, 213621, 213598,
	213582, 213576, 213584, 213595, 87784, 213602, 213603, 213605, 213606,
	213607, 213604, 213608, 213609, 213628, 213627, 87786, 87787, 84753,
	213626, 213624, 213625, 213623, 213622, 213621, 218111, 213600,
	213601, 213598, 213597, 213596,
}
E.Octo_Table.OctoTable_itemID_ItemsUsable_Other = {
	211484,
	211483,
	224583,
	201018,
	198680,
	198599,
	198658,
	198694,
	198799,
	198662,
	198686,
	201016,
	198664,
	201013,
	198693,
	201011,
	198683,
	198712,
	194838,
	2027,
	194840,
	2028,
	194841,
	2029,
	210184,
	210185,
	210190,
	210231,
	210228,
	210234,
	210458,
	210459,
	210460,
	210466,
	210464,
	210465,
	210193,
	210194,
	210197,
	210461,
	210462,
	210463,
	210200,
	210201,
	210202,
	210208,
	210211,
	210215,
	198670,
	198692,
	201009,
	198689,
	198660,
	201020,
	198710,
	201004,
	198703,
	198696,
	194842,
	2025,
	194839,
	2034,
	194837,
	2030,
	201006,
	203471,
	201015,
	198659,
	198659,
	198690,
	198656,
	201019,
	198697,
	198682,
	198800,
	198684,
	198669,
	194843,
	2035,
	194845,
	2026,
	201007,
	198702,
	198685,
	201017,
	201010,
	201008,
	198711,
	198789,
	198687,
	198663,
	201014,
	198791,
	201012,
	198798,
	198667,
	201005,
	198704,
	198675,
	198699,
	194836,
	2023,
	194829,
	2024,
	194844,
	2033,
	205213,
	205211,
	205212,
	206031,
	206034,
	206035,
	205216,
	205214,
	205219,
	206030,
	206019,
	206025,
	205001,
	204990,
	204999,
	204471,
	204475,
	204855,
	204470,
	204469,
	204853,
	204480,
	204850,
	205988,
	205987,
	205986,
	204986,
	204987,
	204988,
	17513,
	17510,
	17516,
	17517,
	17512,
	17514,
	17511,
	17515,
	226271,
	226272,
	226282,
	226283,
	226290,
	226291,
	226298,
	226299,
	226307,
	226306,
	226314,
	226315,
	226322,
	226323,
	226330,
	226331,
	226338,
	226339,
	226346,
	226347,
	226354,
	226355,
	226269,
	226270,
	226280,
	226281,
	226288,
	226289,
	226296,
	226297,
	226304,
	226305,
	226312,
	226313,
	226320,
	226321,
	226328,
	226329,
	226336,
	226337,
	226344,
	226345,
	226352,
	226353,
	226265,
	226266,
	226276,
	226277,
	226284,
	226285,
	226292,
	226293,
	226300,
	226301,
	226308,
	226309,
	226316,
	226317,
	226324,
	226325,
	226332,
	226333,
	226340,
	226341,
	226348,
	226349,
	226267,
	226268,
	226278,
	226279,
	226286,
	226287,
	226294,
	226295,
	226310,
	226311,
	226302,
	226303,
	226318,
	226319,
	226326,
	226327,
	226334,
	226335,
	226342,
	226343,
	226350,
	226351,
	-- 227669, -- Teleportation Scroll
	226353, -- Royal Outfitter's Protractor
	226352, -- Arathi Rotary Cutter
	226346, -- Nerubian's Slicking Iron
	226345, -- Arathi Craftsman's Spokeshave
	226344, -- Arathi Tanning Agent
	226343, -- Fungarian's Rich Tannin
	226342, -- Artisan's Drawing Knife
	226339, -- Nerubian Mining Supplies
	226336, -- Arathi Precision Drill
	226335, -- Regenerating Ore
	226334, -- Earthen Excavator's Shovel
	226330, -- Nerubian Tanning Mallet
	226329, -- Arathi Leather Burnisher
	226328, -- Arathi Beveler Set
	226327, -- Earthen Awl
	226326, -- Underground Stropping Compound
	226324, -- Earthen Lacing Tools
	226322, -- Ritual Caster's Crystal
	226321, -- Librarian's Magnifiers
	226320, -- Arathi Sizing Gauges
	226319, -- Jeweler's Delicate Drill
	226318, -- Carved Stone File
	226317, -- Earthen Gem Pliers
	226315, -- Venomancer's Ink Well
	226313, -- Calligrapher's Chiseled Marker
	226312, -- Informant's Fountain Pen
	226311, -- Blue Earthen Pigment
	226310, -- Runic Scroll
	226308, -- Dornogal Scribe's Quill
	226305, -- Arathi Herb Pruner
	226304, -- Arathi Garden Trowel
	226303, -- Fungarian Slicer's Knife
	226302, -- Earthen Digging Fork
	226299, -- Emptied Venom Canister
	226297, -- Arathi Safety Gloves
	226296, -- Holy Firework Dud
	226295, -- Earthen Construct Blueprints
	226294, -- Inert Mining Bomb
	226293, -- Dornogal Spectacles
	226290, -- Book of Dark Magic
	226289, -- Enchanted Arathi Scroll
	226288, -- Essence of Holy Fire
	226287, -- Animated Enchanting Dust
	226286, -- Soot-Coated Orb
	226285, -- Silver Dornogal Rod
	226282, -- Nerubian Smith's Kit
	226281, -- Radiant Tongs
	226280, -- Holy Flame Forge
	226279, -- Earthen Chisels
	226278, -- Ringing Hammer Vise
	226277, -- Dornogal Hammer
	226270, -- Sanctified Mortar and Pestle
	226269, -- Chemist's Purified Water
	226268, -- Engraved Stirring Rod
	226267, -- Reinforced Beaker
	225249, -- Rattling Bag o' Gold
	225235, -- Deepstone Crucible
	225234, -- Alchemical Sediment
	225233, -- Dense Bladestone
	225232, -- Coreway Billet
	225231, -- Powdered Fulgurance
	225230, -- Crystalline Repository
	225229, -- Earthen Induction Coil
	225228, -- Rust-Locked Mechanism
	225227, -- Wax-Sealed Records
	225226, -- Striated Inkstone
	225225, -- Deepstone Fragment
	225224, -- Diaphanous Gem Shards
	225223, -- Sturdy Nerubian Carapace
	225222, -- Stone-Leather Swatch
	225221, -- Spool of Webweave
	225220, -- Chitin Needle
	224580, -- Massive Sapphire Chunk
	220483, -- Tuning Wand
	213389, -- Ancient Centaur Diary
	213271, -- Work Orders
	213208, -- Pot of Pickled Ancheevies
	211417, -- Dream Wardens Insignia
	211416, -- Dream Wardens Insignia
	211380, -- Tangled Yarn of Secrets
	211379, -- Tangled Yarn of Secrets
	211378, -- Tangled Yarn of Secrets
	211377, -- Tangled Yarn of Secrets
	211374, -- Tangled Yarn of Secrets
	211372, -- Q'onzu's Consolation Prize
	211371, -- Dryad-Keeper Credentials
	211370, -- Branch of Gracus
	211369, -- Charred Staff of the Overseer
	211366, -- Drops of Moon Water
	211353, -- Roasted Ram Special
	210997, -- Spare Party Hat
	210996, -- Moonberry's Many Mischief Makers
	210969, -- Salatrancer
	210959, -- Pact of the Netherwing
	210958, -- Crown of the Dryad Daughter
	210957, -- Rune of the Fire Druids
	210954, -- Sprout of Rebirth
	210952, -- Spare Heated Hearthstone
	210951, -- Treacherous Research Notes
	210950, -- Insight of Q'onzu
	210948, -- Imagiwing
	210946, -- Mammyth
	210945, -- Stargrazer
	210923, -- Clutch of Wyrm's Dreaming Crests
	210921, -- Bounty of the Fallen Defector
	210920, -- Gift of Amirdrassil
	210917, -- Pouch of Whelpling's Dreaming Crests
	210916, -- Ember of Fyrakk
	210847, -- Tears of the Eye
	210833, -- Talont
	210831, -- Delugen
	210790, -- Ensemble: Elegant Green Dragon Outerwear
	210785, -- Snorr
	210777, -- Drowsey
	210770, -- Satchel of Drake's Dreaming Crests
	210768, -- Viridescent Bouquet of Aspect's Dreaming Crests
	210762, -- Shimmering Clutch of Wyrm's Dreaming Crests
	210757, -- Scales of Remorse
	210756, -- Gleaming Satchel of Drake's Dreaming Crests
	210730, -- Mark of the Dream Wardens
	210661, -- Dreamcatcher's Crescent
	210652, -- Somnolet
	210567, -- Memorie
	210555, -- Dreamhoof
	210553, -- Dreamborne Scarab
	210536, -- Renewed Proto-Drake: Embodiment of the Blazing
	210505, -- Reverie
	210498, -- Fused Essence
	210468, -- Emerald Blossom Dreamstone
	210466, -- Flamesworn Render
	210465, -- Deathstalker Chassis
	210464, -- Amirdrassil Defender's Shield
	210463, -- Snuggle Buddy
	210462, -- Plush Pillow
	210461, -- Exceedingly Soft Wildercloth
	210460, -- Primalist Shadowbinding Rune
	210459, -- Grove Keeper's Pillar
	210458, -- Winnie's Notes on Flora and Fauna
	210421, -- Dream Wardens Insignia
	210234, -- Essence of Dreams
	210231, -- Everburning Core
	210228, -- Pure Dream Water
	210215, -- Dreamtalon Claw
	210211, -- Molted Faerie Dragon Scales
	210208, -- Tuft of Dreamsaber Fur
	210202, -- Coalesced Dreamstone
	210201, -- Handful of Tiny Pebbles
	210200, -- Petrified Hope
	210198, -- Depleted Battery
	210197, -- Unhatched Battery
	210194, -- Insomniotron
	210193, -- Experimental Dreamcatcher
	210190, -- Blazeroot
	210185, -- Splash Potion of Narcolepsy
	210184, -- Half-Filled Dreamless Sleep Potion
	210180, -- Emerald Flightstone
	210148, -- Overflowing Satchel of Pilfered Recipes
	210061, -- Reins of Anu'relos, Flame's Guidance
	210024, -- Ensemble: Temporal Burdens
	209944, -- Friendsurge Defenders
	209858, -- Dreamsurge Remnant
	209839, -- Tangible Whispers of Dreaming
	209837, -- Faint Whispers of Dreaming
	209831, -- Wyrm's Bountiful Chest
	209067, -- Ensemble: Chromatically Calibrated Ectoplasmic Specs
	209066, -- Ensemble: Chromatically Calibrated Cranial Cannons
	209064, -- Ensemble: Chromatically Calibrated Retinal Armor
	209063, -- Ensemble: Chromatically Calibrated Bio-Optic Killshades
	209062, -- Ensemble: Chromatically Calibrated Holo-Gogs
	209037, -- Cache of Amirdrassil Treasures
	209036, -- Cache of Amirdrassil Treasures
	209035, -- Hearthstone of the Flame
	208952, -- Soridormi's Letter of Commendation
	208926, -- Dreambound Weapon
	208924, -- Dreambound Necklace
	208923, -- Dreambound Ring
	208922, -- Dreambound Cloak
	208921, -- Dreambound Leather Gloves
	208920, -- Dreambound Mail Gloves
	208919, -- Dreambound Plate Gloves
	208918, -- Dreambound Cloth Gloves
	208917, -- Dreambound Cloth Boots
	208916, -- Dreambound Plate Boots
	208915, -- Dreambound Mail Boots
	208914, -- Dreambound Leather Boots
	208913, -- Dreambound Leather Belt
	208912, -- Dreambound Mail Belt
	208911, -- Dreambound Cloth Belt
	208910, -- Dreambound Plate Belt
	208909, -- Dreambound Plate Bracers
	208908, -- Dreambound Cloth Bracers
	208907, -- Dreambound Mail Bracers
	208906, -- Dreambound Leather Bracers
	208905, -- Dreambound Leather Spaulders
	208904, -- Dreambound Mail Spaulders
	208903, -- Dreambound Cloth Spaulders
	208902, -- Dreambound Plate Spaulders
	208901, -- Dreambound Plate Leggings
	208900, -- Dreambound Cloth Leggings
	208899, -- Dreambound Mail Leggings
	208898, -- Dreambound Leather Leggings
	208897, -- Dreambound Leather Chestpiece
	208896, -- Dreambound Mail Chestpiece
	208895, -- Dreambound Cloth Chestpiece
	208894, -- Dreambound Plate Chestpiece
	208893, -- Dreambound Leather Helm
	208892, -- Dreambound Mail Helm
	208891, -- Dreambound Cloth Helm
	208890, -- Dreambound Plate Helm
	208879, -- Ensemble: Kaldorei Protector's Adornment
	208859, -- Cliffside Wylderdrake: Day of the Dead Armor
	208831, -- Tyr's Titan Key
	208742, -- Renewed Proto-Drake: Brewfest Armor
	208738, -- Ephemeral Pear
	208617, -- Ebon Blade Commendation Badge
	208551, -- Ambrosial Sporestone
	208490, -- Ensemble: Infinite Acolyte's Regalia
	208475, -- Ensemble: Forsaken Champion's Attire
	208390, -- Bronze Archive Stone
	208210, -- Celebration Package
	208206, -- Teleportation Crystal
	208200, -- Dragon Isles Drakes: Gilded Armor
	208181, -- Shandris's Scouting Report
	208151, -- Tobias' Leash
	208138, -- N'Ruby
	208134, -- Rustbolt Resistance Insignia
	208133, -- Orgrimmar Insignia
	208132, -- Stormwind Insignia
	208106, -- Winding Slitherdrake: Visage of the Infinite
	208105, -- Windborne Velocidrake: Visage of the Infinite
	208102, -- Cliffside Wylderdrake: Visage of the Infinite
	208095, -- Cache of Timewarped Treasures
	208094, -- Cache of Timewarped Treasures
	208090, -- Contained Paracausality
	208058, -- Minute Glass
	208054, -- A Mystery Box
	208013, -- Killbot 9000
	208012, -- Briarhorn Hatchling
	208009, -- Gill'dan
	208008, -- Doomrubble
	208006, -- Greater Paracausal Chest
	207594, -- Looter's Purse
	207480, -- Venerated Smoldering Dreamheart
	207476, -- Venerated Ashen Dreamheart
	207472, -- Venerated Blazing Dreamheart
	207468, -- Venerated Tormented Dreamheart
	207464, -- Venerated Verdurous Dreamheart
	207082, -- Jingoist's Cloth Armor Bag
	207081, -- Warmonger's Cloth Armor Bag
	207080, -- Jingoist's Leather Armor Bag
	207079, -- Warmonger's Leather Armor Bag
	207078, -- Jingoist's Mail Armor Bag
	207076, -- Warmonger's Plate Armor Bag
	207074, -- Warmonger's Cloth Gear Bag
	207073, -- Warmonger's Cloth Equipment Bag
	207072, -- Jingoist's Cloth Equipment Bag
	207071, -- Jingoist's Cloth Gear Bag
	207070, -- Warmonger's Leather Gear Bag
	207069, -- Warmonger's Leather Equipment Bag
	207068, -- Jingoist's Leather Equipment Bag
	207067, -- Jingoist's Leather Gear Bag
	207066, -- Warmonger's Mail Equipment Bag
	207065, -- Warmonger's Mail Gear Bag
	207064, -- Jingoist's Mail Gear Bag
	207063, -- Jingoist's Mail Equipment Bag
	207057, -- Gift of the White War Wolf
	207052, -- Jingoist's Plate Equipment Bag
	207051, -- Warmonger's Plate Equipment Bag
	207050, -- Warmonger's Plate Gear Bag
	207049, -- Ensemble: Decorous Garments
	207048, -- Ensemble: Lifegiver's Garms
	207047, -- Ensemble: Hauberk of Discipline
	207046, -- Ensemble: Valhalas Ceremonial Armor
	207027, -- Greater Encapsulated Destiny
	207024, -- Paracausal Fragment of Shalamayne
	207020, -- Ensemble: Rift-Mender's Vestments
	207015, -- Warmonger's Ripper
	207014, -- Jingoist's Slicer
	206955, -- Highland Drake: Embodiment of the Hellforged
	206887, -- Warmonger's Cape
	206886, -- Warmonger's Warboots
	206885, -- Warmonger's Gauntlets
	206884, -- Warmonger's Greathelm
	206883, -- Warmonger's Legplates
	206882, -- Warmonger's Pauldrons
	206880, -- Warmonger's Vambraces
	206879, -- Warmonger's Breastplate
	206878, -- Jingoist's Breastplate
	206877, -- Jingoist's Vambraces
	206876, -- Jingoist's Girdle
	206874, -- Jingoist's Legplates
	206872, -- Jingoist's Gauntlets
	206870, -- Jingoist's Cape
	206868, -- Jingoist's Drape
	206867, -- Jingoist's Footpads
	206866, -- Jingoist's Grips
	206865, -- Jingoist's Casque
	206864, -- Jingoist's Legguards
	206863, -- Jingoist's Mantle
	206862, -- Jingoist's Clasp
	206861, -- Jingoist's Bonds
	206857, -- Warmonger's Bonds
	206856, -- Warmonger's Clasp
	206854, -- Warmonger's Legguards
	206853, -- Warmonger's Casque
	206852, -- Warmonger's Grips
	206851, -- Warmonger's Footpads
	206850, -- Warmonger's Drape
	206849, -- Warmonger's Cloak
	206848, -- Warmonger's Boots
	206847, -- Warmonger's Gloves
	206846, -- Warmonger's Headcover
	206845, -- Warmonger's Pantaloons
	206842, -- Warmonger's Belt
	206841, -- Warmonger's Bracers
	206838, -- Jingoist's Bracers
	206837, -- Jingoist's Belt
	206836, -- Jingoist's Spaulders
	206834, -- Jingoist's Headcover
	206833, -- Jingoist's Gloves
	206832, -- Jingoist's Boots
	206831, -- Jingoist's Cloak
	206829, -- Jingoist's Shroud
	206828, -- Jingoist's Treads
	206827, -- Jingoist's Mitts
	206826, -- Jingoist's Hood
	206824, -- Jingoist's Epaulets
	206823, -- Jingoist's Cord
	206822, -- Jingoist's Wristwraps
	206819, -- Warmonger's Shroud
	206818, -- Warmonger's Treads
	206817, -- Warmonger's Mitts
	206816, -- Warmonger's Skullcap
	206814, -- Warmonger's Leggings
	206812, -- Warmonger's Epaulets
	206810, -- Warmonger's Cord
	206809, -- Warmonger's Wristwraps
	206804, -- Clockwork Mallet
	206795, -- Titan Watcher's Shortblade
	206792, -- Subjugator's Shield
	206788, -- Utopian Tabard
	206778, -- Northern Ballista
	206770, -- Consuming Claws
	206680, -- Reins of the Scourgebound Vanquisher
	206679, -- Perfected Juggernaut
	206676, -- Felstorm Dragon
	206675, -- Gold-Toed Albatross
	206674, -- Reins of the Ravenous Black Gryphon
	206673, -- Horn of the White War Wolf
	206575, -- Dented Raider's Boots
	206574, -- Dented Raider's Leggings
	206573, -- Dented Raider's Belt
	206572, -- Dented Raider's Gauntlets
	206571, -- Dented Raider's Bracers
	206570, -- Dented Raider's Chestpiece
	206569, -- Dented Raider's Spaulders
	206568, -- Dented Raider's Helmet
	206565, -- Plagued Grain
	206342, -- Ensemble: Wanderer's Sepia Trappings
	206341, -- Ensemble: Wanderer's Lively Trappings
	206340, -- Ensemble: Wanderer's Grassy Trappings
	206339, -- Ensemble: Wanderer's Cloudy Trappings
	206338, -- Ensemble: Wanderer's Deep Trappings
	206337, -- Ensemble: Wanderer's Camo Trappings
	206336, -- Ensemble: Wanderer's Brick Trappings
	206335, -- Ensemble: Wanderer's Faded Trappings
	206334, -- Ensemble: Wanderer's Plum Trappings
	206333, -- Ensemble: Wanderer's Aquatic Trappings
	206332, -- Ensemble: Wanderer's Sunny Trappings
	206331, -- Ensemble: Vagabond's Sepia Threads
	206330, -- Ensemble: Vagabond's Lively Threads
	206329, -- Ensemble: Vagabond's Grassy Threads
	206328, -- Ensemble: Vagabond's Cloudy Threads
	206327, -- Ensemble: Vagabond's Deep Threads
	206326, -- Ensemble: Vagabond's Camo Threads
	206325, -- Ensemble: Vagabond's Brick Threads
	206324, -- Ensemble: Vagabond's Faded Threads
	206323, -- Ensemble: Vagabond's Plum Threads
	206322, -- Ensemble: Vagabond's Aquatic Threads
	206321, -- Ensemble: Vagabond's Sunny Threads
	206271, -- Malicia's Hoard
	206270, -- Volcanic Equipment Chest
	206195, -- Path of the Naaru
	206136, -- Heroic Dungeon Delver's Trophy Crest
	206135, -- Heroic Dungeon Delver's Trophy Chest
	206037, -- Ruby Flightstone
	206035, -- Ancient Research
	206034, -- Hissing Rune Draft
	206031, -- Intricate Zaqali Runes
	206006, -- Earth-Warder's Thanks
	205998, -- Sign of Respect
	205992, -- Regurgitated Half-Digested Fish
	205991, -- Shiny Token of Gratitude
	205985, -- Loamm Niffen Insignia
	205970, -- Azure Flightstone
	205967, -- Cache of Aberrus Treasures
	205966, -- Cache of Aberrus Treasures
	205958, -- Ensemble: Azure Renewal Finery
	205876, -- Highland Drake: Embodiment of the Hellforged
	205865, -- Winding Slitherdrake: Embodiment of the Obsidian Gladiator
	205682, -- Large Shadowflame Residue Sack
	205445, -- Bartered Herbalism Journal
	205444, -- Bartered Skinning Journal
	205443, -- Bartered Mining Journal
	205442, -- Bartered Tailoring Journal
	205441, -- Bartered Inscription Journal
	205440, -- Bartered Alchemy Journal
	205439, -- Bartered Blacksmithing Journal
	205438, -- Bartered Enchanting Journal
	205437, -- Bartered Leatherworking Journal
	205436, -- Bartered Engineering Journal
	205435, -- Bartered Jewelcrafting Journal
	205434, -- Bartered Herbalism Notes
	205433, -- Bartered Skinning Notes
	205432, -- Bartered Mining Notes
	205431, -- Bartered Tailoring Notes
	205430, -- Bartered Inscription Notes
	205429, -- Bartered Alchemy Notes
	205428, -- Bartered Blacksmithing Notes
	205427, -- Bartered Enchanting Notes
	205426, -- Bartered Leatherworking Notes
	205425, -- Bartered Engineering Notes
	205424, -- Bartered Jewelcrafting Notes
	205374, -- Thankful Researcher's Scrounged Goods
	205373, -- Researcher's Scrounged Goods
	205372, -- Indebted Researcher's Scrounged Goods
	205365, -- Loamm Niffen Insignia
	205363, -- Ensemble: Ornate Black Dragon Labwear
	205358, -- Niffen Notebook of Herbalism Knowledge
	205357, -- Niffen Notebook of Skinning Knowledge
	205356, -- Niffen Notebook of Mining Knowledge
	205355, -- Niffen Notebook of Tailoring Knowledge
	205354, -- Niffen Notebook of Inscription Knowledge
	205353, -- Niffen Notebook of Alchemy Knowledge
	205352, -- Niffen Notebook of Blacksmithing Knowledge
	205351, -- Niffen Notebook of Enchanting Knowledge
	205350, -- Niffen Notebook of Leatherworking Knowledge
	205348, -- Niffen Notebook of Jewelcrafting Knowledge
	205342, -- Loamm Niffen Insignia
	205341, -- Winding Slitherdrake: Heavy Scales
	205254, -- Honorary Explorer's Compass
	205253, -- Farmhand's Abundant Harvest
	205251, -- Champion's Rock Bar
	205250, -- Gift of the High Redolence
	205248, -- Clanging Dirt-Covered Pouch
	205214, -- Snubbed Snail Shells
	205024, -- Cheddar
	205010, -- Crimson Swoglet
	204999, -- Shimmering Aqueous Orb
	204988, -- Sulfur-Soaked Skins
	204987, -- Lava-Forged Leatherworker's "Knife"
	204986, -- Flame-Infused Scale Oil
	204888, -- Ensemble: Waveborne Diplomat's Regalia
	204855, -- Overclocked Determination Core
	204726, -- Drake's Bountiful Chest
	204724, -- Drake's Small Chest
	204578, -- Condensed Arcane Magic
	204574, -- Condensed Frost Magic
	204560, -- Azure Scrying Crystal
	204480, -- Inconspicuous Data Miner
	204469, -- Misplaced Aberrus Outflow Blueprints
	204447, -- Ensemble: Black Dragonflight's Vestments
	204403, -- Sack of Sack of Oddities
	204381, -- Brimming Valdrakken Accord Supply Pack
	204380, -- Brimming Maruuk Centaur Supply Satchel
	204378, -- Brimming Dragonscale Expedition Supply Pack
	204361, -- Winding Slitherdrake
	204222, -- Conductive Ametrine Shard
	204180, -- Cracked Medal of Honor
	203986, -- Ensemble: Bloodsoaked Plate
	203985, -- Ensemble: Bloodstained Mail
	203984, -- Ensemble: Blooddrenched Leather
	203983, -- Ensemble: Bloodtinged Cloth
	203982, -- Ensemble: Zandalar Vindicator
	203981, -- Ensemble: Zandalar Demoniac
	203980, -- Ensemble: Zandalar Augur
	203979, -- Ensemble: Zandalar Madcap
	203978, -- Ensemble: Zandalar Confessor
	203977, -- Ensemble: Zandalar Freethinker
	203976, -- Ensemble: Zandalar Illusionist
	203975, -- Ensemble: Zandalar Predator
	203974, -- Ensemble: Zandalar Haruspec
	203700, -- Tattered Gift Package
	203699, -- Tattered Gift Package
	203696, -- Ensemble: Dust Devil Armor
	203695, -- Ensemble: Firestorm Armor
	203694, -- Ensemble: Cyclonic Battlegear
	203693, -- Ensemble: Cloudburst Regalia
	203681, -- Stormed Primalist Cache
	203650, -- Primalist Weapon
	203649, -- Primalist Trinket
	203648, -- Primalist Necklace
	203647, -- Primalist Ring
	203646, -- Primalist Cloak
	203645, -- Primalist Leather Gloves
	203644, -- Primalist Mail Gloves
	203643, -- Primalist Plate Gloves
	203642, -- Primalist Cloth Gloves
	203641, -- Primalist Cloth Boots
	203640, -- Primalist Plate Boots
	203639, -- Primalist Mail Boots
	203638, -- Primalist Leather Boots
	203637, -- Primalist Leather Belt
	203636, -- Primalist Mail Belt
	203635, -- Primalist Cloth Belt
	203634, -- Primalist Plate Belt
	203633, -- Primalist Plate Bracers
	203632, -- Primalist Cloth Bracers
	203631, -- Primalist Mail Bracers
	203630, -- Primalist Leather Bracers
	203629, -- Primalist Leather Spaulders
	203628, -- Primalist Mail Spaulders
	203627, -- Primalist Cloth Spaulders
	203626, -- Primalist Plate Spaulders
	203623, -- Primalist Plate Leggings
	203622, -- Primalist Cloth Leggings
	203620, -- Primalist Mail Leggings
	203619, -- Primalist Leather Leggings
	203618, -- Primalist Leather Chestpiece
	203617, -- Primalist Mail Chestpiece
	203616, -- Primalist Cloth Chestpiece
	203615, -- Primalist Plate Chestpiece
	203614, -- Primalist Leather Helm
	203613, -- Primalist Mail Helm
	203612, -- Primalist Cloth Helm
	203611, -- Primalist Plate Helm
	203471, -- Tasty Candy
	203365, -- Winding Slitherdrake: Hairy Throat
	203364, -- Winding Slitherdrake: Small Finned Throat
	203363, -- Winding Slitherdrake: Large Finned Throat
	203362, -- Winding Slitherdrake: Hairy Tail
	203361, -- Winding Slitherdrake: Finned Tip Tail
	203360, -- Winding Slitherdrake: Large Finned Tail
	203359, -- Winding Slitherdrake: Shark Finned Tail
	203358, -- Winding Slitherdrake: Small Finned Tail
	203357, -- Winding Slitherdrake: Spiked Tail
	203355, -- Winding Slitherdrake: Yellow Scales
	203354, -- Winding Slitherdrake: White Scales
	203353, -- Winding Slitherdrake: Red Scales
	203352, -- Winding Slitherdrake: Green Scales
	203351, -- Winding Slitherdrake: Bronze Scales
	203350, -- Winding Slitherdrake: Blue Scales
	203349, -- Winding Slitherdrake: Curved Nose Horn
	203348, -- Winding Slitherdrake: Pointed Nose
	203347, -- Winding Slitherdrake: Large Spiked Nose
	203346, -- Winding Slitherdrake: Curled Nose
	203345, -- Winding Slitherdrake: Split Jaw Horns
	203344, -- Winding Slitherdrake: Single Jaw Horn
	203343, -- Winding Slitherdrake: Hairy Jaw
	203342, -- Winding Slitherdrake: Triple Jaw Horns
	203341, -- Winding Slitherdrake: Long Jaw Horns
	203340, -- Winding Slitherdrake: Cluster Jaw Horns
	203339, -- Winding Slitherdrake: Impaler Horns
	203338, -- Winding Slitherdrake: Antler Horns
	203337, -- Winding Slitherdrake: Thorn Horns
	203336, -- Winding Slitherdrake: Paired Horns
	203335, -- Winding Slitherdrake: Curved Horns
	203334, -- Winding Slitherdrake: Curled Horns
	203333, -- Winding Slitherdrake: Short Horns
	203332, -- Winding Slitherdrake: Spiked Horns
	203331, -- Winding Slitherdrake: Cluster Horns
	203330, -- Winding Slitherdrake: Swept Horns
	203329, -- Winding Slitherdrake: Heavy Horns
	203328, -- Winding Slitherdrake: White Horns
	203327, -- Winding Slitherdrake: Tan Horns
	203325, -- Winding Slitherdrake: Red Hair
	203324, -- Winding Slitherdrake: White Hair
	203323, -- Winding Slitherdrake: Brown Hair
	203322, -- Winding Slitherdrake: Blonde Hair
	203321, -- Winding Slitherdrake: Curled Cheek Horn
	203320, -- Winding Slitherdrake: Ears
	203319, -- Winding Slitherdrake: Finned Cheek
	203318, -- Winding Slitherdrake: Hairy Crest
	203317, -- Winding Slitherdrake: Small Finned Crest
	203316, -- Winding Slitherdrake: Large Finned Crest
	203315, -- Winding Slitherdrake: Small Spiked Crest
	203314, -- Winding Slitherdrake: Curved Chin Horn
	203313, -- Winding Slitherdrake: Spiked Chin
	203312, -- Winding Slitherdrake: Cluster Chin Horn
	203311, -- Winding Slitherdrake: Hairy Chin
	203310, -- Winding Slitherdrake: Grand Chin Thorn
	203309, -- Winding Slitherdrake: Long Chin Horn
	203308, -- Winding Slitherdrake: Hairy Brow
	203307, -- Winding Slitherdrake: Plated Brow
	203306, -- Winding Slitherdrake: Horned Brow
	203304, -- Winding Slitherdrake: Yellow and Silver Armor
	203303, -- Winding Slitherdrake: Red and Gold Armor
	203300, -- Winding Slitherdrake: Blue and Silver Armor
	203299, -- Winding Slitherdrake: Green and Bronze Armor
	203216, -- Ensemble: Wolf's Heritage Warsong Armor Set
	203215, -- Ensemble: Wolf's Heritage Frostwolf Armor Set
	203214, -- Ensemble: Wolf's Heritage Blackrock Armor Set
	203213, -- Ensemble: Lion's Heritage White Armor Set
	203212, -- Ensemble: Lion's Heritage Scarlet Armor Set
	203211, -- Ensemble: Lion's Heritage Blue Armor Set
	202867, -- Warcraft Rumble Toy: Whelp Egg
	202866, -- Warcraft Rumble Toy: Whelp Egg
	202865, -- Warcraft Rumble Toy: Whelp Egg
	202864, -- Warcraft Rumble Toy: Murloc
	202863, -- Warcraft Rumble Toy: Murloc
	202862, -- Warcraft Rumble Toy: Murloc
	202861, -- Warcraft Rumble Toy: Undead Ghoul
	202860, -- Warcraft Rumble Toy: Undead Ghoul
	202859, -- Warcraft Rumble Toy: Undead Ghoul
	202858, -- Warcraft Rumble Toy: Stonehoof Tauren
	202857, -- Warcraft Rumble Toy: Stonehoof Tauren
	202856, -- Warcraft Rumble Toy: Stonehoof Tauren
	202853, -- Warcraft Rumble Toy: Night Elf Huntress
	202852, -- Warcraft Rumble Toy: Night Elf Huntress
	202851, -- Warcraft Rumble Toy: Night Elf Huntress
	202640, -- Zenith Cooling Fluid
	202639, -- Zenith Ventilation Fluid
	202638, -- Zenith Mixing Fluid
	202637, -- Zenith Corrupting Fluid
	202636, -- Venerated Cooling Fluid
	202635, -- Mystic Cooling Fluid
	202634, -- Dreadful Cooling Fluid
	202633, -- Venerated Ventilation Fluid
	202632, -- Mystic Ventilation Fluid
	202631, -- Dreadful Ventilation Fluid
	202630, -- Zenith Melting Fluid
	202629, -- Venerated Melting Fluid
	202628, -- Mystic Melting Fluid
	202627, -- Dreadful Melting Fluid
	202626, -- Venerated Mixing Fluid
	202625, -- Mystic Mixing Fluid
	202624, -- Dreadful Mixing Fluid
	202623, -- Venerated Corrupting Fluid
	202622, -- Mystic Corrupting Fluid
	202621, -- Dreadful Corrupting Fluid
	202280, -- Renewed Proto-Drake: Pronged Tail
	202279, -- Renewed Proto-Drake: Malevolent Horns
	202278, -- Renewed Proto-Drake: Antlers
	202277, -- Renewed Proto-Drake: Bruiser Horns
	202275, -- Renewed Proto-Drake: Plated Jaw
	202274, -- Renewed Proto-Drake: Plated Brow
	202273, -- Renewed Proto-Drake: Stubby Snout
	202263, -- Warcraft Rumble Toy: Sneed
	202262, -- Warcraft Rumble Toy: Sneed
	202261, -- Warcraft Rumble Toy: Sneed
	202260, -- Warcraft Rumble Toy: Maiev
	202259, -- Warcraft Rumble Toy: Maiev
	202179, -- Ensemble: Wanderer's Carrot Trappings
	202178, -- Ensemble: Vagabond's Carrot Threads
	202170, -- Ensemble: Vagabond's Rosy Threads
	202167, -- Ensemble: Wanderer's Rosy Trappings
	202102, -- Immaculate Sac of Swog Treasures
	202101, -- Topped Trunk of Disenchanted Detritus
	202100, -- Populous Pack of Castoff Cloth
	202099, -- Stocked Sack of Hale Herbs
	202097, -- Bulging Box of Skins and Scales
	202094, -- Maruuk Centaur Insignia
	202093, -- Valdrakken Accord Insignia
	202092, -- Iskaara Tuskarr Insignia
	202091, -- Dragonscale Expedition Insignia
	202080, -- Cache of Vault Treasures
	202079, -- Cache of Vault Treasures
	202058, -- Timewatcher's Patience
	202057, -- Earthwarden's Prize
	202056, -- Keeper's Glory
	202055, -- Dreamer's Vision
	202054, -- Queen's Gift
	202052, -- Timewatcher's Patience
	202016, -- Saturated Bone
	202014, -- Infused Pollen
	202011, -- Elementally Charged Stone
	201931, -- Warcraft Rumble Toy: Maiev
	201924, -- Valdrakken Accord Insignia
	201923, -- Maruuk Centaur Insignia
	201922, -- Iskaara Tuskarr Insignia
	201921, -- Dragonscale Expedition Insignia
	201872, -- Ensemble: Sinful Gladiator's Cloth Armor
	201871, -- Ensemble: Sinful Gladiator's Leather Armor
	201870, -- Ensemble: Sinful Gladiator's Mail Armor
	201869, -- Ensemble: Sinful Gladiator's Plate Armor
	201868, -- Ensemble: Sinful Aspirant's Cloth Armor
	201867, -- Ensemble: Sinful Aspirant's Leather Armor
	201866, -- Ensemble: Sinful Aspirant's Mail Armor
	201865, -- Ensemble: Sinful Aspirant's Plate Armor
	201864, -- Ensemble: Unchained Gladiator's Cloth Armor
	201863, -- Ensemble: Unchained Gladiator's Leather Armor
	201862, -- Ensemble: Unchained Gladiator's Mail Armor
	201861, -- Ensemble: Unchained Gladiator's Plate Armor
	201860, -- Ensemble: Unchained Aspirant's Cloth Armor
	201859, -- Ensemble: Unchained Aspirant's Leather Armor
	201858, -- Ensemble: Unchained Aspirant's Mail Armor
	201857, -- Ensemble: Unchained Aspirant's Plate Armor
	201856, -- Ensemble: Cosmic Gladiator's Death Knight Armor
	201855, -- Ensemble: Cosmic Gladiator's Demon Hunter Armor
	201854, -- Ensemble: Cosmic Gladiator's Druid Armor
	201853, -- Ensemble: Cosmic Gladiator's Hunter Armor
	201852, -- Ensemble: Cosmic Gladiator's Mage Armor
	201851, -- Ensemble: Cosmic Gladiator's Monk Armor
	201850, -- Ensemble: Cosmic Gladiator's Paladin Armor
	201849, -- Ensemble: Cosmic Gladiator's Priest Armor
	201848, -- Ensemble: Cosmic Gladiator's Rogue Armor
	201847, -- Ensemble: Cosmic Gladiator's Shaman Armor
	201846, -- Ensemble: Cosmic Gladiator's Warlock Armor
	201845, -- Ensemble: Cosmic Gladiator's Warrior Armor
	201844, -- Ensemble: Cosmic Aspirant's Cloth Armor
	201843, -- Ensemble: Cosmic Aspirant's Leather Armor
	201842, -- Ensemble: Cosmic Aspirant's Mail Armor
	201841, -- Ensemble: Cosmic Aspirant's Plate Armor
	201817, -- Twilight Cache
	201815, -- Cloak of Many Faces
	201792, -- Highland Drake: Embodiment of the Crimson Gladiator
	201790, -- Renewed Proto-Drake: Embodiment of the Storm-Eater
	201782, -- Tyr's Blessing
	201781, -- Memory of Tyr
	201779, -- Merithra's Blessing
	201755, -- Obsidian Forgemaster's Strongbox
	201743, -- Technique: Windborne Velocidrake: Silver and Blue Armor
	201742, -- Technique: Renewed Proto-Drake: Silver and Blue Armor
	201741, -- Technique: Renewed Proto-Drake: Bovine Horns
	201739, -- Technique: Windborne Velocidrake: Steel and Orange Armor
	201738, -- Technique: Renewed Proto-Drake: Steel and Yellow Armor
	201737, -- Technique: Highland Drake: Steel and Yellow Armor
	201736, -- Technique: Cliffside Wylderdrake: Steel and Yellow Armor
	201735, -- Technique: Highland Drake: Silver and Blue Armor
	201734, -- Technique: Cliffside Wylderdrake: Silver and Blue Armor
	201728, -- Vakril's Strongbox
	201717, -- Notebook of Crafting Knowledge
	201716, -- Notebook of Crafting Knowledge
	201715, -- Notebook of Crafting Knowledge
	201714, -- Notebook of Crafting Knowledge
	201713, -- Notebook of Crafting Knowledge
	201712, -- Notebook of Crafting Knowledge
	201711, -- Notebook of Crafting Knowledge
	201710, -- Notebook of Crafting Knowledge
	201709, -- Notebook of Crafting Knowledge
	201708, -- Notebook of Crafting Knowledge
	201706, -- Notebook of Crafting Knowledge
	201705, -- Notebook of Crafting Knowledge
	201700, -- Notebook of Crafting Knowledge
	201462, -- Curiously-Shaped Stomach
	201459, -- Tyrhold Shortsword
	201457, -- Tyrhold Relic
	201426, -- Brown War Ottuk
	201425, -- Yellow War Ottuk
	201393, -- Dragonspawn Spellweaver's Focus
	201388, -- Dragonspawn Wingtipped Staff
	201353, -- Bag of Mail Armor Reagents
	201352, -- Bag of Leather Reagents
	201343, -- Bag of Cloth Armor Reagents
	201323, -- Essence of Awakening
	201301, -- Iridescent Ore
	201300, -- Iridescent Ore Fragments
	201289, -- Ancient Skinner's Notes
	201288, -- Ancient Miner's Notes
	201287, -- Ancient Herbalist's Notes
	201286, -- Ancient Leatherworker's Diagrams
	201285, -- Ancient Jeweler's Illustrations
	201284, -- Ancient Engineer's Scribblings
	201283, -- Ancient Enchanter's Research
	201282, -- Ancient Tailor's Diagrams
	201281, -- Ancient Alchemist's Research
	201280, -- Ancient Scribe's Runic Drawings
	201279, -- Ancient Blacksmith's Diagrams
	201278, -- Rare Skinner's Notes
	201277, -- Rare Miner's Notes
	201276, -- Rare Herbalist's Notes
	201275, -- Rare Leatherworker's Diagrams
	201274, -- Rare Jeweler's Illustrations
	201273, -- Rare Engineer's Scribblings
	201272, -- Rare Enchanter's Research
	201271, -- Rare Tailor's Diagrams
	201270, -- Rare Alchemist's Research
	201269, -- Rare Scribe's Runic Drawings
	201268, -- Rare Blacksmith's Diagrams
	201230, -- Ensemble: Helarjar Berserker Warplate
	201229, -- Ensemble: Kvaldir Scout Leathers
	201056, -- Tyrhold Sash
	201055, -- Tyrhold Bindings
	201053, -- Tyrhold Gloves
	201052, -- Tyrhold Visage
	201050, -- Tyrhold Leggings
	201023, -- Draconic Treatise on Skinning
	201020, -- Silky Surprise
	201019, -- Ancient Dragonweave Bolt
	201018, -- Well-Danced Drum
	201017, -- Igneous Gem
	201016, -- Harmonic Crystal Harmonizer
	201015, -- Counterfeit Darkmoon Deck
	201014, -- Boomthyr Rocket
	201013, -- Faintly Enchanted Remains
	201012, -- Enchanted Debris
	201011, -- Spelltouched Tongs
	201010, -- Qalashi Weapon Diagram
	201009, -- Falconer Gauntlet Drawings
	201008, -- Molten Ingot
	201007, -- Ancient Monument
	201006, -- Draconic Flux
	201005, -- Curious Ingots
	201004, -- Ancient Spear Shards
	201003, -- Furry Gloop
	200996, -- Obsidian Guard's Claw
	200983, -- Obsidian Wingguard Polearm
	200982, -- Dusty Skinner's Notes
	200981, -- Dusty Miner's Notes
	200980, -- Dusty Herbalist's Notes
	200979, -- Dusty Leatherworker's Diagrams
	200978, -- Dusty Jeweler's Illustrations
	200977, -- Dusty Engineer's Scribblings
	200976, -- Dusty Enchanter's Research
	200975, -- Dusty Tailor's Diagrams
	200974, -- Dusty Alchemist's Research
	200973, -- Dusty Scribe's Runic Drawings
	200972, -- Dusty Blacksmith's Diagrams
	200963, -- Ensemble: Sabellian's Battlegear Cloth Armor
	200952, -- Ensemble: Obsidian Dracthyr Battlegear Mail Armor
	200930, -- Obsidian Proto-Whelp
	200925, -- Ensemble: Solemn Watchman's Garb
	200917, -- Ensemble: Tidecaller's Chainmail
	200915, -- Ensemble: Sylvan Stalker's Leathers
	200909, -- Ensemble: Corrupted Runelord's Regalia
	200884, -- Ensemble: Glorious Dragonrider's Mail
	200738, -- Onyx Gem Cluster Map
	200678, -- Dreambloom
	200677, -- Dreambloom Petal
	200640, -- Obsidian Egg Clutch
	200611, -- Dragon Racing Purse - Third Place
	200610, -- Dragon Racing Purse - Second Place
	200609, -- Dragon Racing Purse - First Place
	200540, -- Improvised Maruuk Barrier
	200539, -- Khansguard Shield
	200523, -- Smith's Stoneworked Mallet
	200521, -- Maruuk Boneblade
	200520, -- Mammothbone Knife
	200518, -- Nokhud Goliath's Spear
	200517, -- Nokhud Warspear
	200516, -- Grand Hunt Spoils
	200515, -- Grand Hunt Spoils
	200513, -- Grand Hunt Spoils
	200501, -- Nokhud Reaver's Shoulderpads
	200500, -- Nokhud Champion's Shoulderpads
	200498, -- Shikaar Harrier's Shoulderpads
	200495, -- Nokhud Warlord's Shoulderpads
	200492, -- Nokhud Warlord's Helm
	200488, -- Shikaar Huntmaster's Visor
	200483, -- Nokhud Battle Helm
	200455, -- Valdrakken Accord Insignia
	200454, -- Maruuk Centaur Insignia
	200453, -- Iskaara Tuskarr Insignia
	200452, -- Dragonscale Expedition Insignia
	200300, -- Sack of Looted Treasures
	200289, -- Valdrakken Accord Insignia
	200288, -- Maruuk Centaur Insignia
	200287, -- Iskaara Tuskarr Insignia
	200285, -- Dragonscale Expedition Insignia
	200205, -- Tome of Polymorph: Duck
	200201, -- Nokhud Battlegear
	200156, -- Amethyzarite Geode
	200072, -- Dragonbane Keep Strongbox
	199899, -- Iskaara Tug Sled
	199897, -- Blue-Covered Beanbag
	199896, -- Rubbery Fish Head
	199883, -- Tuskarr Sharktooth Bolt-Thrower
	199882, -- Tuskarr Mystic's Stave
	199878, -- Tuskarr Timber Splitter
	199877, -- Ensemble: Tuskarr Trader's Leather Armor
	199861, -- Tan Tuskarr Backpack
	199859, -- Burgundy Tuskarr Trader's Pack
	199857, -- Tan Tuskarr Trader's Pack
	199855, -- Burgundy Fisherman's Pack
	199854, -- Dark Fisherman's Pack
	199853, -- Tan Fisherman's Pack
	199756, -- Ensemble: Bronze Valdrakken Clothing
	199755, -- Ensemble: Green Valdrakken Clothing
	199754, -- Ensemble: Azure Valdrakken Clothing
	199753, -- Ensemble: Black Valdrakken Clothing
	199752, -- Ensemble: Crimson Valdrakken Clothing
	199549, -- Depth-Delver's Spaulders
	199548, -- Rugged Seaspawn Spaulders
	199547, -- Spine-Reinforced Spaulders
	199544, -- Murky Depths Shoulderguards
	199541, -- Grey Tufted Shoulderpads
	199540, -- Green Tufted Shoulderpads
	199539, -- Blue Tufted Shoulderpads
	199538, -- Azure Ear Warmer
	199537, -- Forest Green Ear Warmer
	199534, -- Blue Stocking Cap
	199533, -- Green Stocking Cap
	199531, -- Red Stocking Cap
	199475, -- Overflowing Valdrakken Accord Supply Pack
	199474, -- Overflowing Maruuk Centaur Supply Satchel
	199473, -- Overflowing Iskaaran Supply Pack
	199472, -- Overflowing Dragon Expedition Supply Pack
	199215, -- Worldbreaker Membership
	199197, -- Bottled Essence
	199128, -- Skinning Field Notes
	199122, -- Mining Field Notes
	199115, -- Herbalism Field Notes
	199066, -- Letter of Caution
	199065, -- Sorrowful Letter
	199062, -- Ruby Gem Cluster Map
	198978, -- Stupidly Effective Stitchery
	198977, -- Ohn'arhan Weave
	198976, -- Exceedingly Soft Skin
	198975, -- Ossified Hide
	198974, -- Elegantly Engraved Embellishment
	198973, -- Incandescent Curio
	198972, -- Draconic Glamour
	198971, -- Curious Djaradin Rune
	198970, -- Infinitely Attachable Pair o' Docks
	198969, -- Keeper's Mark
	198968, -- Primalist Charm
	198967, -- Primordial Aether
	198966, -- Molten Globule
	198965, -- Primeval Earth Fragment
	198964, -- Elementious Splinter
	198963, -- Decaying Phlegm
	198904, -- Technique: Windborne Velocidrake: Windswept Pattern
	198903, -- Technique: Windborne Velocidrake: Spined Head
	198902, -- Technique: Windborne Velocidrake: Black Fur
	198901, -- Technique: Renewed Proto-Drake: Spined Crest
	198896, -- Technique: Highland Drake: Spined Neck
	198895, -- Technique: Highland Drake: Spined Head
	198894, -- Technique: Highland Drake: Black Hair
	198893, -- Technique: Cliffside Wylderdrake: Triple Head Horns
	198892, -- Technique: Cliffside Wylderdrake: Red Hair
	198891, -- Technique: Cliffside Wylderdrake: Conical Head
	198873, -- Ivory Trader's Ottuk
	198872, -- Brown Scouting Ottuk
	198871, -- Iskaara Trader's Ottuk
	198854, -- Archeologist Artifact Notes
	198843, -- Emerald Gardens Explorer's Notes
	198841, -- Large Sample of Curious Hide
	198837, -- Curious Hide Scraps
	198824, -- Duskwing Ohuna
	198800, -- Fractured Titanic Sphere
	198799, -- Forgotten Arcane Tome
	198798, -- Flashfrozen Scroll
	198791, -- Glimmer of Blacksmithing Wisdom
	198789, -- Intact Coil Capacitor
	198778, -- Ensemble: Renowned Expeditioner's Plate Armor
	198777, -- Ensemble: Renowned Expeditioner's Mail Armor
	198776, -- Ensemble: Renowned Expeditioner's Leather Armor
	198775, -- Ensemble: Renowned Expeditioner's Cloth Armor
	198712, -- Firewater Powder Sample
	198711, -- Poacher's Pack
	198710, -- Canteen of Suspicious Water
	198704, -- Pulsing Earth Rune
	198703, -- Sign Language Reference Sheet
	198702, -- Itinerant Singed Fabric
	198699, -- Mysterious Banner
	198697, -- Contraband Concoction
	198696, -- Wind-Blessed Hide
	198694, -- Enriched Earthen Shard
	198693, -- Dusty Darkmoon Card
	198692, -- Noteworthy Scrap of Carpet
	198690, -- Decayed Scales
	198689, -- Stormbound Horn
	198687, -- Closely Guarded Shiny
	198686, -- Frosted Parchment
	198685, -- Well-Insulated Mug
	198684, -- Miniature Bronze Dragonflight Banner
	198683, -- Treated Hides
	198682, -- Alexstraszite Cluster
	198680, -- Decaying Brackenhide Blanket
	198670, -- Lofty Malygite
	198669, -- How to Train Your Whelpling
	198667, -- Spare Djaradin Tools
	198664, -- Crystalline Overgrowth
	198663, -- Frostforged Potion
	198662, -- Intriguing Bolt of Blue Cloth
	198660, -- Fragmented Key
	198659, -- Forgetful Apprentice's Tome
	198658, -- Decay-Infused Tanning Oil
	198656, -- Painter's Pretty Jewel
	198614, -- Soggy Clump of Darkmoon Cards
	198613, -- Leatherworking Designs
	198612, -- Jeweler's Cuts
	198611, -- Engineering Details
	198610, -- Enchanter's Script
	198609, -- Tailoring Examples
	198608, -- Alchemy Notes
	198607, -- Scribe's Glyphs
	198606, -- Blacksmith's Writ
	198599, -- Experimental Decay Sample
	198510, -- Draconic Treatise on Engineering
	198454, -- Draconic Treatise on Blacksmithing
	198438, -- Draconic Recipe in a Bottle
	198395, -- Dull Spined Clam
	197636, -- Windborne Velocidrake: Shrieker Pattern
	197635, -- Windborne Velocidrake: Reaver Pattern
	197634, -- Windborne Velocidrake: Windswept Pattern
	197630, -- Windborne Velocidrake: Feathered Neck
	197629, -- Windborne Velocidrake: Spiked Neck
	197628, -- Windborne Velocidrake: Plated Neck
	197627, -- Windborne Velocidrake: Finned Neck
	197626, -- Windborne Velocidrake: Exposed Finned Neck
	197625, -- Windborne Velocidrake: Feathery Tail
	197624, -- Windborne Velocidrake: Club Tail
	197623, -- Windborne Velocidrake: Spiked Tail
	197622, -- Windborne Velocidrake: Finned Tail
	197621, -- Windborne Velocidrake: Exposed Finned Tail
	197620, -- Windborne Velocidrake: Beaked Snout
	197619, -- Windborne Velocidrake: Hooked Snout
	197618, -- Windborne Velocidrake: Long Snout
	197617, -- Windborne Velocidrake: Heavy Scales
	197616, -- Windborne Velocidrake: White Scales
	197615, -- Windborne Velocidrake: Teal Scales
	197614, -- Windborne Velocidrake: Red Scales
	197613, -- Windborne Velocidrake: Bronze Scales
	197612, -- Windborne Velocidrake: Blue Scales
	197611, -- Windborne Velocidrake: Black Scales
	197610, -- Windborne Velocidrake: Yellow Horns
	197609, -- Windborne Velocidrake: White Horns
	197608, -- Windborne Velocidrake: Gray Horns
	197607, -- Windborne Velocidrake: Split Horns
	197606, -- Windborne Velocidrake: Swept Horns
	197605, -- Windborne Velocidrake: Curled Horns
	197604, -- Windborne Velocidrake: Ox Horns
	197603, -- Windborne Velocidrake: Curved Horns
	197602, -- Windborne Velocidrake: Cluster Horns
	197601, -- Windborne Velocidrake: Wavy Horns
	197599, -- Windborne Velocidrake: Red Hair
	197598, -- Windborne Velocidrake: Gray Hair
	197596, -- Windborne Velocidrake: Horned Jaw
	197595, -- Windborne Velocidrake: Finned Ears
	197594, -- Windborne Velocidrake: Small Ears
	197593, -- Windborne Velocidrake: Feathery Head
	197591, -- Windborne Velocidrake: Hairy Head
	197590, -- Windborne Velocidrake: Small Head Fin
	197589, -- Windborne Velocidrake: Large Head Fin
	197588, -- Windborne Velocidrake: Armor
	197587, -- Windborne Velocidrake: Feathered Back
	197585, -- Windborne Velocidrake: Maned Back
	197584, -- Windborne Velocidrake: Finned Back
	197583, -- Windborne Velocidrake: Exposed Finned Back
	197581, -- Windborne Velocidrake: Silver and Purple Armor
	197580, -- Windborne Velocidrake: Gold and Red Armor
	197579, -- Windborne Velocidrake: Steel and Orange Armor
	197578, -- Windborne Velocidrake: Silver and Blue Armor
	197577, -- Windborne Velocidrake: Bronze and Green Armor
	197408, -- Renewed Proto-Drake: Finned Throat
	197407, -- Renewed Proto-Drake: Spiked Throat
	197406, -- Renewed Proto-Drake: Spined Tail
	197405, -- Renewed Proto-Drake: Maned Tail
	197404, -- Renewed Proto-Drake: Finned Tail
	197403, -- Renewed Proto-Drake: Club Tail
	197402, -- Renewed Proto-Drake: Spiked Club Tail
	197401, -- Renewed Proto-Drake: Beaked Snout
	197400, -- Renewed Proto-Drake: Shark Snout
	197399, -- Renewed Proto-Drake: Razor Snout
	197398, -- Renewed Proto-Drake: Snub Snout
	197397, -- Renewed Proto-Drake: Heavy Scales
	197396, -- Renewed Proto-Drake: Skyterror Pattern
	197395, -- Renewed Proto-Drake: Harrier Pattern
	197394, -- Renewed Proto-Drake: Predator Pattern
	197393, -- Renewed Proto-Drake: White Scales
	197392, -- Renewed Proto-Drake: Black Scales
	197390, -- Renewed Proto-Drake: Blue Scales
	197389, -- Renewed Proto-Drake: Green Scales
	197388, -- Renewed Proto-Drake: Finned Jaw
	197387, -- Renewed Proto-Drake: Thin Spined Jaw
	197385, -- Renewed Proto-Drake: Horned Jaw
	197384, -- Renewed Proto-Drake: Thick Spined Jaw
	197383, -- Renewed Proto-Drake: Heavy Horns
	197382, -- Renewed Proto-Drake: White Horns
	197380, -- Renewed Proto-Drake: Curved Horns
	197379, -- Renewed Proto-Drake: Impaler Horns
	197378, -- Renewed Proto-Drake: Subtle Horns
	197377, -- Renewed Proto-Drake: Bovine Horns
	197376, -- Renewed Proto-Drake: Ears
	197375, -- Renewed Proto-Drake: Curled Horns
	197374, -- Renewed Proto-Drake: Swept Horns
	197372, -- Renewed Proto-Drake: Purple Hair
	197371, -- Renewed Proto-Drake: Green Hair
	197370, -- Renewed Proto-Drake: Red Hair
	197369, -- Renewed Proto-Drake: Brown Hair
	197368, -- Renewed Proto-Drake: Blue Hair
	197367, -- Renewed Proto-Drake: Gray Hair
	197366, -- Renewed Proto-Drake: Dual Horned Crest
	197365, -- Renewed Proto-Drake: Finned Crest
	197364, -- Renewed Proto-Drake: Short Spiked Crest
	197362, -- Renewed Proto-Drake: Spined Crest
	197361, -- Renewed Proto-Drake: Spiked Crest
	197360, -- Renewed Proto-Drake: Spined Brow
	197359, -- Renewed Proto-Drake: Hairy Brow
	197358, -- Renewed Proto-Drake: Curved Spiked Brow
	197357, -- Renewed Proto-Drake: Armor
	197356, -- Renewed Proto-Drake: Hairy Back
	197355, -- Renewed Proto-Drake: Thick Spined Jaw
	197354, -- Renewed Proto-Drake: Horned Back
	197353, -- Renewed Proto-Drake: Bronze and Pink Armor
	197352, -- Renewed Proto-Drake: Steel and Yellow Armor
	197351, -- Renewed Proto-Drake: Gold and Red Armor
	197350, -- Renewed Proto-Drake: Silver and Purple Armor
	197349, -- Renewed Proto-Drake: Gold and White Armor
	197348, -- Renewed Proto-Drake: Black and Red Armor
	197347, -- Renewed Proto-Drake: Silver and Blue Armor
	197346, -- Renewed Proto-Drake: Gold and Black Armor
	197156, -- Highland Drake: Bronze and Green Armor
	197155, -- Highland Drake: Finned Neck
	197154, -- Highland Drake: Spined Neck
	197153, -- Highland Drake: Bladed Tail
	197152, -- Highland Drake: Hooked Tail
	197151, -- Highland Drake: Spiked Tail
	197150, -- Highland Drake: Spiked Club Tail
	197149, -- Highland Drake: Club Tail
	197148, -- Highland Drake: Vertical Finned Tail
	197147, -- Highland Drake: Heavy Scales
	197146, -- Highland Drake: White Scales
	197145, -- Highland Drake: Bronze Scales
	197144, -- Highland Drake: Red Scales
	197143, -- Highland Drake: Green Scales
	197142, -- Highland Drake: Black Scales
	197141, -- Highland Drake: Scaled Pattern
	197140, -- Highland Drake: Small Spotted Pattern
	197139, -- Highland Drake: Large Spotted Pattern
	197138, -- Highland Drake: Striped Pattern
	197136, -- Highland Drake: Tapered Nose
	197135, -- Highland Drake: Toothy Mouth
	197134, -- Highland Drake: Spiked Legs
	197133, -- Highland Drake: Spined Cheek
	197132, -- Highland Drake: Spiked Cheek
	197131, -- Highland Drake: Hairy Cheek
	197130, -- Highland Drake: Stag Horns
	197129, -- Highland Drake: Sleek Horns
	197128, -- Highland Drake: Curled Back Horns
	197127, -- Highland Drake: Grand Thorn Horns
	197126, -- Highland Drake: Hooked Horns
	197124, -- Highland Drake: Swept Horns
	197123, -- Highland Drake: Thorn Horns
	197121, -- Highland Drake: Tan Horns
	197120, -- Highland Drake: Ornate Helm
	197118, -- Highland Drake: Brown Hair
	197117, -- Highland Drake: Black Hair
	197116, -- Highland Drake: Ears
	197115, -- Highland Drake: Thorned Jaw
	197114, -- Highland Drake: Multi-Horned Head
	197113, -- Highland Drake: Swept Spiked Head
	197112, -- Highland Drake: Single Horned Head
	197111, -- Highland Drake: Maned Head
	197110, -- Highland Drake: Plated Head
	197109, -- Highland Drake: Spiked Head
	197108, -- Highland Drake: Spined Head
	197107, -- Highland Drake: Triple Finned Head
	197106, -- Highland Drake: Finned Head
	197104, -- Highland Drake: Tapered Chin
	197103, -- Highland Drake: Maned Chin
	197102, -- Highland Drake: Horned Chin
	197100, -- Highland Drake: Crested Brow
	197099, -- Highland Drake: Armor
	197098, -- Highland Drake: Finned Back
	197097, -- Highland Drake: Spined Back
	197096, -- Highland Drake: Steel and Yellow Armor
	197095, -- Highland Drake: Gold and White Armor
	197094, -- Highland Drake: Gold and Red Armor
	197093, -- Highland Drake: Silver and Purple Armor
	197091, -- Highland Drake: Silver and Blue Armor
	197090, -- Highland Drake: Gold and Black Armor
	197023, -- Cliffside Wylderdrake: Maned Neck
	197022, -- Cliffside Wylderdrake: Finned Neck
	197020, -- Cliffside Wylderdrake: Spear Tail
	197019, -- Cliffside Wylderdrake: Blunt Spiked Tail
	197018, -- Cliffside Wylderdrake: Finned Tail
	197017, -- Cliffside Wylderdrake: Large Tail Spikes
	197016, -- Cliffside Wylderdrake: Maned Tail
	197015, -- Cliffside Wylderdrake: Dark Skin Variation
	197014, -- Cliffside Wylderdrake: White Scales
	197013, -- Cliffside Wylderdrake: Black Scales
	197012, -- Cliffside Wylderdrake: Blue Scales
	197011, -- Cliffside Wylderdrake: Green Scales
	197009, -- Cliffside Wylderdrake: Scaled Pattern
	197008, -- Cliffside Wylderdrake: Narrow Stripes Pattern
	197007, -- Cliffside Wylderdrake: Wide Stripes Pattern
	197006, -- Cliffside Wylderdrake: Plated Nose
	197004, -- Cliffside Wylderdrake: Spiked Legs
	197003, -- Cliffside Wylderdrake: Spiked Cheek
	197002, -- Cliffside Wylderdrake: Flared Cheek
	197001, -- Cliffside Wylderdrake: Finned Cheek
	197000, -- Cliffside Wylderdrake: Coiled Horns
	196999, -- Cliffside Wylderdrake: Swept Horns
	196998, -- Cliffside Wylderdrake: Hook Horns
	196997, -- Cliffside Wylderdrake: Split Horns
	196996, -- Cliffside Wylderdrake: Branched Horns
	196995, -- Cliffside Wylderdrake: Spiked Horns
	196994, -- Cliffside Wylderdrake: Short Horns
	196993, -- Cliffside Wylderdrake: Sleek Horns
	196992, -- Cliffside Wylderdrake: Heavy Horns
	196991, -- Cliffside Wylderdrake: Black Horns
	196989, -- Cliffside Wylderdrake: White Hair
	196988, -- Cliffside Wylderdrake: Red Hair
	196986, -- Cliffside Wylderdrake: Black Hair
	196985, -- Cliffside Wylderdrake: Horned Jaw
	194337, -- Liquid Courage
	194081, -- Mutated Root
	194080, -- Peculiar Bud
	194079, -- Pure Serevite Nugget
	194078, -- Perfect Draconium Scale
	194077, -- Pristine Adamant Scales
	194076, -- Exotic Resilient Leather
	194072, -- Sack of Gold
	194068, -- Progenitor Scales
	194067, -- Festering Carcass
	194066, -- Frigid Frostfur Pelt
	194064, -- Intricate Geode
	194063, -- Glowing Fragment
	194062, -- Unyielding Stone Chunk
	194061, -- Suffocating Spores
	194055, -- Primordial Soil
	194054, -- Dredged Seedling
	194041, -- Driftbloom Sprout
	194040, -- Slateskin Hide
	194039, -- Heated Ore Sample
	193913, -- Preserved Animal Parts
	193910, -- Molted Dragon Scales
	193907, -- Chipped Tyrstone
	193905, -- Iskaaran Trading Ledger
	193904, -- Phoenix Feather Quill
	193903, -- Watcher Power Core
	193902, -- Eroded Titan Gizmo
	193901, -- Primal Dust
	193900, -- Prismatic Focusing Shard
	193899, -- Primalweave Spindle
	193898, -- Umbral Bone Needle
	193897, -- Reawakened Catalyst
	193891, -- Experimental Substance
	192893, -- Jeweled Dragon's Heart
	192892, -- Timewatcher's Patience
	192523, -- Renewed Proto-Drake: Green Scales
	192132, -- Draconium Blade Sharpener
	192131, -- Valdrakken Weapon Chain
	192130, -- Sundered Flame Weapon Mold
	192099, -- Earpieces of Tranquil Focus
	191701, -- Bag of Explored Souls
	191264, -- Restored Obsidian Key
	191255, -- Greater Obsidian Key
	191039, -- Pocopoc Traveler
	191036, -- Broker's Accessory
	190923, -- Ensemble: Dashing Buccaneer's Slops
	190922, -- Ensemble: Vagabond's Snowy Threads
	190921, -- Ensemble: Wanderer's Snowy Trappings
	190850, -- Ensemble: Wanderer's Crimson Trappings
	190796, -- Ensemble: Slumbering Caldera Regalia
	190762, -- Broker's Boots
	190761, -- Broker's Bracers
	190760, -- Broker's Chestpiece
	190758, -- Broker's Gloves
	190757, -- Broker's Helm
	190755, -- Broker's Shoulders
	190610, -- Tribute of the Enlightened Elders
	190577, -- Ensemble: Wanderer's Azure Trappings
	190576, -- Ensemble: Vagabond's Azure Threads
	190540, -- Ensemble: Trapper's Munitions
	190529, -- Ensemble: Wanderer's Violet Trappings
	190504, -- Ensemble: Darkmoon Harlequin's Bells
	190377, -- Ensemble: Wanderer's Midnight Trappings
	190166, -- Ensemble: Vagabond's Midnight Threads
	190165, -- Ensemble: Twisted Arcanum Regalia
	190095, -- Ensemble: Vestment of the Honored Valarjar
	190062, -- Wicked Pocopoc
	190061, -- Admiral Pocopoc
	190059, -- Pirate Pocopoc
	189938, -- Ensemble: Fel-Automaton Exoplate
	189716, -- Pocopoc's Face Decoration
	189715, -- Pocopoc's Diamond Vambraces
	189714, -- Pocopoc's Platinum and Emerald Components
	189713, -- Pocopoc's Copper and Cobalt Components
	189712, -- Pocopoc's Silver and Beryllium Components
	189711, -- Pocopoc's Gold and Ruby Components
	189710, -- Pocopoc's Ruby and Platinum Body
	189709, -- Pocopoc's Cobalt and Copper Body
	189451, -- Chef Pocopoc
	188793, -- Improvised Cypher Analysis Tool
	188737, -- Ebon Mawsworn Crossbow
	188209, -- Ensemble: Ravencrest's Battleplate
	188167, -- Broker Mark of Distinction
	187833, -- Dapper Pocopoc
	187604, -- Broken Isles Enchantment Delivery
	187601, -- Broken Isles Leather Delivery
	187597, -- Broken Isles Fish Delivery
	187595, -- Favor of the Val'sharah Hippogryph
	187571, -- Brokers' Mining Mote of Potentiation
	187570, -- Brokers' Skinning Mote of Potentiation
	187561, -- Winter Veil Gift
	187543, -- Death's Advance War Chest
	187351, -- Stygic Cluster
	187346, -- Lost Memento
	187342, -- Offering Preparation Kit
	187101, -- Sterling Shoulder-Shields
	187085, -- Sterling Shoulder Skewers
	187029, -- Mysterious Gift from Ve'nari
	187028, -- Supplies of the Archivists' Codex
	186974, -- Experimental Anima Cell
	186970, -- Feeder's Hand and Key
	186705, -- Gold Filled Chalice
	186680, -- Gold Filled Boot
	186678, -- Mawforged Weapons Cache
	186650, -- Death's Advance Supplies
	186636, -- Cage of Mawrats
	186615, -- Mirror of the Conjured Twin
	186593, -- A Tiny Pair of Wings
	186524, -- A Tiny Vial of Slime
	186518, -- Ensemble: Forsworn Aspirant's Regalia
	186517, -- Ensemble: Battlefield Messenger's Regalia
	186515, -- Ensemble: Aspiring Aspirant's Regalia
	186513, -- Ensemble: Radiant Court Attire
	186512, -- Ensemble: Renathal's Field Inquisitor's Vestments
	186511, -- Ensemble: Renathal's Battlefield Attire
	186509, -- Ensemble: Sinful Venthyr Attire
	186508, -- Ensemble: Court Inquisitor's Vestments
	186507, -- Ensemble: Harvester's Court Attire
	186505, -- Ensemble: Rogue Necromancer's Vestments
	186504, -- Ensemble: Frontline Necromancer's Vestments
	186503, -- Ensemble: Initiate's Necromantle Vestments
	186500, -- Ensemble: Garb of the Twilight Grove
	186498, -- Ensemble: Garb of the Azure Dusk
	186493, -- Ardenweald Wilderling Harness
	186487, -- Maldraxxian Corpsefly Harness
	186482, -- Elysian Aquilon
	186476, -- Sinfall Gravewing
	186473, -- A Tiny Winter Staff
	185832, -- Shipment of Elethium Ore
	184868, -- Cache of Nathrian Treasures
	184648, -- Hero's Enchanting Cache
	184647, -- Hero's Herbalism Cache
	184645, -- Hero's Skinning Cache
	184639, -- Champion's Tailoring Cache
	184637, -- Hero's Meat Cache
	184561, -- Anima Embers
	146162, -- Ensemble: Vindictive Combatant's Plate Armor
	146160, -- Ensemble: Vindictive Combatant's Felweave Armor
	146157, -- Ensemble: Vindictive Combatant's Silk Armor
	146151, -- Ensemble: Vindictive Gladiator's Felweave Armor
	146150, -- Ensemble: Vindictive Gladiator's Felweave Armor
	146149, -- Ensemble: Vindictive Gladiator's Satin Armor
	146146, -- Ensemble: Vindictive Gladiator's Silk Armor
	146144, -- Ensemble: Vindictive Gladiator's Leather Armor
	146143, -- Ensemble: Vindictive Gladiator's Ironskin Armor
	146141, -- Ensemble: Vindictive Gladiator's Dragonhide Armor
	146140, -- Ensemble: Vindictive Gladiator's Dragonhide Armor
	146136, -- Ensemble: Vindictive Gladiator's Ringmail Armor
	146134, -- Ensemble: Vindictive Gladiator's Scaled Armor
	146132, -- Ensemble: Vindictive Gladiator's Dreadplate Armor
	146130, -- Ensemble: Vindictive Gladiator's Plate Armor
	144393, -- Portable Yak Wash
	143953, -- Infinite Hatchling
	143948, -- Chilled Satchel of Vegetables
	143945, -- Commendation of the Shado-Pan Assault
	143943, -- Commendation of the Dominance Offensive
	143941, -- Commendation of The Tillers
	143940, -- Commendation of the Kirin Tor Offensive
	143937, -- Commendation of the Golden Lotus
	143935, -- Commendation of The Klaxxi
	143748, -- Leyscale Koi
	143521, -- Ensemble: Funerary Plate of the Chosen Dead
	143520, -- Ensemble: Funerary Plate of the Chosen Dead
	143517, -- Ensemble: Chains of the Chosen Dead
	143516, -- Ensemble: Chains of the Chosen Dead
	143508, -- Ensemble: Vestment of the Chosen Dead
	143506, -- Ensemble: Vestment of the Chosen Dead
	141870, -- Arcane Tablet of Falanaar
	141371, -- Arsenal: Armaments of the Silver Hand
	141018, -- Sargerei Blood Vessel
	140949, -- Onyx Or'ligai Egg
	140406, -- Primed Arcane Charge
	140405, -- Illusion Matrix Crystal
	140404, -- Intact Guardian Core
	140399, -- Yellow Or'ligai Egg
	140260, -- Arcane Remnant of Falanaar
	140245, -- The Tidemistress' Enchanted Pearl
	140240, -- Enchanted Moonwell Waters
	140239, -- Excavated Highborne Artifact
	140236, -- A Mrglrmrl Mlrglr
	139879, -- Crate of Champion Equipment
	139593, -- Sack of Salvaged Goods
	139170, -- Ensemble: Fel-Infused Cloth Armor
	139169, -- Ensemble: Felshroud Leather Armor
	138724, -- Ensemble: Dreadful Gladiator's Felweave Armor
	138723, -- Ensemble: Dreadful Gladiator's Satin Armor
	138722, -- Ensemble: Dreadful Gladiator's Silk Armor
	138721, -- Ensemble: Dreadful Gladiator's Leather Armor
	138719, -- Ensemble: Dreadful Gladiator's Dragonhide Armor
	138716, -- Ensemble: Dreadful Gladiator's Scaled Armor
	138715, -- Ensemble: Dreadful Gladiator's Dreadplate Armor
	138709, -- Ensemble: Malevolent Gladiator's Ironskin Armor
	138708, -- Ensemble: Malevolent Gladiator's Dragonhide Armor
	138707, -- Ensemble: Malevolent Gladiator's Chain Armor
	138705, -- Ensemble: Malevolent Gladiator's Scaled Armor
	138703, -- Ensemble: Malevolent Gladiator's Plate Armor
	138701, -- Ensemble: Tyrannical Gladiator's Felweave Armor
	138698, -- Ensemble: Tyrannical Gladiator's Silk Armor
	138697, -- Ensemble: Tyrannical Gladiator's Silk Armor
	138696, -- Ensemble: Tyrannical Gladiator's Leather Armor
	138695, -- Ensemble: Tyrannical Gladiator's Leather Armor
	138693, -- Ensemble: Tyrannical Gladiator's Ironskin Armor
	138692, -- Ensemble: Tyrannical Gladiator's Dragonhide Armor
	138691, -- Ensemble: Tyrannical Gladiator's Dragonhide Armor
	138689, -- Ensemble: Tyrannical Gladiator's Chain Armor
	138681, -- Ensemble: Tyrannical Gladiator's Plate Armor
	138675, -- Ensemble: Grievous Gladiator's Silk Armor
	138674, -- Ensemble: Grievous Gladiator's Leather Armor
	138669, -- Ensemble: Grievous Gladiator's Dragonhide Armor
	138668, -- Ensemble: Grievous Gladiator's Chain Armor
	138663, -- Ensemble: Grievous Gladiator's Scaled Armor
	138662, -- Ensemble: Grievous Gladiator's Dreadplate Armor
	138660, -- Ensemble: Grievous Gladiator's Plate Armor
	138659, -- Ensemble: Grievous Gladiator's Plate Armor
	138656, -- Ensemble: Prideful Gladiator's Satin Armor
	138655, -- Ensemble: Prideful Gladiator's Satin Armor
	138652, -- Ensemble: Prideful Gladiator's Leather Armor
	138649, -- Ensemble: Prideful Gladiator's Ironskin Armor
	138647, -- Ensemble: Prideful Gladiator's Dragonhide Armor
	138644, -- Ensemble: Prideful Gladiator's Ringmail Armor
	138640, -- Ensemble: Prideful Gladiator's Dreadplate Armor
	138620, -- Ensemble: Primal Combatant's Ironskin Armor
	138619, -- Ensemble: Primal Combatant's Ironskin Armor
	138616, -- Ensemble: Primal Combatant's Scaled Armor
	138609, -- Ensemble: Wild Combatant's Leather Armor
	138606, -- Ensemble: Wild Combatant's Dragonhide Armor
	138604, -- Ensemble: Wild Combatant's Scaled Armor
	138599, -- Ensemble: Wild Combatant's Plate Armor
	138598, -- Ensemble: Warmongering Combatant's Leather Armor
	138592, -- Ensemble: Warmongering Combatant's Scaled Armor
	138590, -- Ensemble: Warmongering Combatant's Dreadplate Armor
	138589, -- Ensemble: Warmongering Combatant's Dreadplate Armor
	138588, -- Ensemble: Warmongering Combatant's Plate Armor
	138587, -- Ensemble: Warmongering Combatant's Plate Armor
	138586, -- Ensemble: Primal Combatant's Felweave Armor
	138582, -- Ensemble: Primal Combatant's Silk Armor
	138576, -- Ensemble: Primal Gladiator's Felweave Armor
	138574, -- Ensemble: Primal Gladiator's Satin Armor
	138572, -- Ensemble: Primal Gladiator's Silk Armor
	138571, -- Ensemble: Primal Gladiator's Silk Armor
	138570, -- Ensemble: Primal Gladiator's Leather Armor
	138569, -- Ensemble: Primal Gladiator's Leather Armor
	138567, -- Ensemble: Primal Gladiator's Ironskin Armor
	138565, -- Ensemble: Primal Gladiator's Dragonhide Armor
	138562, -- Ensemble: Primal Gladiator's Ringmail Armor
	138561, -- Ensemble: Primal Gladiator's Ringmail Armor
	138559, -- Ensemble: Primal Gladiator's Scaled Armor
	138555, -- Ensemble: Primal Gladiator's Plate Armor
	138554, -- Ensemble: Wild Combatant's Felweave Armor
	138553, -- Ensemble: Wild Combatant's Felweave Armor
	138552, -- Ensemble: Wild Combatant's Satin Armor
	138551, -- Ensemble: Wild Combatant's Satin Armor
	138550, -- Ensemble: Wild Combatant's Silk Armor
	138547, -- Ensemble: Wild Combatant's Chain Armor
	138543, -- Ensemble: Warmongering Combatant's Felweave Armor
	138541, -- Ensemble: Warmongering Combatant's Satin Armor
	138539, -- Ensemble: Warmongering Combatant's Silk Armor
	138537, -- Ensemble: Warmongering Combatant's Chain Armor
	138535, -- Ensemble: Warmongering Combatant's Ringmail Armor
	138534, -- Ensemble: Wild Gladiator's Felweave Armor
	138533, -- Ensemble: Wild Gladiator's Felweave Armor
	138530, -- Ensemble: Wild Gladiator's Silk Armor
	138529, -- Ensemble: Wild Gladiator's Silk Armor
	138523, -- Ensemble: Wild Gladiator's Dragonhide Armor
	138522, -- Ensemble: Wild Gladiator's Chain Armor
	138516, -- Ensemble: Wild Gladiator's Dreadplate Armor
	138514, -- Ensemble: Wild Gladiator's Plate Armor
	138513, -- Ensemble: Wild Gladiator's Plate Armor
	138512, -- Ensemble: Warmongering Gladiator's Felweave Armor
	138511, -- Ensemble: Warmongering Gladiator's Felweave Armor
	138510, -- Ensemble: Warmongering Gladiator's Satin Armor
	138505, -- Ensemble: Warmongering Gladiator's Leather Armor
	138494, -- Ensemble: Warmongering Gladiator's Dreadplate Armor
	138492, -- Ensemble: Warmongering Gladiator's Plate Armor
	138430, -- Ensemble: Chain of the Scarlet Crusade
	137663, -- Soft Foam Sword
	137208, -- Indestructible Armor Set
	137207, -- Fortified Armor Set
	136926, -- Nightmare Pod
	136801, -- Divine Tome: Contemplation
	136796, -- Necrophile Tome: Corpse Exploder
	133160, -- Commendation of Therazane
	133159, -- Commendation of The Earthen Ring
	133154, -- Commendation of the Ramkahen
	133152, -- Commendation of the Guardians of Hyjal
	129950, -- Commendation of the Keepers of Time
	129949, -- Commendation of the Cenarion Expedition
	129947, -- Commendation of Thrallmar
	129926, -- Mark of the Ashtongue
	129057, -- Dalaran Disc
	128313, -- Huge Ogre Cache
	128308, -- Draenic Armor Set
	127988, -- Bug Sprayer
	127966, -- Helm of Hellfire's Protector
	127965, -- Leggings of Hellfire's Protector
	127964, -- Gauntlets of Hellfire's Protector
	127962, -- Chest of Hellfire's Vanquisher
	127961, -- Shoulders of Hellfire's Vanquisher
	127960, -- Leggings of Hellfire's Vanquisher
	127959, -- Helm of Hellfire's Vanquisher
	127957, -- Shoulders of Hellfire's Conqueror
	127955, -- Leggings of Hellfire's Conqueror
	127953, -- Chest of Hellfire's Conqueror
	127855, -- Iron Fleet Treasure Chest
	127265, -- Silkweave Set
	122613, -- Stash of Dusty Music Rolls
	122544, -- Unstable Precision Scope Tuning Kit
	122457, -- Ultimate Battle-Training Stone
	122284, -- WoW Token
	122237, -- Music Roll: Mountains of Thunder
	122234, -- Music Roll: Faerie Dragon
	122233, -- Music Roll: Lament of the Highborne
	122232, -- Music Roll: The Argent Tournament
	122231, -- Music Roll: Karazhan Opera House
	122228, -- Music Roll: The Black Temple
	122226, -- Music Roll: Magic
	122221, -- Music Roll: Song of Liu Lang
	122219, -- Music Roll: Way of the Monk
	122218, -- Music Roll: Rescue the Warchief
	122215, -- Music Roll: Zul'Gurub Voodoo
	122213, -- Music Roll: Thunder Bluff
	122212, -- Music Roll: Undercity
	122211, -- Music Roll: War March
	122209, -- Music Roll: Curse of the Worgen
	122207, -- Music Roll: Tinkertown
	122205, -- Music Roll: Night Song
	122204, -- Music Roll: Cold Mountain
	122203, -- Music Roll: Ironforge
	122201, -- Music Roll: Stormwind
	122200, -- Music Roll: A Siege of Worlds
	122199, -- Music Roll: Heart of Pandaria
	122198, -- Music Roll: The Shattering
	122195, -- Music Roll: Legends of Azeroth
	120255, -- Helm of the Iron Protector
	120254, -- Leggings of the Iron Protector
	120252, -- Chest of the Iron Protector
	120250, -- Shoulders of the Iron Vanquisher
	120249, -- Leggings of the Iron Vanquisher
	120248, -- Helm of the Iron Vanquisher
	120247, -- Gauntlets of the Iron Vanquisher
	120246, -- Shoulders of the Iron Conqueror
	120243, -- Gauntlets of the Iron Conqueror
	120241, -- Shoulders of the Iron Protector
	120240, -- Helm of the Iron Protector
	120239, -- Leggings of the Iron Protector
	120235, -- Shoulders of the Iron Vanquisher
	120234, -- Leggings of the Iron Vanquisher
	120232, -- Gauntlets of the Iron Vanquisher
	120231, -- Shoulders of the Iron Conqueror
	120230, -- Helm of the Iron Conqueror
	120229, -- Leggings of the Iron Conqueror
	120225, -- Helm of the Iron Protector
	120222, -- Chest of the Iron Protector
	120221, -- Chest of the Iron Vanquisher
	120219, -- Leggings of the Iron Vanquisher
	120215, -- Helm of the Iron Conqueror
	120214, -- Leggings of the Iron Conqueror
	120213, -- Gauntlets of the Iron Conqueror
	119416, -- Magnaron Heart
	119321, -- Helm of the Iron Protector
	119311, -- Gauntlets of the Iron Vanquisher
	119308, -- Helm of the Iron Conqueror
	119307, -- Leggings of the Iron Conqueror
	118695, -- Toxicfang Venom
	118530, -- Cache of Highmaul Treasures
	117414, -- Stormwind Guard Armor Package
	116889, -- "Purple Phantom" Contender's Costume
	116888, -- "Night Demon" Contender's Costume
	116804, -- Widget the Departed
	116432, -- Frostwall Tavern, Level 3
	116431, -- Frostwall Tavern, Level 2
	116249, -- Frostwall Mines, Level 3
	116201, -- Goblin Workshop, Level 3
	116197, -- Spirit Lodge, Level 3
	116186, -- War Mill, Level 3
	116185, -- War Mill, Level 2
	116131, -- Amethyl Crystal
	114806, -- Blackrock Armor Set
	114053, -- Shimmering Gauntlets
	114052, -- Gleaming Ring
	114002, -- Encoded Message
	112003, -- Stables, Level 3
	111990, -- The Forge, Level 2
	111988, -- The Tannery, Level 2
	111986, -- Trading Post, Level 2
	111982, -- Storehouse, Level 2
	111979, -- Scribe's Quarters, Level 3
	111978, -- Scribe's Quarters, Level 2
	111975, -- Gem Boutique, Level 3
	111974, -- Gem Boutique, Level 2
	111973, -- Enchanter's Study, Level 3
	111968, -- Barn, Level 2
	111957, -- Salvage Yard, Level 1
	111956, -- Barracks, Level 1
	111928, -- Fishing Shack, Level 3
	111921, -- Draenor Engineering
	111349, -- A Treatise on Mining in Draenor
	109558, -- A Treatise on the Alchemy of Draenor
	109257, -- Engineering Works, Level 3
	109254, -- Lumber Mill, Level 2
	105861, -- Essence of the Cursed Conqueror
	105860, -- Essence of the Cursed Protector
	105858, -- Essence of the Cursed Conqueror
	104012, -- Timeless Leather Armor Cache
	104010, -- Timeless Mail Armor Cache
	101661, -- Deluxe Noodle Cart Kit
	101630, -- Noodle Cart Kit
	99725, -- Helm of the Cursed Protector
	99722, -- Gauntlets of the Cursed Protector
	99721, -- Gauntlets of the Cursed Conqueror
	99718, -- Shoulders of the Cursed Conqueror
	99717, -- Shoulders of the Cursed Vanquisher
	99690, -- Shoulders of the Cursed Conqueror
	99688, -- Leggings of the Cursed Conqueror
	99686, -- Chest of the Cursed Conqueror
	99684, -- Leggings of the Cursed Vanquisher
	99682, -- Gauntlets of the Cursed Vanquisher
	99680, -- Gauntlets of the Cursed Vanquisher
	99675, -- Leggings of the Cursed Conqueror
	99674, -- Leggings of the Cursed Vanquisher
	99673, -- Helm of the Cursed Protector
	99669, -- Shoulders of the Cursed Conqueror
	97565, -- Unclaimed Black Market Container
	96701, -- Shoulders of the Crackling Protector
	96700, -- Shoulders of the Crackling Conqueror
	96699, -- Shoulders of the Crackling Vanquisher
	96631, -- Leggings of the Crackling Vanquisher
	96625, -- Helm of the Crackling Protector
	96568, -- Chest of the Crackling Protector
	95956, -- Shoulders of the Crackling Conqueror
	95889, -- Leggings of the Crackling Protector
	95887, -- Leggings of the Crackling Vanquisher
	95880, -- Helm of the Crackling Conqueror
	95879, -- Helm of the Crackling Vanquisher
	95824, -- Chest of the Crackling Protector
	95823, -- Chest of the Crackling Conqueror
	95822, -- Chest of the Crackling Vanquisher
	95583, -- Shoulders of the Crackling Protector
	95582, -- Helm of the Crackling Protector
	95580, -- Gauntlets of the Crackling Protector
	95579, -- Chest of the Crackling Protector
	95578, -- Shoulders of the Crackling Conqueror
	95575, -- Gauntlets of the Crackling Conqueror
	95573, -- Shoulders of the Crackling Vanquisher
	95572, -- Leggings of the Crackling Vanquisher
	95570, -- Gauntlets of the Crackling Vanquisher
	89278, -- Shoulders of the Shadowy Protector
	89274, -- Helm of the Shadowy Conqueror
	89273, -- Helm of the Shadowy Vanquisher
	89271, -- Gauntlets of the Shadowy Conqueror
	89269, -- Leggings of the Shadowy Protector
	89266, -- Chest of the Shadowy Protector
	89265, -- Chest of the Shadowy Conqueror
	89261, -- Shoulders of the Shadowy Vanquisher
	89259, -- Helm of the Shadowy Conqueror
	89255, -- Gauntlets of the Shadowy Vanquisher
	89254, -- Leggings of the Shadowy Protector
	89253, -- Leggings of the Shadowy Conqueror
	89252, -- Leggings of the Shadowy Vanquisher
	89250, -- Chest of the Shadowy Conqueror
	89246, -- Shoulders of the Shadowy Conqueror
	89244, -- Leggings of the Shadowy Protector
	89243, -- Leggings of the Shadowy Conqueror
	89242, -- Gauntlets of the Shadowy Vanquisher
	89241, -- Gauntlets of the Shadowy Protector
	89238, -- Chest of the Shadowy Protector
	89234, -- Helm of the Shadowy Vanquisher
	87775, -- Yu'lei, Daughter of Jade
	78876, -- Shoulders of the Corrupted Protector
	78874, -- Shoulders of the Corrupted Vanquisher
	78870, -- Crown of the Corrupted Protector
	78868, -- Crown of the Corrupted Vanquisher
	78864, -- Chest of the Corrupted Protector
	78863, -- Chest of the Corrupted Conqueror
	78862, -- Chest of the Corrupted Vanquisher
	78861, -- Shoulders of the Corrupted Vanquisher
	78859, -- Shoulders of the Corrupted Conqueror
	78857, -- Leggings of the Corrupted Protector
	78856, -- Leggings of the Corrupted Conqueror
	78855, -- Gauntlets of the Corrupted Vanquisher
	78854, -- Gauntlets of the Corrupted Protector
	78853, -- Gauntlets of the Corrupted Conqueror
	78852, -- Crown of the Corrupted Vanquisher
	78851, -- Crown of the Corrupted Protector
	78850, -- Crown of the Corrupted Conqueror
	78849, -- Chest of the Corrupted Vanquisher
	78848, -- Chest of the Corrupted Protector
	78847, -- Chest of the Corrupted Conqueror
	78184, -- Chest of the Corrupted Conqueror
	78182, -- Crown of the Corrupted Conqueror
	78181, -- Leggings of the Corrupted Conqueror
	78174, -- Chest of the Corrupted Vanquisher
	78172, -- Crown of the Corrupted Vanquisher
	78170, -- Shoulders of the Corrupted Vanquisher
	74623, -- Emergency Supplies
	71688, -- Mantle of the Fiery Protector
	71687, -- Shoulders of the Fiery Protector
	71686, -- Chest of the Fiery Protector
	71684, -- Crown of the Fiery Protector
	71683, -- Gauntlets of the Fiery Protector
	71681, -- Mantle of the Fiery Conqueror
	71680, -- Shoulders of the Fiery Conqueror
	71678, -- Leggings of the Fiery Conqueror
	71676, -- Gauntlets of the Fiery Conqueror
	71675, -- Helm of the Fiery Conqueror
	71672, -- Chest of the Fiery Vanquisher
	71671, -- Leggings of the Fiery Vanquisher
	71668, -- Helm of the Fiery Vanquisher
	70908, -- Feline Familiar
	67431, -- Gauntlets of the Forlorn Vanquisher
	67426, -- Leggings of the Forlorn Vanquisher
	67425, -- Chest of the Forlorn Vanquisher
	67424, -- Chest of the Forlorn Protector
	67423, -- Chest of the Forlorn Conqueror
	65089, -- Shoulders of the Forlorn Vanquisher
	65087, -- Shoulders of the Forlorn Protector
	65002, -- Crown of the Forlorn Vanquisher
	65000, -- Crown of the Forlorn Protector
	64315, -- Mantle of the Forlorn Conqueror
	63684, -- Helm of the Forlorn Protector
	63682, -- Helm of the Forlorn Vanquisher
	47559, -- Regalia of the Grand Vanquisher
	46831, -- Macabre Marionette
	46718, -- Orange Marigold
	46710, -- Recipe: Bread of the Dead
	45661, -- Spaulders of the Wayward Vanquisher
	45659, -- Spaulders of the Wayward Conqueror
	45658, -- Mantle of the Wayward Vanquisher
	45656, -- Mantle of the Wayward Conqueror
	45652, -- Leggings of the Wayward Vanquisher
	45651, -- Leggings of the Wayward Protector
	45650, -- Leggings of the Wayward Conqueror
	45648, -- Helm of the Wayward Protector
	45647, -- Helm of the Wayward Conqueror
	45643, -- Gauntlets of the Wayward Vanquisher
	45642, -- Gauntlets of the Wayward Protector
	45634, -- Breastplate of the Wayward Vanquisher
	44834, -- Wild Turkey
	44127, -- Barricade Construction Kit
	40769, -- Scrapbot Construction Kit
	40639, -- Mantle of the Lost Vanquisher
	40637, -- Mantle of the Lost Conqueror
	40635, -- Legplates of the Lost Protector
	40634, -- Legplates of the Lost Conqueror
	40631, -- Crown of the Lost Conqueror
	40628, -- Gauntlets of the Lost Conqueror
	40626, -- Breastplate of the Lost Protector
	40625, -- Breastplate of the Lost Conqueror
	40624, -- Spaulders of the Lost Vanquisher
	40623, -- Spaulders of the Lost Protector
	40621, -- Leggings of the Lost Vanquisher
	40620, -- Leggings of the Lost Protector
	40618, -- Helm of the Lost Vanquisher
	40616, -- Helm of the Lost Conqueror
	40615, -- Gloves of the Lost Vanquisher
	40614, -- Gloves of the Lost Protector
	40610, -- Chestguard of the Lost Conqueror
	37012, -- The Horseman's Reins
	34857, -- Boots of the Forgotten Protector
	34855, -- Belt of the Forgotten Vanquisher
	34851, -- Bracers of the Forgotten Protector
	31372, -- Rocknail Flayer Carcass
	31103, -- Pauldrons of the Forgotten Protector
	31102, -- Pauldrons of the Forgotten Vanquisher
	31098, -- Leggings of the Forgotten Conqueror
	31096, -- Helm of the Forgotten Vanquisher
	31094, -- Gloves of the Forgotten Protector
	31093, -- Gloves of the Forgotten Vanquisher
	31091, -- Chestguard of the Forgotten Protector
	31089, -- Chestguard of the Forgotten Conqueror
	30250, -- Pauldrons of the Vanquished Hero
	30249, -- Pauldrons of the Vanquished Defender
	30248, -- Pauldrons of the Vanquished Champion
	30242, -- Helm of the Vanquished Champion
	30241, -- Gloves of the Vanquished Hero
	30240, -- Gloves of the Vanquished Defender
	30238, -- Chestguard of the Vanquished Hero
	30237, -- Chestguard of the Vanquished Defender
	29767, -- Leggings of the Fallen Defender
	29766, -- Leggings of the Fallen Champion
	29764, -- Pauldrons of the Fallen Defender
	29761, -- Helm of the Fallen Defender
	29759, -- Helm of the Fallen Hero
	29755, -- Chestguard of the Fallen Hero
	29754, -- Chestguard of the Fallen Champion
	29753, -- Chestguard of the Fallen Defender
	22372, -- Desecrated Sandals
	22369, -- Desecrated Bindings
	22368, -- Desecrated Shoulderpads
	22367, -- Desecrated Circlet
	22365, -- Desecrated Boots
	22359, -- Desecrated Legguards
	22358, -- Desecrated Sabatons
	22356, -- Desecrated Waistguard
	22353, -- Desecrated Helmet
	22351, -- Desecrated Robe
	22350, -- Desecrated Tunic
	22349, -- Desecrated Breastplate
	20228, -- Defiler's Advanced Care Package
	19154, -- Outrider Basic Care Package
	19153, -- Outrider Advanced Care Package
	19150, -- Sentinel Basic Care Package
	5524, -- Thick-Shelled Clam
	5523, -- Small Barnacled Clam
	2035, -- Sword of the Night Sky
	2030, -- Gnarled Staff
	2029, -- Cleaver
	2028, -- Hammer
	2025, -- Bearded Axe
	2024, -- Espadon
	226337, -- Devout Archaeologist's Excavator
	217382, -- Ruby Flightstone
	212367, -- Clutch of Wyrm's Awakened Crests
	211952, -- Satchel of Drake's Awakened Crests
	211951, -- Pouch of Whelpling's Awakened Crests
	210780, -- Lesser Ember of Fyr'alath
	208951, -- Paracausal Cluster
	208945, -- Paracausal Crate
	206025, -- Used Medical Wrap Kit
	206021, -- Kob'rok's Luminescent Scale
	206019, -- Abandoned Reserve Chute
	205989, -- Symbol of Friendship
	205988, -- Zaqali Elder Spear
	205987, -- Brimstone Rescue Ring
	205986, -- Well-Worn Kiln
	205216, -- Gently Jostled Jewels
	205211, -- Nutrient Diluted Protofluid
	205001, -- Resonating Arcane Crystal
	204853, -- Discarded Dracothyst Drill
	204850, -- Handful of Khaz'gorite Bolts
	204725, -- Drake's Hefty Chest
	204723, -- Whelpling's Hefty Chest
	204722, -- Whelpling's Bountiful Chest
	204721, -- Whelpling's Small Chest
	204573, -- Condensed Fire Magic
	204558, -- Reliquary Scroll of Perception
	204475, -- Busted Wyrmhole Generator
	204471, -- Defective Survival Pack
	204470, -- Haphazardly Discarded Bomb
	204379, -- Brimming Iskaaran Supply Pack
	204359, -- Reach Racer's Purse
	204233, -- Impenetrable Elemental Core
	204232, -- Slyvern Alpha Claw
	204231, -- Kingly Sheepskin Pelt
	204230, -- Dense Seaforged Javelin
	204229, -- Glimmering Rune of Arcantrix
	204228, -- Undigested Hochenblume Petal
	204224, -- Speck of Arcane Awareness
	204217, -- Unstable Elementium
	203702, -- Experimental Melder
	203224, -- Valdrakken Surplus Chest
	202670, -- Sealed Knowledge Scroll
	202669, -- Sealed Fish Scroll
	202667, -- Sealed Artifact Scroll
	202171, -- Obsidian Flightstone
	202098, -- Crowded Crate of Mined Materials
	196984, -- Cliffside Wylderdrake: Finned Jaw
	196982, -- Cliffside Wylderdrake: Ears
	196980, -- Cliffside Wylderdrake: Triple Head Horns
	196979, -- Cliffside Wylderdrake: Curled Head Horns
	196978, -- Cliffside Wylderdrake: Small Head Spikes
	196972, -- Cliffside Wylderdrake: Plated Brow
	196970, -- Cliffside Wylderdrake: Spiked Back
	196967, -- Cliffside Wylderdrake: Gold and White Armor
	196966, -- Cliffside Wylderdrake: Gold and Orange Armor
	196965, -- Cliffside Wylderdrake: Bronze and Teal Armor
	194838, -- Highland Drake Manuscript: Spined Head
	194829, -- Fated Fortune Card
	194708, -- Draconic Treatise on Mining
	194705, -- Highland Drake
	194704, -- Draconic Treatise on Herbalism
	194703, -- Draconic Treatise on Jewelcrafting
	194698, -- Draconic Treatise on Tailoring
	194549, -- Windborne Velocidrake
	194034, -- Renewed Proto-Drake
	193909, -- Ancient Gem Fragments
	193837, -- Backswimmer Timbertooth
	193225, -- Whiskuk
	192779, -- Seething Slug
	192111, -- Renewed Proto-Drake: Red Scales
	191658, -- Ensemble: Dark Ranger's Attire
	191303, -- Overflowing Chest of Riches
	191040, -- Cache of Sepulcher Treasures
	191037, -- Broker's Braid
	190944, -- Mace of Renewed Purpose
	190943, -- Jiro Tuning Hammer
	190941, -- Teachings of the Elders
	190851, -- Ensemble: Vagabond's Crimson Threads
	190799, -- Ensemble: Swashbuckling Buccaneer's Slops
	190797, -- Ensemble: Bones of the Bloodhunter
	190764, -- Broker's Ring
	190763, -- Broker's Belt
	190756, -- Broker's Legguards
	190741, -- Broker's Weaponry
	190725, -- Ensemble: Battlewraps of the Honored Valarjar
	190656, -- Cache of Sepulcher Treasures
	190655, -- Cache of Sepulcher Treasures
	190575, -- Ensemble: Chains of the Honored Valarjar
	190528, -- Ensemble: Vagabond's Violet Threads
	190339, -- Enlightened Offering
	190182, -- Lovely Regal Pocopoc
	190060, -- Adventurous Pocopoc
	190058, -- Peaceful Pocopoc
	189717, -- Pocopoc's Shielded Core
	189708, -- Pocopoc's Beryllium and Silver Body
	189707, -- Pocopoc's Bronze and Gold Body
	188700, -- Sturdy Silver Mawrat Harness
	188198, -- Traveler's Anima Cache
	187911, -- Sable "Soup"
	187787, -- Ephemera Orb
	187605, -- Broken Isles Gem Delivery
	187600, -- Broken Isles Ore Delivery
	187599, -- Broken Isles Herb Delivery
	187598, -- Broken Isles Cloth Delivery
	187596, -- Broken Isles Meat Delivery
	187577, -- Korthian Meat Cache
	187576, -- Korthian Skinning Cache
	187573, -- Brokers' Enchanting Mote of Potentiation
	187572, -- Brokers' Herbalism Mote of Potentiation
	187569, -- Brokers' Tailoring Mote of Potentiation
	187560, -- Rockin' Rollin' Racer Pack
	187344, -- Offering Kit Maker
	187098, -- Sterling Twin-Scythe Shoulders
	187090, -- Sterling Wingblade Pauldrons
	187089, -- Sterling Blade-Tipped Spaulders
	187088, -- Sterling Skullwing Shoulders
	187086, -- Deathsworn's Sterling Shoulderguards
	187075, -- Box of Rattling Chains
	187039, -- Malleare's Stygian Pauldrons
	187032, -- Spaulders of Prophetic Death
	187030, -- Deathsworn Shoulderguards
	187027, -- Skoldus' Shoulder Skewers
	186707, -- Gold Filled Crate
	186693, -- Gold Filled Wheelbarrow
	186679, -- Scroll of Domination
	186614, -- Soul Jar
	186580, -- A Tiny Sinstone
	186531, -- Cache of Sanctum Treasures
	186516, -- Ensemble: Devoted Aspirant's Regalia
	186514, -- Ensemble: Redeemed Inquisitor's Vestments
	186510, -- Ensemble: Sinful Inquisitor's Vestments
	186502, -- Ensemble: Marileth's Assistant Vestments
	186499, -- Ensemble: Garb of Fall's Promise
	186497, -- Ensemble: Garb of Pure Spirit
	184869, -- Cache of Nathrian Treasures
	184843, -- Salvaged Supplies
	184662, -- Requisitioned Anima Cell
	184646, -- Hero's Mining Cache
	184644, -- Hero's Tailoring Cache
	184643, -- Champion's Enchanting Cache
	184632, -- Champion's Fish Cache
	184499, -- Ensemble: Warplate of the Discordant
	184497, -- Ensemble: Garb of the Discordant
	184496, -- Ensemble: Vestments of the Discordant
	184441, -- Ensemble: Notorious Gladiator's Mail Armor
	184438, -- Ensemble: Notorious Gladiator's Leather Armor
	184431, -- Ensemble: Sinister Gladiator's Mail Armor
	184426, -- Ensemble: Dread Gladiator's Plate Armor
	184425, -- Ensemble: Dread Gladiator's Plate Armor
	184424, -- Ensemble: Dread Gladiator's Mail Armor
	184420, -- Ensemble: Dread Gladiator's Cloth Armor
	184198, -- Soul-Touched Key
	184116, -- Ensemble: Winterborn Guise
	184113, -- Ensemble: Conservator's Regalia
	184112, -- Ensemble: Conservator's Raiment
	184045, -- Martial Tithe of the Court of Harvesters
	183831, -- Safe Fall Kit
	183703, -- Bonesmith's Satchel
	183390, -- Memory of a Reprisal
	183388, -- Memory of a Reckless Defense
	183372, -- Memory of the Grim Inquisitor
	183371, -- Memory of the Horned Nightmare
	183360, -- Memory of the Primal Tide Core
	183355, -- Memory of the Frost Witch
	183351, -- Memory of an Elemental Equilibrium
	183322, -- Memory of a Divine Image
	183308, -- Memory of the Endless Kings
	183307, -- Memory of a Holy Sigil
	183305, -- Memory of the Shock Barrier
	183302, -- Memory of the Sunwell's Bloom
	183294, -- Memory of the Jade Ignition
	183291, -- Memory of Yu'lon
	183286, -- Memory of Shaohao
	183281, -- Memory of Slick Ice
	183273, -- Memory of a Temporal Warp
	183270, -- Memory of an Arcane Bombardment
	183259, -- Memory of the Unblinking Vigil
	183254, -- Memory of a Dire Command
	183239, -- Memory of an Unending Growth
	183237, -- Memory of the Sleeper
	183232, -- Memory of a Symmetrical Eye
	183226, -- Memory of the Balance of All Things
	183221, -- Memory of the Dark Flame Spirit
	183193, -- Jar of Ashes
	183192, -- Frenzied Mawrat
	183191, -- Maw Crawler
	183117, -- Severs
	183115, -- Tower Deathroach
	182634, -- Memory of a Frozen Champion's Rage
	182632, -- Memory of Absolute Zero
	182332, -- Gravestone Battle Armor
	180648, -- Court of Harvesters Supplies
	180647, -- Ascended Supplies
	180592, -- Trapped Stonefiend
	180205, -- Ensemble: Corrupted Gladiator's Mail Armor
	180203, -- Ensemble: Corrupted Gladiator's Cloth Armor
	180201, -- Ensemble: Notorious Aspirant's Plate Armor
	180200, -- Ensemble: Notorious Aspirant's Plate Armor
	180198, -- Ensemble: Notorious Aspirant's Mail Armor
	180195, -- Ensemble: Notorious Aspirant's Cloth Armor
	180194, -- Ensemble: Notorious Aspirant's Cloth Armor
	180193, -- Ensemble: Sinister Aspirant's Plate Armor
	180192, -- Ensemble: Sinister Aspirant's Plate Armor
	180191, -- Ensemble: Sinister Aspirant's Mail Armor
	180190, -- Ensemble: Sinister Aspirant's Mail Armor
	180189, -- Ensemble: Sinister Aspirant's Leather Armor
	180188, -- Ensemble: Sinister Aspirant's Leather Armor
	180185, -- Ensemble: Dread Aspirant's Plate Armor
	180181, -- Ensemble: Dread Aspirant's Leather Armor
	178045, -- Soul Prism
	178040, -- Condensed Stygia
	176409, -- Rejuvenating Siphoned Essence
	176408, -- Blinding Smoke Capsules
	175062, -- Malefic Core
	173538, -- Hippogryph Whistle
	173537, -- Glowing Hearthstone
	173527, -- Duskwood Scroll
	173300, -- Ensemble: Renowned Explorer's Attire
	171981, -- Ensemble: Shadowcraft Armor
	171979, -- Ensemble: Lightforge Armor
	171976, -- Ensemble: Wildheart Raiment
	171210, -- Satchel of Nature's Bounty
	170540, -- Ravenous Anima Cell
	169940, -- Unshackled Supplies
	169849, -- Azeroth Mini: Naeno Megacrash
	169843, -- Azeroth Mini: Cork Stuttguard
	169797, -- Azeroth Mini: Wrenchbot
	169795, -- Azeroth Mini: Bondo Bigblock
	169794, -- Azeroth Mini: Izira Gearsworn
	168124, -- Cache of War Resources
	168061, -- Ensemble: Amaranthine Path Armor
	166299, -- Honorbound Supplies
	166298, -- Champions of Azeroth Supplies
	166297, -- Order of Embers Supplies
	166295, -- Proudmoore Admiralty Supplies
	166290, -- Voldunai Supplies
	165872, -- 7th Legion Equipment Cache
	162644, -- Winter Veil Gift
	162642, -- Toy Armor Set
	162598, -- Ensemble: Vestments of the Tidesages
	158208, -- Ensemble: Sha'tari Defender's Plate
	157827, -- Warden's Field Kit
	157577, -- Ensemble: Goldspine Plate
	153216, -- Relinquished Trinket
	153215, -- Relinquished Spaulders
	153209, -- Relinquished Cloak
	153207, -- Relinquished Treads
	153205, -- Relinquished Girdle
	153156, -- Unsullied Cloth Sash
	153155, -- Unsullied Plate Helmet
	153153, -- Unsullied Plate Pauldrons
	153152, -- Unsullied Mail Boots
	153150, -- Unsullied Plate Vambraces
	153148, -- Unsullied Leather Belt
	153140, -- Unsullied Plate Waistplate
	153138, -- Unsullied Mail Legguards
	153137, -- Unsullied Mail Spaulders
	153135, -- Unsullied Cloth Robes
	153067, -- Relinquished Shadow Relic
	153066, -- Relinquished Life Relic
	153065, -- Relinquished Iron Relic
	153064, -- Relinquished Holy Relic
	153062, -- Relinquished Fire Relic
	153061, -- Relinquished Fel Relic
	153060, -- Relinquished Blood Relic
	153059, -- Relinquished Arcane Relic
	152960, -- Argussian Reach Insignia
	152922, -- Brittle Krokul Chest
	152799, -- Unsullied Relic
	152742, -- Unsullied Cloth Cuffs
	152739, -- Unsullied Leather Grips
	152737, -- Unsullied Leather Trousers
	152734, -- Unsullied Cloth Mantle
	152396, -- Arsenal: Weapons of the Lightforged
	152243, -- Ensemble: Sterling Triumvirate Chainmail
	152241, -- Ensemble: Light-Woven Triumvirate Regalia
	152107, -- Warden's Supply Kit
	152106, -- Valarjar Strongbox
	152102, -- Farondis Chest
	151843, -- Eredath Armor Set
	151693, -- Ensemble: Riftscarred Vestments
	151692, -- Ensemble: Chronoscryer's Finery
	151119, -- Ensemble: Der'izu Armor
	151118, -- Ensemble: Obsidian Prowler's Garb
	150268, -- Ensemble: Fierce Combatant's Scaled Armor
	150263, -- Ensemble: Fierce Combatant's Satin Armor
	150262, -- Ensemble: Fierce Combatant's Satin Armor
	150260, -- Ensemble: Fierce Combatant's Leather Armor
	150257, -- Ensemble: Fierce Combatant's Felweave Armor
	150254, -- Ensemble: Fierce Combatant's Felskin Armor
	150253, -- Ensemble: Fierce Combatant's Dreadplate Armor
	150249, -- Ensemble: Fierce Combatant's Ringmail Armor
	149499, -- Ensemble: Fierce Gladiator's Scaled Armor
	149498, -- Ensemble: Fierce Gladiator's Scaled Armor
	149496, -- Ensemble: Fierce Gladiator's Satin Armor
	149494, -- Ensemble: Fierce Gladiator's Ringmail Armor
	149491, -- Ensemble: Fierce Gladiator's Leather Armor
	149490, -- Ensemble: Fierce Gladiator's Leather Armor
	149483, -- Ensemble: Fierce Gladiator's Dreadplate Armor
	149476, -- Ensemble: Elite Fierce Gladiator's Silk Armor
	149475, -- Ensemble: Elite Fierce Gladiator's Scaled Armor
	149473, -- Ensemble: Elite Fierce Gladiator's Satin Armor
	149471, -- Ensemble: Elite Fierce Gladiator's Ringmail Armor
	149470, -- Ensemble: Elite Fierce Gladiator's Ringmail Armor
	149469, -- Ensemble: Elite Fierce Gladiator's Plate Armor
	149468, -- Ensemble: Elite Fierce Gladiator's Plate Armor
	149466, -- Ensemble: Elite Fierce Gladiator's Leather Armor
	149463, -- Ensemble: Elite Fierce Gladiator's Felweave Armor
	149462, -- Ensemble: Elite Fierce Gladiator's Felweave Armor
	149460, -- Ensemble: Elite Fierce Gladiator's Felskin Armor
	149456, -- Ensemble: Elite Fierce Gladiator's Dragonhide Armor
	149454, -- Ensemble: Elite Fierce Gladiator's Chain Armor
	147726, -- Nethercluster
	147693, -- Ensemble: Cruel Combatant's Scaled Armor
	147687, -- Ensemble: Cruel Combatant's Satin Armor
	147685, -- Ensemble: Cruel Combatant's Leather Armor
	147683, -- Ensemble: Cruel Combatant's Ironskin Armor
	147682, -- Ensemble: Cruel Combatant's Felweave Armor
	147679, -- Ensemble: Cruel Combatant's Felskin Armor
	147678, -- Ensemble: Cruel Combatant's Dreadplate Armor
	147674, -- Ensemble: Cruel Combatant's Ringmail Armor
	147661, -- Ensemble: Cruel Gladiator's Ringmail Armor
	147660, -- Ensemble: Cruel Gladiator's Plate Armor
	147659, -- Ensemble: Cruel Gladiator's Plate Armor
	147655, -- Ensemble: Cruel Gladiator's Ironskin Armor
	147654, -- Ensemble: Cruel Gladiator's Felweave Armor
	147653, -- Ensemble: Cruel Gladiator's Felweave Armor
	147650, -- Ensemble: Cruel Gladiator's Dreadplate Armor
	147646, -- Ensemble: Cruel Gladiator's Chain Armor
	147645, -- Ensemble: Cruel Gladiator's Chain Armor
	147642, -- Ensemble: Elite Cruel Gladiator's Scaled Armor
	147640, -- Ensemble: Elite Cruel Gladiator's Satin Armor
	147637, -- Ensemble: Elite Cruel Gladiator's Ringmail Armor
	147635, -- Ensemble: Elite Cruel Gladiator's Plate Armor
	147634, -- Ensemble: Elite Cruel Gladiator's Leather Armor
	147633, -- Ensemble: Elite Cruel Gladiator's Leather Armor
	147632, -- Ensemble: Elite Cruel Gladiator's Ironskin Armor
	147631, -- Ensemble: Elite Cruel Gladiator's Ironskin Armor
	147630, -- Ensemble: Elite Cruel Gladiator's Felweave Armor
	147627, -- Ensemble: Elite Cruel Gladiator's Felskin Armor
	147625, -- Ensemble: Elite Cruel Gladiator's Dreadplate Armor
	147624, -- Ensemble: Elite Cruel Gladiator's Dragonhide Armor
	147621, -- Ensemble: Elite Cruel Gladiator's Chain Armor
	147418, -- Arcane Remnant of Falanaar
	147349, -- Spiked Armor Set
	147222, -- Dauntless Cloak
	147221, -- Dauntless Choker
	147220, -- Dauntless Ring
	147218, -- Dauntless Spaulders
	147212, -- Dauntless Bracers
	146942, -- Dreamweaver Insignia
	146637, -- Ensemble: Vengeful Gladiator's Silk Armor
	146635, -- Ensemble: Vengeful Gladiator's Satin Armor
	146632, -- Ensemble: Vengeful Gladiator's Leather Armor
	146631, -- Ensemble: Vengeful Gladiator's Felweave Armor
	146628, -- Ensemble: Vengeful Gladiator's Chain Armor
	146627, -- Ensemble: Merciless Gladiator's Silk Armor
	146626, -- Ensemble: Merciless Gladiator's Scaled Armor
	146624, -- Ensemble: Merciless Gladiator's Ringmail Armor
	146623, -- Ensemble: Merciless Gladiator's Plate Armor
	146616, -- Ensemble: Gladiator's Scaled Armor
	146614, -- Ensemble: Gladiator's Ringmail Armor
	146607, -- Ensemble: Brutal Gladiator's Silk Armor
	146604, -- Ensemble: Brutal Gladiator's Ringmail Armor
	146602, -- Ensemble: Brutal Gladiator's Leather Armor
	146600, -- Ensemble: Brutal Gladiator's Dreadplate Armor
	146591, -- Ensemble: Wrathful Gladiator's Felweave Armor
	146588, -- Ensemble: Wrathful Gladiator's Chain Armor
	146582, -- Ensemble: Savage Gladiator's Leather Armor
	146581, -- Ensemble: Savage Gladiator's Felweave Armor
	146580, -- Ensemble: Savage Gladiator's Dreadplate Armor
	146577, -- Ensemble: Relentless Gladiator's Silk Armor
	146574, -- Ensemble: Relentless Gladiator's Ringmail Armor
	146573, -- Ensemble: Relentless Gladiator's Plate Armor
	146572, -- Ensemble: Relentless Gladiator's Leather Armor
	146570, -- Ensemble: Relentless Gladiator's Dreadplate Armor
	146562, -- Ensemble: Hateful Gladiator's Leather Armor
	146561, -- Ensemble: Hateful Gladiator's Felweave Armor
	146559, -- Ensemble: Hateful Gladiator's Dragonhide Armor
	146557, -- Ensemble: Furious Gladiator's Silk Armor
	146556, -- Ensemble: Furious Gladiator's Scaled Armor
	146553, -- Ensemble: Furious Gladiator's Plate Armor
	146551, -- Ensemble: Furious Gladiator's Felweave Armor
	146547, -- Ensemble: Deadly Gladiator's Silk Armor
	146546, -- Ensemble: Deadly Gladiator's Scaled Armor
	146544, -- Ensemble: Deadly Gladiator's Ringmail Armor
	146543, -- Ensemble: Deadly Gladiator's Plate Armor
	146541, -- Ensemble: Deadly Gladiator's Felweave Armor
	146540, -- Ensemble: Deadly Gladiator's Dreadplate Armor
	146533, -- Ensemble: Vicious Gladiator's Satin Armor
	146521, -- Ensemble: Vicious Gladiator's Dragonhide Armor
	146517, -- Ensemble: Ruthless Gladiator's Silk Armor
	146515, -- Ensemble: Ruthless Gladiator's Scaled Armor
	146513, -- Ensemble: Ruthless Gladiator's Satin Armor
	146509, -- Ensemble: Ruthless Gladiator's Plate Armor
	146507, -- Ensemble: Ruthless Gladiator's Leather Armor
	146505, -- Ensemble: Ruthless Gladiator's Felweave Armor
	146503, -- Ensemble: Ruthless Gladiator's Dreadplate Armor
	146453, -- Ensemble: Cataclysmic Gladiator's Satin Armor
	146447, -- Ensemble: Cataclysmic Gladiator's Leather Armor
	146445, -- Ensemble: Cataclysmic Gladiator's Felweave Armor
	146443, -- Ensemble: Cataclysmic Gladiator's Dreadplate Armor
	146441, -- Ensemble: Cataclysmic Gladiator's Dragonhide Armor
	146437, -- Ensemble: Bloodthirsty Gladiator's Silk Armor
	146429, -- Ensemble: Bloodthirsty Gladiator's Plate Armor
	146425, -- Ensemble: Bloodthirsty Gladiator's Felweave Armor
	146423, -- Ensemble: Bloodthirsty Gladiator's Dreadplate Armor
	146265, -- Ensemble: Vindictive Combatant's Felskin Armor
	146264, -- Ensemble: Vindictive Combatant's Felskin Armor
	146262, -- Ensemble: Vindictive Gladiator's Felskin Armor
	146239, -- Ensemble: Elite Vindictive Gladiator's Felweave Armor
	146238, -- Ensemble: Elite Vindictive Gladiator's Felweave Armor
	146235, -- Ensemble: Elite Vindictive Gladiator's Silk Armor
	146232, -- Ensemble: Elite Vindictive Gladiator's Leather Armor
	146230, -- Ensemble: Elite Vindictive Gladiator's Ironskin Armor
	146229, -- Ensemble: Elite Vindictive Gladiator's Dragonhide Armor
	146226, -- Ensemble: Elite Vindictive Gladiator's Chain Armor
	146225, -- Ensemble: Elite Vindictive Gladiator's Ringmail Armor
	146224, -- Ensemble: Elite Vindictive Gladiator's Ringmail Armor
	146222, -- Ensemble: Elite Vindictive Gladiator's Scaled Armor
	146173, -- Ensemble: Vindictive Combatant's Leather Armor
	146171, -- Ensemble: Vindictive Combatant's Ironskin Armor
	146165, -- Ensemble: Vindictive Combatant's Dreadplate Armor
	146164, -- Ensemble: Vindictive Combatant's Dreadplate Armor
	146163, -- Ensemble: Vindictive Combatant's Plate Armor
	146161, -- Ensemble: Vindictive Combatant's Felweave Armor
	146159, -- Ensemble: Vindictive Combatant's Satin Armor
	146158, -- Ensemble: Vindictive Combatant's Satin Armor
	146156, -- Ensemble: Vindictive Combatant's Silk Armor
	146155, -- Ensemble: Vindictive Combatant's Chain Armor
	146154, -- Ensemble: Vindictive Combatant's Chain Armor
	146153, -- Ensemble: Vindictive Combatant's Ringmail Armor
	146152, -- Ensemble: Vindictive Combatant's Ringmail Armor
	146148, -- Ensemble: Vindictive Gladiator's Satin Armor
	146147, -- Ensemble: Vindictive Gladiator's Silk Armor
	146145, -- Ensemble: Vindictive Gladiator's Leather Armor
	146142, -- Ensemble: Vindictive Gladiator's Ironskin Armor
	146139, -- Ensemble: Vindictive Gladiator's Chain Armor
	146138, -- Ensemble: Vindictive Gladiator's Chain Armor
	146137, -- Ensemble: Vindictive Gladiator's Ringmail Armor
	146135, -- Ensemble: Vindictive Gladiator's Scaled Armor
	146131, -- Ensemble: Vindictive Gladiator's Plate Armor
	144072, -- Adopted Puppy Crate
	143954, -- Paradox Spirit
	143947, -- Commendation of Emperor Shaohao
	143946, -- Commendation of The Anglers
	143944, -- Commendation of Operation: Shieldwall
	143939, -- Commendation of the Sunreaver Onslaught
	143938, -- Commendation of The August Celestials
	143936, -- Commendation of the Shado-Pan
	143826, -- Ensemble: Grievous Gladiator's Felweave Armor
	143735, -- Ancient Mana Shards
	143733, -- Ancient Mana Shards
	143519, -- Ensemble: Funerary Plate of the Chosen Dead
	143518, -- Ensemble: Funerary Plate of the Chosen Dead
	143515, -- Ensemble: Chains of the Chosen Dead
	143514, -- Ensemble: Chains of the Chosen Dead
	143513, -- Ensemble: Garb of the Chosen Dead
	143512, -- Ensemble: Garb of the Chosen Dead
	143510, -- Ensemble: Garb of the Chosen Dead
	143509, -- Ensemble: Vestment of the Chosen Dead
	143507, -- Ensemble: Vestment of the Chosen Dead
	142273, -- Ensemble: Blackened Defias Armor
	142156, -- Order Resources Cache
	141655, -- Shimmering Ancient Mana Cluster
	141372, -- Arsenal: Armaments of the Ebon Blade
	140402, -- Green Or'ligai Egg
	140401, -- Blue Or'ligai Egg
	140390, -- Red Or'ligai Egg
	140248, -- Master Jeweler's Gem
	140246, -- Arc of Snow
	140243, -- Azurefall Essence
	140242, -- Astromancer's Compass
	140235, -- Small Jar of Arcwine
	140234, -- Selentia's Mana-Infused Brooch
	139890, -- Ancient Mana Gem
	139495, -- Forgotten Schematics of the Broken Isles
	139168, -- Ensemble: Fel-Chain Mail Armor
	138720, -- Ensemble: Dreadful Gladiator's Ironskin Armor
	138718, -- Ensemble: Dreadful Gladiator's Chain Armor
	138714, -- Ensemble: Dreadful Gladiator's Plate Armor
	138713, -- Ensemble: Malevolent Gladiator's Felweave Armor
	138712, -- Ensemble: Malevolent Gladiator's Satin Armor
	138711, -- Ensemble: Malevolent Gladiator's Silk Armor
	138710, -- Ensemble: Malevolent Gladiator's Leather Armor
	138706, -- Ensemble: Malevolent Gladiator's Ringmail Armor
	138704, -- Ensemble: Malevolent Gladiator's Dreadplate Armor
	138702, -- Ensemble: Tyrannical Gladiator's Felweave Armor
	138700, -- Ensemble: Tyrannical Gladiator's Satin Armor
	138699, -- Ensemble: Tyrannical Gladiator's Satin Armor
	138694, -- Ensemble: Tyrannical Gladiator's Ironskin Armor
	138690, -- Ensemble: Tyrannical Gladiator's Chain Armor
	138688, -- Ensemble: Tyrannical Gladiator's Ringmail Armor
	138687, -- Ensemble: Tyrannical Gladiator's Ringmail Armor
	138684, -- Ensemble: Tyrannical Gladiator's Dreadplate Armor
	138683, -- Ensemble: Tyrannical Gladiator's Dreadplate Armor
	138682, -- Ensemble: Tyrannical Gladiator's Plate Armor
	138679, -- Ensemble: Grievous Gladiator's Felweave Armor
	138677, -- Ensemble: Grievous Gladiator's Satin Armor
	138673, -- Ensemble: Grievous Gladiator's Leather Armor
	138671, -- Ensemble: Grievous Gladiator's Ironskin Armor
	138670, -- Ensemble: Grievous Gladiator's Dragonhide Armor
	138667, -- Ensemble: Grievous Gladiator's Chain Armor
	138666, -- Ensemble: Grievous Gladiator's Ringmail Armor
	138664, -- Ensemble: Grievous Gladiator's Scaled Armor
	138661, -- Ensemble: Grievous Gladiator's Dreadplate Armor
	138657, -- Ensemble: Prideful Gladiator's Felweave Armor
	138653, -- Ensemble: Prideful Gladiator's Silk Armor
	138650, -- Ensemble: Prideful Gladiator's Ironskin Armor
	138646, -- Ensemble: Prideful Gladiator's Chain Armor
	138645, -- Ensemble: Prideful Gladiator's Chain Armor
	138643, -- Ensemble: Prideful Gladiator's Ringmail Armor
	138642, -- Ensemble: Prideful Gladiator's Scaled Armor
	138641, -- Ensemble: Prideful Gladiator's Scaled Armor
	138639, -- Ensemble: Prideful Gladiator's Dreadplate Armor
	138638, -- Ensemble: Prideful Gladiator's Plate Armor
	138637, -- Ensemble: Prideful Gladiator's Plate Armor
	138622, -- Ensemble: Primal Combatant's Leather Armor
	138621, -- Ensemble: Primal Combatant's Leather Armor
	138618, -- Ensemble: Primal Combatant's Dragonhide Armor
	138617, -- Ensemble: Primal Combatant's Dragonhide Armor
	138615, -- Ensemble: Primal Combatant's Scaled Armor
	138613, -- Ensemble: Primal Combatant's Dreadplate Armor
	138612, -- Ensemble: Primal Combatant's Plate Armor
	138611, -- Ensemble: Primal Combatant's Plate Armor
	138610, -- Ensemble: Wild Combatant's Leather Armor
	138608, -- Ensemble: Wild Combatant's Ironskin Armor
	138607, -- Ensemble: Wild Combatant's Ironskin Armor
	138605, -- Ensemble: Wild Combatant's Dragonhide Armor
	138603, -- Ensemble: Wild Combatant's Scaled Armor
	138602, -- Ensemble: Wild Combatant's Dreadplate Armor
	138601, -- Ensemble: Wild Combatant's Dreadplate Armor
	138600, -- Ensemble: Wild Combatant's Plate Armor
	138597, -- Ensemble: Warmongering Combatant's Leather Armor
	138596, -- Ensemble: Warmongering Combatant's Ironskin Armor
	138594, -- Ensemble: Warmongering Combatant's Dragonhide Armor
	138593, -- Ensemble: Warmongering Combatant's Dragonhide Armor
	138591, -- Ensemble: Warmongering Combatant's Scaled Armor
	138585, -- Ensemble: Primal Combatant's Felweave Armor
	138584, -- Ensemble: Primal Combatant's Satin Armor
	138583, -- Ensemble: Primal Combatant's Satin Armor
	138581, -- Ensemble: Primal Combatant's Silk Armor
	138580, -- Ensemble: Primal Combatant's Chain Armor
	138579, -- Ensemble: Primal Combatant's Chain Armor
	138578, -- Ensemble: Primal Combatant's Ringmail Armor
	138575, -- Ensemble: Primal Gladiator's Felweave Armor
	138573, -- Ensemble: Primal Gladiator's Satin Armor
	138568, -- Ensemble: Primal Gladiator's Ironskin Armor
	138566, -- Ensemble: Primal Gladiator's Dragonhide Armor
	138564, -- Ensemble: Primal Gladiator's Chain Armor
	138560, -- Ensemble: Primal Gladiator's Scaled Armor
	138557, -- Ensemble: Primal Gladiator's Dreadplate Armor
	138556, -- Ensemble: Primal Gladiator's Plate Armor
	138549, -- Ensemble: Wild Combatant's Silk Armor
	138536, -- Ensemble: Warmongering Combatant's Ringmail Armor
	138532, -- Ensemble: Wild Gladiator's Satin Armor
	138531, -- Ensemble: Wild Gladiator's Satin Armor
	138528, -- Ensemble: Wild Gladiator's Leather Armor
	138527, -- Ensemble: Wild Gladiator's Leather Armor
	138526, -- Ensemble: Wild Gladiator's Ironskin Armor
	138525, -- Ensemble: Wild Gladiator's Ironskin Armor
	138524, -- Ensemble: Wild Gladiator's Dragonhide Armor
	138521, -- Ensemble: Wild Gladiator's Chain Armor
	138520, -- Ensemble: Wild Gladiator's Ringmail Armor
	138519, -- Ensemble: Wild Gladiator's Ringmail Armor
	138518, -- Ensemble: Wild Gladiator's Scaled Armor
	138517, -- Ensemble: Wild Gladiator's Scaled Armor
	138515, -- Ensemble: Wild Gladiator's Dreadplate Armor
	138509, -- Ensemble: Warmongering Gladiator's Satin Armor
	138508, -- Ensemble: Warmongering Gladiator's Silk Armor
	138507, -- Ensemble: Warmongering Gladiator's Silk Armor
	138506, -- Ensemble: Warmongering Gladiator's Leather Armor
	138503, -- Ensemble: Warmongering Gladiator's Ironskin Armor
	138502, -- Ensemble: Warmongering Gladiator's Dragonhide Armor
	138501, -- Ensemble: Warmongering Gladiator's Dragonhide Armor
	138500, -- Ensemble: Warmongering Gladiator's Chain Armor
	138499, -- Ensemble: Warmongering Gladiator's Chain Armor
	138498, -- Ensemble: Warmongering Gladiator's Ringmail Armor
	138497, -- Ensemble: Warmongering Gladiator's Ringmail Armor
	138496, -- Ensemble: Warmongering Gladiator's Scaled Armor
	138495, -- Ensemble: Warmongering Gladiator's Scaled Armor
	138493, -- Ensemble: Warmongering Gladiator's Dreadplate Armor
	138431, -- Ensemble: Scale of the Scarlet Crusade
	137010, -- Half-Full Bottle of Arcwine
	136412, -- Heavy Armor Set
	133150, -- Commendation of the Dragonmaw Clan
	130199, -- Legion Pocket Portal
	129951, -- Commendation of Lower City
	129946, -- Commendation of The Sha'tar
	129945, -- Commendation of The Consortium
	129929, -- Ever-Shifting Mirror
	129923, -- Reins of the Eclipse Dragonhawk
	128649, -- Illusion: Winter's Grasp
	128316, -- Bulging Barrel of Oil
	128315, -- Medallion of the Legion
	127969, -- Badge of Hellfire's Conqueror
	127968, -- Badge of Hellfire's Vanquisher
	127967, -- Shoulders of Hellfire's Protector
	127963, -- Chest of Hellfire's Protector
	127958, -- Gauntlets of Hellfire's Vanquisher
	127956, -- Helm of Hellfire's Conqueror
	127954, -- Gauntlets of Hellfire's Conqueror
	124023, -- Leystone Armor Set
	123858, -- Follower Retraining Scroll Case
	122486, -- Blackrock Foundry Spoils
	122484, -- Blackrock Foundry Spoils
	122239, -- Music Roll: Shalandis Isle
	122238, -- Music Roll: Darkmoon Carousel
	122229, -- Music Roll: Invincible
	122224, -- Music Roll: Mountains
	122223, -- Music Roll: Ghost
	122222, -- Music Roll: Angelic
	122216, -- Music Roll: The Zandalari
	122214, -- Music Roll: Mulgore Plains
	122210, -- Music Roll: Orgrimmar
	122208, -- Music Roll: Exodar
	122206, -- Music Roll: Gnomeregan
	122202, -- Music Roll: High Seas
	122197, -- Music Roll: Wrath of the Lich King
	122196, -- Music Roll: The Burning Legion
	122100, -- Soul Gem
	120301, -- Armor Enhancement Token
	120256, -- Shoulders of the Iron Protector
	120253, -- Gauntlets of the Iron Protector
	120251, -- Chest of the Iron Vanquisher
	120245, -- Helm of the Iron Conqueror
	120238, -- Gauntlets of the Iron Protector
	120236, -- Chest of the Iron Vanquisher
	120233, -- Helm of the Iron Vanquisher
	120228, -- Gauntlets of the Iron Conqueror
	120227, -- Chest of the Iron Conqueror
	120224, -- Leggings of the Iron Protector
	120223, -- Gauntlets of the Iron Protector
	120220, -- Shoulders of the Iron Vanquisher
	120218, -- Helm of the Iron Vanquisher
	120217, -- Gauntlets of the Iron Vanquisher
	120216, -- Shoulders of the Iron Conqueror
	120212, -- Chest of the Iron Conqueror
	119320, -- Leggings of the Iron Protector
	119319, -- Gauntlets of the Iron Protector
	119318, -- Chest of the Iron Protector
	119315, -- Chest of the Iron Vanquisher
	119314, -- Shoulders of the Iron Vanquisher
	119313, -- Leggings of the Iron Vanquisher
	119312, -- Helm of the Iron Vanquisher
	119309, -- Shoulders of the Iron Conqueror
	119306, -- Gauntlets of the Iron Conqueror
	119305, -- Chest of the Iron Conqueror
	118572, -- Illusion: Flames of Ragnaros
	116891, -- "Snowy Owl" Contender's Costume
	116856, -- "Blooming Rose" Contender's Costume
	116801, -- Cursed Birman
	116248, -- Frostwall Mines, Level 2
	116200, -- Goblin Workshop, Level 2
	114746, -- Goredrenched Armor Set
	114108, -- Tormented Armament
	112002, -- Stables, Level 2
	111999, -- Menagerie, Level 3
	111998, -- Menagerie, Level 2
	111997, -- Herb Garden, Level 3
	111993, -- Tailoring Emporium, Level 3
	111992, -- Tailoring Emporium, Level 2
	111987, -- Trading Post, Level 3
	111981, -- Gladiator's Sanctum, Level 3
	111980, -- Gladiator's Sanctum, Level 2
	111977, -- Salvage Yard, Level 3
	111976, -- Salvage Yard, Level 2
	111972, -- Enchanter's Study, Level 2
	111971, -- Barracks, Level 3
	111970, -- Barracks, Level 2
	111969, -- Barn, Level 3
	111929, -- Alchemy Lab, Level 2
	111927, -- Fishing Shack, Level 2
	111350, -- A Compendium of the Herbs of Draenor
	109255, -- Lumber Mill, Level 3
	105868, -- Essence of the Cursed Vanquisher
	105867, -- Essence of the Cursed Conqueror
	105866, -- Essence of the Cursed Protector
	105865, -- Essence of the Cursed Vanquisher
	105862, -- Essence of the Cursed Vanquisher
	105857, -- Essence of the Cursed Protector
	104324, -- Foot Ball
	104323, -- The Swineskin
	104198, -- Mantid Artifact Hunter's Kit
	104009, -- Timeless Plate Armor Cache
	101662, -- Pandaren Treasure Noodle Cart Kit
	99756, -- Shoulders of the Cursed Protector
	99755, -- Shoulders of the Cursed Conqueror
	99753, -- Leggings of the Cursed Protector
	99752, -- Leggings of the Cursed Conqueror
	99749, -- Helm of the Cursed Conqueror
	99746, -- Gauntlets of the Cursed Conqueror
	99744, -- Chest of the Cursed Protector
	99724, -- Helm of the Cursed Conqueror
	99723, -- Helm of the Cursed Vanquisher
	99720, -- Gauntlets of the Cursed Vanquisher
	99719, -- Shoulders of the Cursed Protector
	99716, -- Chest of the Cursed Protector
	99715, -- Chest of the Cursed Conqueror
	99714, -- Chest of the Cursed Vanquisher
	99713, -- Leggings of the Cursed Protector
	99712, -- Leggings of the Cursed Conqueror
	99696, -- Chest of the Cursed Vanquisher
	99695, -- Shoulders of the Cursed Protector
	99694, -- Helm of the Cursed Protector
	99693, -- Leggings of the Cursed Protector
	99691, -- Chest of the Cursed Protector
	99689, -- Helm of the Cursed Conqueror
	99687, -- Gauntlets of the Cursed Conqueror
	99683, -- Helm of the Cursed Vanquisher
	99681, -- Gauntlets of the Cursed Conqueror
	99679, -- Chest of the Cursed Protector
	99678, -- Chest of the Cursed Conqueror
	99677, -- Chest of the Cursed Vanquisher
	99676, -- Leggings of the Cursed Protector
	99671, -- Helm of the Cursed Vanquisher
	99670, -- Shoulders of the Cursed Protector
	99668, -- Shoulders of the Cursed Vanquisher
	99667, -- Gauntlets of the Cursed Protector
	96633, -- Leggings of the Crackling Protector
	96632, -- Leggings of the Crackling Conqueror
	96624, -- Helm of the Crackling Conqueror
	96600, -- Gauntlets of the Crackling Conqueror
	96567, -- Chest of the Crackling Conqueror
	95957, -- Shoulders of the Crackling Protector
	95955, -- Shoulders of the Crackling Vanquisher
	95888, -- Leggings of the Crackling Conqueror
	95857, -- Gauntlets of the Crackling Protector
	95856, -- Gauntlets of the Crackling Conqueror
	95855, -- Gauntlets of the Crackling Vanquisher
	95581, -- Leggings of the Crackling Protector
	95577, -- Helm of the Crackling Conqueror
	95576, -- Leggings of the Crackling Conqueror
	95574, -- Chest of the Crackling Conqueror
	95571, -- Helm of the Crackling Vanquisher
	95569, -- Chest of the Crackling Vanquisher
	92794, -- Ride Ticket Book
	89277, -- Shoulders of the Shadowy Conqueror
	89276, -- Shoulders of the Shadowy Vanquisher
	89275, -- Helm of the Shadowy Protector
	89272, -- Gauntlets of the Shadowy Protector
	89270, -- Gauntlets of the Shadowy Vanquisher
	89268, -- Leggings of the Shadowy Conqueror
	89267, -- Leggings of the Shadowy Vanquisher
	89264, -- Chest of the Shadowy Vanquisher
	89262, -- Shoulders of the Shadowy Conqueror
	89260, -- Helm of the Shadowy Protector
	89257, -- Gauntlets of the Shadowy Protector
	89256, -- Gauntlets of the Shadowy Conqueror
	89249, -- Chest of the Shadowy Vanquisher
	89248, -- Shoulders of the Shadowy Vanquisher
	89245, -- Leggings of the Shadowy Vanquisher
	89240, -- Gauntlets of the Shadowy Conqueror
	89239, -- Chest of the Shadowy Vanquisher
	89237, -- Chest of the Shadowy Conqueror
	89236, -- Helm of the Shadowy Protector
	89235, -- Helm of the Shadowy Conqueror
	78875, -- Shoulders of the Corrupted Conqueror
	78873, -- Leggings of the Corrupted Protector
	78872, -- Leggings of the Corrupted Conqueror
	78871, -- Leggings of the Corrupted Vanquisher
	78869, -- Crown of the Corrupted Conqueror
	78867, -- Gauntlets of the Corrupted Protector
	78866, -- Gauntlets of the Corrupted Conqueror
	78865, -- Gauntlets of the Corrupted Vanquisher
	78860, -- Shoulders of the Corrupted Protector
	78858, -- Leggings of the Corrupted Vanquisher
	78183, -- Gauntlets of the Corrupted Conqueror
	78180, -- Shoulders of the Corrupted Conqueror
	78179, -- Chest of the Corrupted Protector
	78178, -- Gauntlets of the Corrupted Protector
	78177, -- Crown of the Corrupted Protector
	78176, -- Leggings of the Corrupted Protector
	78175, -- Shoulders of the Corrupted Protector
	78173, -- Gauntlets of the Corrupted Vanquisher
	78171, -- Leggings of the Corrupted Vanquisher
	71685, -- Leggings of the Fiery Protector
	71682, -- Helm of the Fiery Protector
	71677, -- Crown of the Fiery Conqueror
	71674, -- Mantle of the Fiery Vanquisher
	71673, -- Shoulders of the Fiery Vanquisher
	71670, -- Crown of the Fiery Vanquisher
	71669, -- Gauntlets of the Fiery Vanquisher
	67430, -- Gauntlets of the Forlorn Protector
	67429, -- Gauntlets of the Forlorn Conqueror
	67428, -- Leggings of the Forlorn Conqueror
	67427, -- Leggings of the Forlorn Protector
	65088, -- Shoulders of the Forlorn Conqueror
	65001, -- Crown of the Forlorn Conqueror
	64316, -- Mantle of the Forlorn Protector
	64314, -- Mantle of the Forlorn Vanquisher
	63683, -- Helm of the Forlorn Conqueror
	52340, -- Abyssal Clam
	47558, -- Regalia of the Grand Protector
	47557, -- Regalia of the Grand Conqueror
	46809, -- Bountiful Cookbook
	45660, -- Spaulders of the Wayward Protector
	45657, -- Mantle of the Wayward Protector
	45655, -- Legplates of the Wayward Vanquisher
	45654, -- Legplates of the Wayward Protector
	45653, -- Legplates of the Wayward Conqueror
	45649, -- Helm of the Wayward Vanquisher
	45646, -- Gloves of the Wayward Vanquisher
	45645, -- Gloves of the Wayward Protector
	45644, -- Gloves of the Wayward Conqueror
	45641, -- Gauntlets of the Wayward Conqueror
	45640, -- Crown of the Wayward Vanquisher
	45639, -- Crown of the Wayward Protector
	45638, -- Crown of the Wayward Conqueror
	45637, -- Chestguard of the Wayward Vanquisher
	45636, -- Chestguard of the Wayward Protector
	45635, -- Chestguard of the Wayward Conqueror
	45633, -- Breastplate of the Wayward Protector
	45632, -- Breastplate of the Wayward Conqueror
	45057, -- Wind-Up Train Wrecker
	44606, -- Toy Train Set
	40638, -- Mantle of the Lost Protector
	40636, -- Legplates of the Lost Vanquisher
	40633, -- Crown of the Lost Vanquisher
	40632, -- Crown of the Lost Protector
	40630, -- Gauntlets of the Lost Vanquisher
	40629, -- Gauntlets of the Lost Protector
	40627, -- Breastplate of the Lost Vanquisher
	40622, -- Spaulders of the Lost Conqueror
	40619, -- Leggings of the Lost Conqueror
	40617, -- Helm of the Lost Protector
	40613, -- Gloves of the Lost Conqueror
	40612, -- Chestguard of the Lost Vanquisher
	40611, -- Chestguard of the Lost Protector
	34858, -- Boots of the Forgotten Vanquisher
	34856, -- Boots of the Forgotten Conqueror
	34854, -- Belt of the Forgotten Protector
	34853, -- Belt of the Forgotten Conqueror
	34852, -- Bracers of the Forgotten Vanquisher
	34848, -- Bracers of the Forgotten Conqueror
	33154, -- Sinister Squashling
	32502, -- Fel Gland
	31101, -- Pauldrons of the Forgotten Conqueror
	31100, -- Leggings of the Forgotten Protector
	31099, -- Leggings of the Forgotten Vanquisher
	31097, -- Helm of the Forgotten Conqueror
	31095, -- Helm of the Forgotten Protector
	31092, -- Gloves of the Forgotten Conqueror
	31090, -- Chestguard of the Forgotten Vanquisher
	30247, -- Leggings of the Vanquished Hero
	30246, -- Leggings of the Vanquished Defender
	30245, -- Leggings of the Vanquished Champion
	30244, -- Helm of the Vanquished Hero
	30243, -- Helm of the Vanquished Defender
	30239, -- Gloves of the Vanquished Champion
	30236, -- Chestguard of the Vanquished Champion
	29765, -- Leggings of the Fallen Hero
	29763, -- Pauldrons of the Fallen Champion
	29762, -- Pauldrons of the Fallen Hero
	29760, -- Helm of the Fallen Champion
	29758, -- Gloves of the Fallen Defender
	29757, -- Gloves of the Fallen Champion
	29756, -- Gloves of the Fallen Hero
	24476, -- Jaggal Clam
	22371, -- Desecrated Gloves
	22370, -- Desecrated Belt
	22364, -- Desecrated Handguards
	22363, -- Desecrated Girdle
	22362, -- Desecrated Wristguards
	22360, -- Desecrated Headpiece
	22357, -- Desecrated Gauntlets
	22355, -- Desecrated Bracers
	22354, -- Desecrated Pauldrons
	22352, -- Desecrated Legplates
	21746, -- Lucky Red Envelope
	20236, -- Arathor Standard Care Package
	20233, -- Arathor Basic Care Package
	20231, -- Arathor Advanced Care Package
	20230, -- Defiler's Standard Care Package
	20229, -- Defiler's Basic Care Package
	19155, -- Outrider Standard Care Package
	19152, -- Sentinel Advanced Care Package
	19151, -- Sentinel Standard Care Package
	2034, -- Scholarly Robes
	2033, -- Ambassador's Boots
	2027, -- Scimitar
	2026, -- Rock Hammer
	212384, -- Restless Satchel of Drake's Awakened Crests
	211950, -- Lively Clutch of Wyrm's Awakened Crests
	210871, -- Greater Ember of Fyr'alath
	206030, -- Exquisitely Embroidered Banner
	206028, -- Chest of Gold
	205249, -- Pungent Niffen Incense
	205219, -- Broken Barter Boulder
	205213, -- Suspicious Mold
	205212, -- Marrow-Ripened Slime
	204990, -- Lava-Drenched Shadow Crystal
	204579, -- Condensed Necromantic Magic
	204577, -- Condensed Nature Magic
	204576, -- Condensed Shadow Magic
	204575, -- Condensed Earth Magic
	204559, -- Essence of Divination
	204383, -- Sack of Oddities
	204227, -- Everflowing Antifreeze
	204226, -- Blazehoof Ashes
	204225, -- Perfect Windfeather
	203222, -- Maruuk Surplus Bundle
	203220, -- Iskaara Surplus Bag
	203217, -- Dragonscale Surplus Crate
	202668, -- Sealed Spirit Scroll
	202371, -- Glowing Primalist Cache
	202163, -- Rumble Prize Box
	202142, -- Dragonbane Keep Strongbox
	200491, -- Nokhud Champion's Helm
	200490, -- Nokhud Reaver's Helm
	200489, -- Shikaar Scout's Visor
	199880, -- Tuskarr Leviathan's Hook
	199856, -- Rustic Tuskarr Trader's Pack
	199852, -- Rustic Fisherman's Pack
	199532, -- Grey Stocking Cap
	198899, -- Technique: Renewed Proto-Drake: Predator Pattern
	198675, -- Lava-Infused Seed
	197597, -- Windborne Velocidrake: Black Fur
	197592, -- Windborne Velocidrake: Spined Head
	197586, -- Windborne Velocidrake: Spiked Back
	197582, -- Windborne Velocidrake: White and Pink Armor
	197391, -- Renewed Proto-Drake: Bronze Scales
	197386, -- Renewed Proto-Drake: Spiked Jaw
	197381, -- Renewed Proto-Drake: Gradient Horns
	197363, -- Renewed Proto-Drake: Maned Crest
	197137, -- Highland Drake: Spined Nose
	197125, -- Highland Drake: Coiled Horns
	197122, -- Highland Drake: Heavy Horns
	197105, -- Highland Drake: Spined Chin
	197021, -- Cliffside Wylderdrake: Spiked Club Tail
	197010, -- Cliffside Wylderdrake: Red Scales
	197005, -- Cliffside Wylderdrake: Horned Nose
	196987, -- Cliffside Wylderdrake: Blonde Hair
	196983, -- Cliffside Wylderdrake: Maned Jaw
	196981, -- Cliffside Wylderdrake: Conical Head
	196977, -- Cliffside Wylderdrake: Split Head Horns
	196976, -- Cliffside Wylderdrake: Head Mane
	196975, -- Cliffside Wylderdrake: Head Fin
	196974, -- Cliffside Wylderdrake: Four-Horned Chin
	196973, -- Cliffside Wylderdrake: Dual Horned Chin
	196971, -- Cliffside Wylderdrake: Spiked Brow
	196969, -- Cliffside Wylderdrake: Finned Back
	196968, -- Cliffside Wylderdrake: Steel and Yellow Armor
	196964, -- Cliffside Wylderdrake: Gold and Black Armor
	196963, -- Cliffside Wylderdrake: Silver and Blue Armor
	196962, -- Cliffside Wylderdrake: Silver and Purple Armor
	196961, -- Cliffside Wylderdrake: Armor
	194702, -- Draconic Treatise on Enchanting
	194700, -- Draconic Treatise on Leatherworking
	194699, -- Draconic Treatise on Inscription
	194697, -- Draconic Treatise on Alchemy
	194521, -- Cliffside Wylderdrake
	194106, -- Highland Drake
	194099, -- Shikaar Hunting Horn
	191565, -- Ensemble: Blood Knight's Dedication
	190772, -- Ensemble: Vestments of the Nightmare Forest
	190759, -- Broker's Cloak
	189718, -- Pocopoc's Upgraded Core
	187575, -- Korthian Fishing Cache
	187100, -- Sterling Ornamental Mantle
	184522, -- Veiled Satchel of Cooperation
	184498, -- Ensemble: Chain of the Discordant
	184443, -- Ensemble: Notorious Gladiator's Plate Armor
	184442, -- Ensemble: Notorious Gladiator's Plate Armor
	184440, -- Ensemble: Notorious Gladiator's Mail Armor
	184439, -- Ensemble: Notorious Gladiator's Leather Armor
	184437, -- Ensemble: Notorious Gladiator's Cloth Armor
	184436, -- Ensemble: Notorious Gladiator's Cloth Armor
	184434, -- Ensemble: Sinister Gladiator's Plate Armor
	184433, -- Ensemble: Sinister Gladiator's Plate Armor
	184432, -- Ensemble: Sinister Gladiator's Mail Armor
	184430, -- Ensemble: Sinister Gladiator's Leather Armor
	184429, -- Ensemble: Sinister Gladiator's Leather Armor
	184428, -- Ensemble: Sinister Gladiator's Cloth Armor
	184427, -- Ensemble: Sinister Gladiator's Cloth Armor
	184423, -- Ensemble: Dread Gladiator's Mail Armor
	184422, -- Ensemble: Dread Gladiator's Leather Armor
	184421, -- Ensemble: Dread Gladiator's Leather Armor
	184419, -- Ensemble: Dread Gladiator's Cloth Armor
	184278, -- Royal Ring
	184277, -- Lion Emblem
	184276, -- Length of Light-Infused Chain
	184242, -- Burnt Totem
	184117, -- Ensemble: Winterborn Warbark
	184115, -- Ensemble: Winterborn Raiment
	184114, -- Ensemble: Winterborn Regalia
	184111, -- Ensemble: Conservator's Guise
	184110, -- Ensemble: Conservator's Warbark
	184048, -- Weapon Satchel of the Wild Hunt
	184047, -- Ascended Chest of Arms
	184046, -- Undying Army Weapon Cache
	183393, -- Memory of an Unbreakable Will
	183383, -- Memory of an Enduring Blow
	183382, -- Memory of a Battlelord
	183377, -- Memory of the Ymirjar
	183364, -- Memory of Sacrolash's Dark Strike
	183363, -- Memory of Azj'Aqir's Agony
	183359, -- Memory of Jonat
	183357, -- Memory of the Witch Doctor
	183343, -- Memory of the Deathly Shadows
	183342, -- Memory of Akaari's Soul Fragment
	183339, -- Memory of a Concealed Blunderbuss
	183337, -- Memory of the Zoldyck Insignia
	183335, -- Memory of the Doomblade
	183328, -- Memory of Talbadar
	183327, -- Memory of the Painbreaker Psalm
	183321, -- Memory of the Penitent One
	183320, -- Memory of the Kiss of Death
	183312, -- Memory of a Relentless Inquisitor
	183292, -- Memory of Clouded Focus
	183287, -- Memory of Charred Passions
	183280, -- Memory of Fragments of Ice
	183276, -- Memory of the Molten Sky
	183263, -- Memory of Poisonous Injectors
	183262, -- Memory of the Butcher's Bone Fragments
	183255, -- Memory of the Flamewaker
	183247, -- Memory of a Stable Phantasma Lure
	183236, -- Memory of Ursoc
	183230, -- Memory of the Apex Predator
	183219, -- Memory of Soul of Fire
	183217, -- Memory of my Darker Nature
	183195, -- Torghast Lurker
	183194, -- Maw Stalker
	183116, -- Hissing Deathroach
	182746, -- All-In-One Belt Repair Kit
	182640, -- Memory of a Reanimated Shambler
	182631, -- Memory of a Vampiric Aura
	182628, -- Memory of Bryndaor
	181821, -- Armored Plaguerot Tauralus
	180765, -- Eternal Phalynx of Purity
	180649, -- Wild Hunt Supplies
	180646, -- Supplies of the Undying Army
	180355, -- Ornate Pyx
	180206, -- Ensemble: Corrupted Gladiator's Plate Armor
	180204, -- Ensemble: Corrupted Gladiator's Leather Armor
	180199, -- Ensemble: Notorious Aspirant's Mail Armor
	180197, -- Ensemble: Notorious Aspirant's Leather Armor
	180196, -- Ensemble: Notorious Aspirant's Leather Armor
	180187, -- Ensemble: Sinister Aspirant's Cloth Armor
	180186, -- Ensemble: Sinister Aspirant's Cloth Armor
	180184, -- Ensemble: Dread Aspirant's Plate Armor
	180183, -- Ensemble: Dread Aspirant's Mail Armor
	180182, -- Ensemble: Dread Aspirant's Mail Armor
	180180, -- Ensemble: Dread Aspirant's Leather Armor
	180179, -- Ensemble: Dread Aspirant's Cloth Armor
	180178, -- Ensemble: Dread Aspirant's Cloth Armor
	180085, -- Kyrian Keepsake
	177035, -- Colored Liquid Set
	176443, -- Fleeting Frenzy Potion
	176331, -- Obscuring Essence Potion
	174484, -- Uldum Accord Supplies
	174483, -- Rajani Supplies
	174283, -- Stygian Stew
	171984, -- Ensemble: Battlegear of Valor
	171983, -- Ensemble: Dreadmist Raiment
	171982, -- Ensemble: The Elements
	171980, -- Ensemble: Vestments of the Devout
	171978, -- Ensemble: Magister's Regalia
	171977, -- Ensemble: Beaststalker Armor
	171209, -- Blooded Satchel
	170256, -- Shado-Pan Mercenary Kit
	170061, -- Rustbolt Supplies
	169939, -- Ankoan Supplies
	169896, -- Azeroth Mini: Pascal-K1N6
	169895, -- Azeroth Mini: Beastbot
	169876, -- Azeroth Mini: Sapphronetta
	169852, -- Azeroth Mini: Blastatron
	169851, -- Azeroth Mini: Cogstar
	169850, -- Azeroth Mini Pack: Mechagon
	169848, -- Azeroth Mini Pack: Bondo's Yard
	169846, -- Azeroth Mini: King Mechagon
	169845, -- Azeroth Mini: HK-8
	169844, -- Azeroth Mini: Overspark
	169842, -- Azeroth Mini: Roadtrogg
	169841, -- Azeroth Mini: Erazmin
	169840, -- Azeroth Mini: Gazlowe
	169838, -- Azeroth Mini: Starter Pack
	169796, -- Azeroth Mini Collection: Mechagon
	168419, -- Comfortable Rider's Barding
	168207, -- Plundered Anima Cell
	168060, -- Ensemble: Chainmail of the Timeless Hunt
	168059, -- Ensemble: Restless Dreambound Battlegear
	168058, -- Ensemble: Tranquil Spiritbind Regalia
	167892, -- Ensemble: Brawler's Garb
	167891, -- Ensemble: Brawler's Garb
	166300, -- 7th Legion Supplies
	166294, -- Storm's Wake Supplies
	166292, -- Zandalari Empire Supplies
	166282, -- Talanji's Expedition Supplies
	166245, -- Tortollan Seekers Supplies
	165871, -- Honorbound Equipment Cache
	162643, -- Toy Armor Set
	157831, -- Scuffed Krokul Cache
	157576, -- Ensemble: Crimson Sentinel Garb
	157574, -- Ensemble: Tundraspite Armor
	157573, -- Ensemble: Mindwrack Raiment
	156630, -- Relinquished Armor Set
	153214, -- Relinquished Ring
	153213, -- Relinquished Necklace
	153212, -- Relinquished Leggings
	153211, -- Relinquished Hood
	153210, -- Relinquished Gauntlets
	153208, -- Relinquished Chestguard
	153206, -- Relinquished Bracers
	153158, -- Unsullied Mail Bracers
	153157, -- Unsullied Plate Gauntlets
	153154, -- Unsullied Cloth Leggings
	153151, -- Unsullied Leather Tunic
	153149, -- Unsullied Mail Gloves
	153147, -- Unsullied Mail Coif
	153146, -- Unsullied Plate Greaves
	153145, -- Unsullied Leather Spaulders
	153144, -- Unsullied Cloth Slippers
	153143, -- Unsullied Plate Breastplate
	153142, -- Unsullied Leather Armbands
	153141, -- Unsullied Cloth Mitts
	153139, -- Unsullied Leather Headgear
	153136, -- Unsullied Leather Treads
	153068, -- Relinquished Storm Relic
	153063, -- Relinquished Frost Relic
	152973, -- Zephyr's Call
	152957, -- Army of the Light Insignia
	152923, -- Gleaming Footlocker
	152744, -- Unsullied Mail Girdle
	152743, -- Unsullied Plate Sabatons
	152741, -- Unsullied Mail Chestguard
	152738, -- Unsullied Cloth Cap
	152736, -- Unsullied Necklace
	152735, -- Unsullied Ring
	152244, -- Ensemble: Venerated Triumvirate Battleplate
	152242, -- Ensemble: Burnished Triumvirate Armor
	152108, -- Legionfall Chest
	152105, -- Nightfallen Cache
	152104, -- Highmountain Supplies
	152103, -- Dreamweaver Cache
	151844, -- Xenedar Armor Set
	151842, -- Krokul Armor Set
	151695, -- Ensemble: Timewarden's Plate
	151694, -- Ensemble: Epoch Sentinel's Mail
	151271, -- Horse Head Costume
	151270, -- Horse Tail Costume
	151269, -- Naxxy
	151184, -- Verdant Throwing Sphere
	151120, -- Ensemble: Righteous Battleplate
	151117, -- Ensemble: Mana-Etched Regalia
	151016, -- Fractured Necrolyte Skull
	150737, -- Abundant Order Resources Cache
	150271, -- Ensemble: Fierce Combatant's Silk Armor
	150270, -- Ensemble: Fierce Combatant's Silk Armor
	150269, -- Ensemble: Fierce Combatant's Scaled Armor
	150267, -- Ensemble: Fierce Combatant's Plate Armor
	150266, -- Ensemble: Fierce Combatant's Plate Armor
	150265, -- Ensemble: Fierce Combatant's Chain Armor
	150264, -- Ensemble: Fierce Combatant's Chain Armor
	150261, -- Ensemble: Fierce Combatant's Leather Armor
	150259, -- Ensemble: Fierce Combatant's Ironskin Armor
	150258, -- Ensemble: Fierce Combatant's Ironskin Armor
	150256, -- Ensemble: Fierce Combatant's Felweave Armor
	150255, -- Ensemble: Fierce Combatant's Felskin Armor
	150252, -- Ensemble: Fierce Combatant's Dreadplate Armor
	150251, -- Ensemble: Fierce Combatant's Dragonhide Armor
	150250, -- Ensemble: Fierce Combatant's Dragonhide Armor
	150248, -- Ensemble: Fierce Combatant's Ringmail Armor
	149501, -- Ensemble: Fierce Gladiator's Silk Armor
	149500, -- Ensemble: Fierce Gladiator's Silk Armor
	149497, -- Ensemble: Fierce Gladiator's Satin Armor
	149495, -- Ensemble: Fierce Gladiator's Ringmail Armor
	149493, -- Ensemble: Fierce Gladiator's Plate Armor
	149492, -- Ensemble: Fierce Gladiator's Plate Armor
	149489, -- Ensemble: Fierce Gladiator's Ironskin Armor
	149488, -- Ensemble: Fierce Gladiator's Ironskin Armor
	149487, -- Ensemble: Fierce Gladiator's Felweave Armor
	149486, -- Ensemble: Fierce Gladiator's Felweave Armor
	149485, -- Ensemble: Fierce Gladiator's Felskin Armor
	149484, -- Ensemble: Fierce Gladiator's Felskin Armor
	149482, -- Ensemble: Fierce Gladiator's Dreadplate Armor
	149481, -- Ensemble: Fierce Gladiator's Dragonhide Armor
	149480, -- Ensemble: Fierce Gladiator's Dragonhide Armor
	149479, -- Ensemble: Fierce Gladiator's Chain Armor
	149478, -- Ensemble: Fierce Gladiator's Chain Armor
	149477, -- Ensemble: Elite Fierce Gladiator's Silk Armor
	149474, -- Ensemble: Elite Fierce Gladiator's Scaled Armor
	149472, -- Ensemble: Elite Fierce Gladiator's Satin Armor
	149467, -- Ensemble: Elite Fierce Gladiator's Leather Armor
	149465, -- Ensemble: Elite Fierce Gladiator's Ironskin Armor
	149464, -- Ensemble: Elite Fierce Gladiator's Ironskin Armor
	149461, -- Ensemble: Elite Fierce Gladiator's Felskin Armor
	149459, -- Ensemble: Elite Fierce Gladiator's Dreadplate Armor
	149458, -- Ensemble: Elite Fierce Gladiator's Dreadplate Armor
	149457, -- Ensemble: Elite Fierce Gladiator's Dragonhide Armor
	149455, -- Ensemble: Elite Fierce Gladiator's Chain Armor
	147729, -- Netherchunk
	147708, -- Legion Invasion Simulator
	147696, -- Ensemble: Cruel Combatant's Silk Armor
	147695, -- Ensemble: Cruel Combatant's Silk Armor
	147694, -- Ensemble: Cruel Combatant's Scaled Armor
	147692, -- Ensemble: Cruel Combatant's Plate Armor
	147691, -- Ensemble: Cruel Combatant's Plate Armor
	147690, -- Ensemble: Cruel Combatant's Chain Armor
	147689, -- Ensemble: Cruel Combatant's Chain Armor
	147688, -- Ensemble: Cruel Combatant's Satin Armor
	147686, -- Ensemble: Cruel Combatant's Leather Armor
	147684, -- Ensemble: Cruel Combatant's Ironskin Armor
	147681, -- Ensemble: Cruel Combatant's Felweave Armor
	147680, -- Ensemble: Cruel Combatant's Felskin Armor
	147677, -- Ensemble: Cruel Combatant's Dreadplate Armor
	147676, -- Ensemble: Cruel Combatant's Dragonhide Armor
	147675, -- Ensemble: Cruel Combatant's Dragonhide Armor
	147673, -- Ensemble: Cruel Combatant's Ringmail Armor
	147668, -- Ensemble: Cruel Gladiator's Silk Armor
	147667, -- Ensemble: Cruel Gladiator's Silk Armor
	147666, -- Ensemble: Cruel Gladiator's Scaled Armor
	147665, -- Ensemble: Cruel Gladiator's Scaled Armor
	147664, -- Ensemble: Cruel Gladiator's Satin Armor
	147663, -- Ensemble: Cruel Gladiator's Satin Armor
	147662, -- Ensemble: Cruel Gladiator's Ringmail Armor
	147658, -- Ensemble: Cruel Gladiator's Leather Armor
	147657, -- Ensemble: Cruel Gladiator's Leather Armor
	147656, -- Ensemble: Cruel Gladiator's Ironskin Armor
	147652, -- Ensemble: Cruel Gladiator's Felskin Armor
	147651, -- Ensemble: Cruel Gladiator's Felskin Armor
	147649, -- Ensemble: Cruel Gladiator's Dreadplate Armor
	147648, -- Ensemble: Cruel Gladiator's Dragonhide Armor
	147647, -- Ensemble: Cruel Gladiator's Dragonhide Armor
	147644, -- Ensemble: Elite Cruel Gladiator's Silk Armor
	147643, -- Ensemble: Elite Cruel Gladiator's Silk Armor
	147641, -- Ensemble: Elite Cruel Gladiator's Scaled Armor
	147639, -- Ensemble: Elite Cruel Gladiator's Satin Armor
	147638, -- Ensemble: Elite Cruel Gladiator's Ringmail Armor
	147636, -- Ensemble: Elite Cruel Gladiator's Plate Armor
	147629, -- Ensemble: Elite Cruel Gladiator's Felweave Armor
	147628, -- Ensemble: Elite Cruel Gladiator's Felskin Armor
	147626, -- Ensemble: Elite Cruel Gladiator's Dreadplate Armor
	147623, -- Ensemble: Elite Cruel Gladiator's Dragonhide Armor
	147622, -- Ensemble: Elite Cruel Gladiator's Chain Armor
	147416, -- Arcane Tablet of Falanaar
	147350, -- Invincible Armor Set
	147348, -- Bulky Armor Set
	147223, -- Dauntless Trinket
	147219, -- Dauntless Girdle
	147217, -- Dauntless Leggings
	147216, -- Dauntless Hood
	147215, -- Dauntless Gauntlets
	147214, -- Dauntless Treads
	147213, -- Dauntless Tunic
	146950, -- Legionfall Insignia
	146949, -- Legionfall Insignia
	146946, -- Nightfallen Insignia
	146945, -- Wardens Insignia
	146944, -- Highmountain Tribe Insignia
	146943, -- Court of Farondis Insignia
	146941, -- Valarjar Insignia
	146636, -- Ensemble: Vengeful Gladiator's Scaled Armor
	146634, -- Ensemble: Vengeful Gladiator's Ringmail Armor
	146633, -- Ensemble: Vengeful Gladiator's Plate Armor
	146629, -- Ensemble: Vengeful Gladiator's Dragonhide Armor
	146625, -- Ensemble: Merciless Gladiator's Satin Armor
	146622, -- Ensemble: Merciless Gladiator's Leather Armor
	146621, -- Ensemble: Merciless Gladiator's Felweave Armor
	146619, -- Ensemble: Merciless Gladiator's Dragonhide Armor
	146618, -- Ensemble: Merciless Gladiator's Chain Armor
	146617, -- Ensemble: Gladiator's Silk Armor
	146615, -- Ensemble: Gladiator's Satin Armor
	146613, -- Ensemble: Gladiator's Plate Armor
	146612, -- Ensemble: Gladiator's Leather Armor
	146611, -- Ensemble: Gladiator's Felweave Armor
	146609, -- Ensemble: Gladiator's Dragonhide Armor
	146608, -- Ensemble: Gladiator's Chain Armor
	146606, -- Ensemble: Brutal Gladiator's Scaled Armor
	146605, -- Ensemble: Brutal Gladiator's Satin Armor
	146603, -- Ensemble: Brutal Gladiator's Plate Armor
	146601, -- Ensemble: Brutal Gladiator's Felweave Armor
	146599, -- Ensemble: Brutal Gladiator's Dragonhide Armor
	146598, -- Ensemble: Brutal Gladiator's Chain Armor
	146597, -- Ensemble: Wrathful Gladiator's Silk Armor
	146596, -- Ensemble: Wrathful Gladiator's Scaled Armor
	146595, -- Ensemble: Wrathful Gladiator's Satin Armor
	146594, -- Ensemble: Wrathful Gladiator's Ringmail Armor
	146593, -- Ensemble: Wrathful Gladiator's Plate Armor
	146592, -- Ensemble: Wrathful Gladiator's Leather Armor
	146590, -- Ensemble: Wrathful Gladiator's Dreadplate Armor
	146589, -- Ensemble: Wrathful Gladiator's Dragonhide Armor
	146587, -- Ensemble: Savage Gladiator's Silk Armor
	146586, -- Ensemble: Savage Gladiator's Scaled Armor
	146585, -- Ensemble: Savage Gladiator's Satin Armor
	146584, -- Ensemble: Savage Gladiator's Ringmail Armor
	146583, -- Ensemble: Savage Gladiator's Plate Armor
	146579, -- Ensemble: Savage Gladiator's Dragonhide Armor
	146578, -- Ensemble: Savage Gladiator's Chain Armor
	146576, -- Ensemble: Relentless Gladiator's Scaled Armor
	146575, -- Ensemble: Relentless Gladiator's Satin Armor
	146571, -- Ensemble: Relentless Gladiator's Felweave Armor
	146569, -- Ensemble: Relentless Gladiator's Dragonhide Armor
	146568, -- Ensemble: Relentless Gladiator's Chain Armor
	146567, -- Ensemble: Hateful Gladiator's Silk Armor
	146566, -- Ensemble: Hateful Gladiator's Scaled Armor
	146565, -- Ensemble: Hateful Gladiator's Satin Armor
	146564, -- Ensemble: Hateful Gladiator's Ringmail Armor
	146563, -- Ensemble: Hateful Gladiator's Plate Armor
	146560, -- Ensemble: Hateful Gladiator's Dreadplate Armor
	146558, -- Ensemble: Hateful Gladiator's Chain Armor
	146555, -- Ensemble: Furious Gladiator's Satin Armor
	146554, -- Ensemble: Furious Gladiator's Ringmail Armor
	146552, -- Ensemble: Furious Gladiator's Leather Armor
	146550, -- Ensemble: Furious Gladiator's Dreadplate Armor
	146549, -- Ensemble: Furious Gladiator's Dragonhide Armor
	146548, -- Ensemble: Furious Gladiator's Chain Armor
	146545, -- Ensemble: Deadly Gladiator's Satin Armor
	146542, -- Ensemble: Deadly Gladiator's Leather Armor
	146539, -- Ensemble: Deadly Gladiator's Dragonhide Armor
	146538, -- Ensemble: Deadly Gladiator's Chain Armor
	146537, -- Ensemble: Vicious Gladiator's Silk Armor
	146535, -- Ensemble: Vicious Gladiator's Scaled Armor
	146531, -- Ensemble: Vicious Gladiator's Ringmail Armor
	146529, -- Ensemble: Vicious Gladiator's Plate Armor
	146527, -- Ensemble: Vicious Gladiator's Leather Armor
	146525, -- Ensemble: Vicious Gladiator's Felweave Armor
	146523, -- Ensemble: Vicious Gladiator's Dreadplate Armor
	146519, -- Ensemble: Vicious Gladiator's Chain Armor
	146511, -- Ensemble: Ruthless Gladiator's Ringmail Armor
	146501, -- Ensemble: Ruthless Gladiator's Dragonhide Armor
	146499, -- Ensemble: Ruthless Gladiator's Chain Armor
	146457, -- Ensemble: Cataclysmic Gladiator's Silk Armor
	146455, -- Ensemble: Cataclysmic Gladiator's Scaled Armor
	146451, -- Ensemble: Cataclysmic Gladiator's Ringmail Armor
	146449, -- Ensemble: Cataclysmic Gladiator's Plate Armor
	146439, -- Ensemble: Cataclysmic Gladiator's Chain Armor
	146435, -- Ensemble: Bloodthirsty Gladiator's Scaled Armor
	146433, -- Ensemble: Bloodthirsty Gladiator's Satin Armor
	146431, -- Ensemble: Bloodthirsty Gladiator's Ringmail Armor
	146427, -- Ensemble: Bloodthirsty Gladiator's Leather Armor
	146421, -- Ensemble: Bloodthirsty Gladiator's Dragonhide Armor
	146419, -- Ensemble: Bloodthirsty Gladiator's Chain Armor
	146271, -- Ensemble: Elite Vindictive Gladiator's Felskin Armor
	146270, -- Ensemble: Elite Vindictive Gladiator's Felskin Armor
	146263, -- Ensemble: Vindictive Gladiator's Felskin Armor
	146237, -- Ensemble: Elite Vindictive Gladiator's Satin Armor
	146236, -- Ensemble: Elite Vindictive Gladiator's Satin Armor
	146234, -- Ensemble: Elite Vindictive Gladiator's Silk Armor
	146233, -- Ensemble: Elite Vindictive Gladiator's Leather Armor
	146231, -- Ensemble: Elite Vindictive Gladiator's Ironskin Armor
	146228, -- Ensemble: Elite Vindictive Gladiator's Dragonhide Armor
	146227, -- Ensemble: Elite Vindictive Gladiator's Chain Armor
	146223, -- Ensemble: Elite Vindictive Gladiator's Scaled Armor
	146221, -- Ensemble: Elite Vindictive Gladiator's Dreadplate Armor
	146220, -- Ensemble: Elite Vindictive Gladiator's Dreadplate Armor
	146219, -- Ensemble: Elite Vindictive Gladiator's Plate Armor
	146218, -- Ensemble: Elite Vindictive Gladiator's Plate Armor
	146172, -- Ensemble: Vindictive Combatant's Leather Armor
	146170, -- Ensemble: Vindictive Combatant's Ironskin Armor
	146169, -- Ensemble: Vindictive Combatant's Dragonhide Armor
	146168, -- Ensemble: Vindictive Combatant's Dragonhide Armor
	146167, -- Ensemble: Vindictive Combatant's Scaled Armor
	146166, -- Ensemble: Vindictive Combatant's Scaled Armor
	146133, -- Ensemble: Vindictive Gladiator's Dreadplate Armor
	143942, -- Commendation of the Order of the Cloud Serpent
	143734, -- Ancient Mana Crystal Cluster
	143511, -- Ensemble: Garb of the Chosen Dead
	140997, -- Alliance Strongbox
	140403, -- Lylandre's Fel Crystal
	139786, -- Ancient Mana Crystal
	139167, -- Ensemble: Felforged Plate Armor
	138717, -- Ensemble: Dreadful Gladiator's Ringmail Armor
	138686, -- Ensemble: Tyrannical Gladiator's Scaled Armor
	138685, -- Ensemble: Tyrannical Gladiator's Scaled Armor
	138678, -- Ensemble: Grievous Gladiator's Satin Armor
	138676, -- Ensemble: Grievous Gladiator's Silk Armor
	138672, -- Ensemble: Grievous Gladiator's Ironskin Armor
	138665, -- Ensemble: Grievous Gladiator's Ringmail Armor
	138658, -- Ensemble: Prideful Gladiator's Felweave Armor
	138654, -- Ensemble: Prideful Gladiator's Silk Armor
	138651, -- Ensemble: Prideful Gladiator's Leather Armor
	138648, -- Ensemble: Prideful Gladiator's Dragonhide Armor
	138614, -- Ensemble: Primal Combatant's Dreadplate Armor
	138595, -- Ensemble: Warmongering Combatant's Ironskin Armor
	138577, -- Ensemble: Primal Combatant's Ringmail Armor
	138563, -- Ensemble: Primal Gladiator's Chain Armor
	138558, -- Ensemble: Primal Gladiator's Dreadplate Armor
	138548, -- Ensemble: Wild Combatant's Chain Armor
	138546, -- Ensemble: Wild Combatant's Ringmail Armor
	138545, -- Ensemble: Wild Combatant's Ringmail Armor
	138544, -- Ensemble: Warmongering Combatant's Felweave Armor
	138542, -- Ensemble: Warmongering Combatant's Satin Armor
	138540, -- Ensemble: Warmongering Combatant's Silk Armor
	138538, -- Ensemble: Warmongering Combatant's Chain Armor
	138504, -- Ensemble: Warmongering Gladiator's Ironskin Armor
	138491, -- Ensemble: Warmongering Gladiator's Plate Armor
	137675, -- Transmog Set Test
	127970, -- Badge of Hellfire's Protector
	122554, -- Schematic: Precision Scope Tuning Kit
	122236, -- Music Roll: Totems of the Grizzlemaw
	122217, -- Music Roll: Silvermoon
	120302, -- Weapon Enhancement Token
	120244, -- Leggings of the Iron Conqueror
	120242, -- Chest of the Iron Conqueror
	120237, -- Chest of the Iron Protector
	120226, -- Shoulders of the Iron Protector
	118531, -- Cache of Highmaul Treasures
	116890, -- "Santo's Sun" Contender's Costume
	116196, -- Spirit Lodge, Level 2
	116118, -- Surplus Auchenai Weaponry
	114094, -- Tormented Bracers
	111991, -- The Forge, Level 3
	111989, -- The Tannery, Level 3
	111983, -- Storehouse, Level 3
	111930, -- Alchemy Lab, Level 3
	111387, -- The Joy of Draenor Cooking
	109577, -- Herb Garden, Level 2
	109256, -- Engineering Works, Level 2
	105864, -- Essence of the Cursed Conqueror
	105863, -- Essence of the Cursed Protector
	105859, -- Essence of the Cursed Vanquisher
	104013, -- Timeless Cloth Armor Cache
	99754, -- Shoulders of the Cursed Vanquisher
	99751, -- Leggings of the Cursed Vanquisher
	99750, -- Helm of the Cursed Protector
	99748, -- Helm of the Cursed Vanquisher
	99747, -- Gauntlets of the Cursed Protector
	99745, -- Gauntlets of the Cursed Vanquisher
	99743, -- Chest of the Cursed Conqueror
	99742, -- Chest of the Cursed Vanquisher
	99726, -- Leggings of the Cursed Vanquisher
	99692, -- Gauntlets of the Cursed Protector
	99685, -- Shoulders of the Cursed Vanquisher
	99672, -- Helm of the Cursed Conqueror
	96623, -- Helm of the Crackling Vanquisher
	96601, -- Gauntlets of the Crackling Protector
	96599, -- Gauntlets of the Crackling Vanquisher
	96566, -- Chest of the Crackling Vanquisher
	95881, -- Helm of the Crackling Protector
	89263, -- Shoulders of the Shadowy Protector
	89258, -- Helm of the Shadowy Vanquisher
	89251, -- Chest of the Shadowy Protector
	89247, -- Shoulders of the Shadowy Protector
	71679, -- Chest of the Fiery Conqueror
	46810, -- Bountiful Cookbook
	22366, -- Desecrated Leggings
	22361, -- Desecrated Spaulders
	-- 194841, -- itemName_NOCOLOR
	197373, -- itemName_NOCOLOR
	-- 194845, -- itemName_NOCOLOR
	129036, -- itemName_NOCOLOR
	188176, -- itemName_NOCOLOR
	194842, -- itemName_NOCOLOR
	197119, -- itemName_NOCOLOR
	183414, -- itemName_NOCOLOR
	-- 194844, -- itemName_NOCOLOR
	129098, -- itemName_NOCOLOR
	-- 194837, -- itemName_NOCOLOR
	139884, -- itemName_NOCOLOR
	146487, -- itemName_NOCOLOR
	177034, -- itemName_NOCOLOR
	129097, -- itemName_NOCOLOR
	183415, -- itemName_NOCOLOR
	-- 194840, -- itemName_NOCOLOR
	196990, -- itemName_NOCOLOR
	-- 194836, -- itemName_NOCOLOR
	183411, -- itemName_NOCOLOR
	197600, -- itemName_NOCOLOR
	194843, -- itemName_NOCOLOR
	-- 194839, -- itemName_NOCOLOR
	183413, -- itemName_NOCOLOR
}
E.Octo_Table.OctoTable_itemID_ItemsUsable_Pets = {
	4401, 8485, 8486, 8487, 8489, 8490, 8491, 8492, 8494, 8495, 8496, 8497,
	8498, 8499, 8500, 8501, 10360, 10361, 10392, 10393, 10394, 10398, 10822,
	11023, 11026, 11110, 11474, 11825, 11826, 12264, 12529, 13582, 13583,
	13584, 15996, 20371, 20769, 21277, 21301, 21305, 21308, 21309, 22235,
	22780, 22781, 23002, 23007, 23015, 23083, 23712, 23713, 27445, 29363,
	29901, 29902, 29904, 29953, 29956, 29957, 29958, 29960, 30360, 31760,
	32498, 32588, 32616, 32617, 32622, 33154, 33818, 33993, 34425, 34478,
	34492, 34493, 34518, 34519, 34535, 34955, 35227, 35348, 35349, 35350,
	35504, 37297, 37460, 38050, 38628, 38658, 39286, 39656, 39883, 39898,
	39899, 39973, 41133, 43698, 44721, 44723, 44738, 44794, 44810, 44819,
	44820, 44822, 44965, 44970, 44971, 44973, 44974, 44980, 44982, 44983,
	44984, 44998, 45002, 45022, 45057, 45606, 46325, 46398, 46544, 46545,
	46820, 46821, 46831, 46892, 48112, 48114, 48116, 48118, 48120, 48122,
	48124, 48126, 48527, 49287, 49343, 49646, 49662, 49663, 49664, 49665,
	49693, 49912, 50446, 53641, 54436, 54537, 54810, 54847, 56806, 59597,
	60216, 60847, 60869, 60955, 61387, 62540, 63138, 63355, 63398, 64372,
	64403, 64494, 64996, 65361, 65362, 65363, 65364, 65661, 65662, 66067,
	66073, 66076, 66080, 67128, 67274, 67275, 67282, 67418, 68384, 68385,
	68618, 68619, 68673, 68833, 68840, 68841, 69239, 69251, 69648, 69821,
	69824, 69847, 69992, 70099, 70140, 70160, 70908, 71033, 71076, 71137,
	71387, 71624, 71631, 71726, 72045, 72068, 72134, 72153, 73764, 73765,
	73797, 73903, 73905, 73953, 74610, 74611, 74981, 78916, 79744, 80008,
	82774, 82775, 84105, 85220, 85222, 85447, 85497, 85513, 85578, 85871,
	86562, 86563, 86564, 87526, 88148, 89139, 89587, 89640, 89641, 89736,
	90173, 90177, 90898, 90900, 90953, 91040, 91086, 92707, 92798, 92799,
	92800, 92960, 93025, 93029, 93031, 93033, 93034, 93035, 93037, 93038,
	93039, 93040, 93041, 93669, 94025, 94124, 94125, 94126, 94152, 94190,
	94191, 94207, 94208, 94209, 94210, 94573, 94574, 94595, 94903, 94932,
	94933, 94934, 94935, 95422, 95423, 95424, 97549, 97550, 97551, 97552,
	97554, 97555, 97557, 97821, 97959, 97960, 97961, 98550, 100905, 101426,
	101570, 101771, 102145, 102146, 102147, 103637, 103670, 104156, 104157,
	104158, 104159, 104160, 104161, 104162, 104163, 104164, 104165, 104166,
	104167, 104168, 104169, 104202, 104295, 104307, 104317, 104332, 106244,
	106256, 109014, 110684, 110721, 111402, 111660, 112057, 112108, 112699,
	113216, 113258, 113554, 113558, 114834, 114919, 114968, 115301, 115483,
	116062, 116064, 116258, 116402, 116403, 116756, 116801, 116804, 116815,
	117354, 117380, 117404, 117528, 117564, 118101, 118104, 118105, 118106,
	118107, 118207, 118516, 118517, 118574, 118577, 118578, 118595, 118675,
	118697, 118709, 118741, 118919, 118921, 118923, 119141, 119142, 119143,
	119146, 119148, 119170, 119328, 119431, 120050, 120121, 120309, 122104,
	122107, 122108, 122109, 122110, 122111, 122112, 122114, 122115, 122116,
	122125, 122532, 122533, 122535, 126925, 127701, 127703, 127704, 127705,
	127748, 127749, 127751, 127753, 127754, 127868, 128309, 128423, 128424,
	128426, 128427, 128477, 128478, 128533, 128534, 128535, 128770, 129178,
	129208, 129216, 129217, 129218, 129362, 129760, 129958, 129960, 129961,
	130154, 130166, 130167, 132519, 134047, 136898, 136900, 136901, 136903,
	136904, 136905, 136908, 136910, 136911, 136920, 136921, 136922, 136923,
	136924, 136925, 137298, 137608, 138810, 139775, 139776, 139789, 139791,
	140261, 140274, 140320, 140323, 140670, 140671, 140672, 140741, 140934,
	141348, 141530, 141532, 141893, 141895, 142084, 142085, 142087, 142092,
	142093, 142094, 142095, 142096, 142097, 142098, 142099, 142100, 142223,
	142379, 142380, 142448, 143679, 143754, 143755, 143756, 143953, 143954,
	144394, 146953, 147361, 147539, 147541, 147542, 147543, 147841, 147900,
	150739, 150741, 150742, 151269, 151482, 151569, 151633, 151638, 151645,
	151828, 151829, 152555, 152878, 152963, 152966, 152967, 152968, 152969,
	152972, 152973, 152974, 152975, 152977, 152978, 152980, 152981, 153026,
	153027, 153045, 153054, 153055, 153057, 153191, 153195, 153252, 153541,
	156721, 156851, 158077, 158464, 160324, 160587, 160588, 160702, 160704,
	160708, 160831, 160847, 161016, 161081, 161089, 161214, 162578, 163218,
	163220, 163244, 163489, 163490, 163491, 163492, 163493, 163494, 163495,
	163496, 163499, 163500, 163501, 163502, 163503, 163504, 163505, 163506,
	163508, 163512, 163513, 163514, 163515, 163555, 163560, 163568, 163650,
	163652, 163684, 163690, 163711, 163776, 163778, 163779, 163797, 163798,
	163799, 163800, 163801, 163802, 163805, 163807, 163808, 163812, 163816,
	163817, 163821, 163823, 163824, 163859, 163860, 163861, 163975, 164969,
	164971, 165845, 165848, 165849, 165857, 165894, 165907, 166282, 166345,
	166346, 166347, 166452, 166453, 166455, 166491, 166492, 166493, 166498,
	166499, 166500, 166528, 166715, 166716, 166723, 166779, 167011, 167047,
	167048, 167049, 167051, 167052, 167054, 167056, 167057, 167804, 167805,
	167806, 167808, 167810, 169205, 169322, 169348, 169351, 169353, 169354,
	169356, 169357, 169359, 169361, 169362, 169363, 169364, 169366, 169367,
	169368, 169369, 169370, 169371, 169373, 169374, 169375, 169376, 169377,
	169378, 169379, 169381, 169382, 169383, 169384, 169385, 169392, 169393,
	169396, 169670, 169676, 169678, 169879, 169886, 170072, 170102, 172016,
	172491, 172492, 173296, 173949, 173950, 173991, 173993, 174447, 174448,
	174452, 174456, 174461, 174473, 174474, 174475, 174476, 174477, 174478,
	174479, 174480, 174481, 174483, 174484, 174828, 174829, 174995, 175049,
	175114, 178533, 180034, 180208, 180584, 180585, 180586, 180587, 180589,
	180592, 180593, 180602, 180603, 180628, 180630, 180631, 180633, 180634,
	180635, 180636, 180637, 180638, 180640, 180641, 180642, 180644, 180645,
	180646, 180649, 180812, 180814, 180815, 180856, 180857, 180859, 180866,
	180869, 180871, 180872, 181164, 181168, 181172, 181262, 181265, 181266,
	181267, 181268, 181269, 181270, 181271, 181272, 181282, 181283, 181315,
	181555, 182606, 182661, 182662, 182663, 182664, 182671, 182674, 182683,
	183114, 183115, 183116, 183117, 183191, 183192, 183193, 183194, 183195,
	183196, 183395, 183407, 183408, 183410, 183412, 183515, 183601, 183621,
	183855, 184221, 184350, 184395, 184397, 184398, 184399, 184400, 184401,
	184461, 184507, 184508, 184512, 184867, 185919, 185992, 186188, 186191,
	186449, 186534, 186535, 186536, 186537, 186539, 186540, 186543, 186544,
	186548, 186549, 186550, 186551, 186553, 186554, 186555, 186556, 186557,
	186558, 186559, 186564, 186973, 187075, 187713, 187733, 187734, 187735,
	187787, 187795, 187798, 187803, 187928, 188679, 189363, 189365, 189366,
	189367, 189368, 189369, 189370, 189371, 189372, 189373, 189374, 189375,
	189376, 189377, 189378, 189379, 189380, 189381, 189382, 189585, 190175,
	190176, 190586, 190601, 190603, 190604, 190607, 190608, 191039, 191126,
	191886, 191915, 191930, 191932, 191936, 191941, 191946, 192459, 193066,
	193071, 193225, 193235, 193363, 193364, 193373, 193374, 193484, 193571,
	193572, 193618, 193619, 193834, 193835, 193837, 193850, 193851, 193852,
	193853, 193854, 193855, 193885, 193886, 193887, 193888, 193889, 193908,
	194098, 198622, 198725, 198726, 199109, 199172, 199175, 199326, 199688,
	199757, 199758, 199916, 200114, 200173, 200183, 200255, 200260, 200263,
	200276, 200290, 200479, 200519, 200872, 200874, 200927, 200930, 201260,
	201261, 201262, 201265, 201296, 201297, 201298, 201299, 201441, 201463,
	201703, 201707, 201838, 202085, 202255, 202407, 202411, 202412, 202413,
	204079, 204183, 204383, 204894, 205002, 205003, 205004, 205009, 205010,
	205017, 205018, 205021, 205024, 205026, 205032, 205035, 205037, 205050,
	205051, 205052, 205114, 205118, 205119, 205120, 205121, 205122, 205123,
	205147, 205151, 205152, 205154, 205159, 205160, 205162, 205165, 205231,
	205232, 205937, 206018, 206040, 206174, 206682, 206758, 206763, 206971,
	206973, 206978, 206979, 207019, 207962, 208008, 208009, 208010, 208011,
	208012, 208013, 208045, 208138, 208151, 208543, 208850, 210347, 210570,
	210571, 210651, 210690, 210691, 210692, 210870, 211271,
}
E.Octo_Table.OctoTable_itemID_ItemsUsable_Toys = {
	1973, 13379, 17712, 17716, 18660, 18984, 18986, 21540, 23767, 30542,
	30544, 30690, 32542, 32566, 32782, 33079, 33219, 33223, 33927, 34480,
	34499, 34686, 35227, 35275, 36862, 36863, 37254, 37460, 37710, 38301,
	38578, 40727, 40768, 40895, 43499, 43824, 44430, 44606, 44718, 44719,
	44820, 45011, 45013, 45014, 45015, 45016, 45017, 45018, 45019, 45020,
	45021, 45057, 45063, 45984, 46007, 46709, 46780, 46843, 48933, 49703,
	49704, 50471, 52201, 52253, 53057, 54212, 54343, 54437, 54438, 54452,
	54537, 54651, 54653, 60854, 63141, 63269, 64358, 64361, 64373, 64383,
	64456, 64481, 64482, 64488, 64646, 64651, 64881, 64997, 66888, 67097,
	68806, 69215, 69227, 69775, 69776, 69777, 69895, 69896, 70159, 70161,
	70722, 71137, 71259, 71628, 72159, 72161, 75042, 79769, 80822, 82467,
	85500, 85973, 86565, 86568, 86571, 86573, 86575, 86578, 86581, 86582,
	86583, 86584, 86586, 86588, 86589, 86590, 86593, 86594, 86596, 87214,
	87215, 87528, 88370, 88375, 88377, 88381, 88385, 88387, 88417, 88531,
	88566, 88579, 88580, 88584, 88589, 88801, 88802, 89139, 89205, 89222,
	89614, 89869, 89999, 90000, 90067, 90175, 90427, 90883, 90888, 90899,
	91904, 92738, 93672, 95567, 95568, 95589, 95590, 97919, 97921, 97942,
	97994, 98132, 98136, 98552, 101571, 102467, 103685, 104262, 104294,
	104302, 104309, 104318, 104323, 104324, 104329, 104331, 105898, 108631,
	108632, 108633, 108634, 108635, 108735, 108738, 108739, 108743, 108745,
	109167, 109183, 109739, 110560, 111476, 111821, 112059, 112324, 113096,
	113258, 113375, 113540, 113542, 113543, 113570, 113631, 113670, 114227,
	115468, 115472, 115501, 115503, 115505, 115506, 116067, 116113, 116115,
	116120, 116122, 116125, 116139, 116396, 116400, 116435, 116440, 116456,
	116651, 116689, 116690, 116691, 116692, 116757, 116758, 116763, 116856,
	116888, 116889, 116890, 116891, 117550, 117569, 117573, 118191, 118193,
	118221, 118222, 118224, 118244, 118427, 118706, 118716, 118935, 118937,
	118938, 119001, 119003, 119039, 119083, 119092, 119093, 119134, 119144,
	119145, 119160, 119163, 119178, 119180, 119182, 119210, 119211, 119212,
	119215, 119217, 119218, 119219, 119220, 119221, 119421, 119432, 120142,
	120276, 120857, 122117, 122119, 122120, 122121, 122122, 122123, 122126,
	122129, 122283, 122293, 122298, 122304, 122661, 122674, 122681, 122700,
	123851, 126931, 127394, 127395, 127652, 127655, 127659, 127666, 127668,
	127669, 127670, 127695, 127696, 127707, 127709, 127766, 127859, 127864,
	128223, 128310, 128328, 128462, 128471, 128536, 128636, 128776, 128794,
	128807, 129045, 129055, 129057, 129093, 129111, 129113, 129149, 129165,
	129211, 129279, 129367, 129926, 129929, 129938, 129952, 129956, 129958,
	129960, 129961, 129965, 130102, 130147, 130151, 130157, 130158, 130169,
	130170, 130171, 130191, 130194, 130199, 130209, 130214, 130232, 130249,
	130251, 130254, 131724, 131811, 131812, 131814, 131900, 131933, 132518,
	133511, 133542, 133997, 133998, 134004, 134007, 134019, 134020, 134021,
	134022, 134023, 134024, 134026, 134031, 134032, 134034, 134831, 136362,
	136846, 136849, 136855, 136927, 136928, 136934, 136935, 136937, 137294,
	137663, 138202, 138415, 138490, 138873, 138876, 138878, 138900, 139337,
	139587, 139773, 140160, 140192, 140231, 140309, 140314, 140324, 140325,
	140336, 140363, 140632, 140779, 140780, 140786, 141069, 141296, 141297,
	141298, 141299, 141300, 141301, 141306, 141331, 141649, 141862, 141879,
	142265, 142341, 142452, 142494, 142495, 142496, 142497, 142528, 142529,
	142530, 142531, 142532, 142536, 142542, 143534, 143543, 143544, 143545,
	143660, 143662, 143727, 143827, 143828, 143829, 144072, 144339, 144393,
	146902, 147307, 147308, 147309, 147310, 147311, 147312, 147537, 147708,
	147832, 147838, 147843, 147867, 150547, 150743, 150744, 150745, 150746,
	151016, 151184, 151265, 151270, 151271, 151343, 151344, 151345, 151348,
	151349, 151652, 151877, 152556, 152574, 152923, 152982, 153004, 153039,
	153124, 153126, 153179, 153180, 153181, 153182, 153183, 153193, 153194,
	153204, 153253, 153293, 156649, 156833, 156836, 156871, 158149, 159749,
	159753, 160509, 160740, 160751, 161342, 162539, 162642, 162643, 162644,
	162973, 162974, 163045, 163200, 163201, 163206, 163210, 163211, 163463,
	163565, 163566, 163603, 163607, 163697, 163704, 163705, 163713, 163735,
	163736, 163738, 163740, 163741, 163742, 163744, 163745, 163750, 163775,
	163795, 163828, 163829, 163924, 163986, 163987, 164310, 164373, 164374,
	164375, 164983, 165021, 165669, 165670, 165671, 165672, 165673, 165674,
	165675, 165676, 165791, 165802, 166245, 166247, 166282, 166290, 166292,
	166295, 166297, 166298, 166308, 166461, 166544, 166662, 166663, 166678,
	166701, 166702, 166703, 166704, 166743, 166744, 166746, 166747, 166777,
	166778, 166779, 166784, 166785, 166787, 166788, 166790, 166808, 166851,
	166877, 166879, 166880, 167931, 168012, 168014, 168016, 168123, 168667,
	168807, 168808, 168824, 168907, 169108, 169275, 169276, 169277, 169278,
	169297, 169298, 169303, 169347, 169768, 169796, 169838, 169865, 170154,
	170155, 170187, 170196, 170198, 170199, 170203, 170204, 170380, 170469,
	170476, 172179, 172219, 172222, 172223, 172224, 172225, 172924, 173727,
	173951, 173984, 174445, 174830, 174871, 174873, 174874, 174920, 174921,
	174924, 174926, 174928, 174995, 175063, 175140, 177951, 178529, 178530,
	179393, 180290, 180646, 180647, 180873, 180947, 180993, 181476, 181556,
	181794, 181825, 182694, 182695, 182696, 182729, 182732, 182773, 182780,
	182890, 183716, 183847, 183856, 183876, 183900, 183901, 183903, 183986,
	183988, 183989, 184075, 184218, 184223, 184292, 184312, 184318, 184353,
	184396, 184404, 184410, 184413, 184415, 184418, 184435, 184447, 184449,
	184476, 184487, 184489, 184490, 184495, 184508, 185993, 186501, 186686,
	186702, 186973, 186974, 186985, 187051, 187075, 187113, 187139, 187140,
	187154, 187155, 187159, 187174, 187176, 187184, 187185, 187339, 187344,
	187416, 187417, 187419, 187420, 187422, 187512, 187520, 187591, 187689,
	187705, 187780, 187793, 187834, 187840, 187860, 187869, 187875, 187895,
	187896, 187897, 187898, 187899, 187900, 187913, 187957, 187958, 187959,
	188680, 188694, 188695, 188698, 188699, 188701, 188952, 190177, 190196,
	190237, 190238, 190333, 190457, 190734, 190754, 190853, 190926, 191891,
	191925, 191937, 192093, 192094, 192099, 192443, 192485, 192495, 193032,
	193033, 193476, 193478, 193588, 194052, 194056, 194057, 194058, 194059,
	194060, 194885, 197719, 197961, 197986, 198039, 198090, 198156, 198173,
	198206, 198227, 198264, 198402, 198409, 198428, 198474, 198537, 198646,
	198720, 198721, 198722, 198728, 198729, 198827, 198857, 199337, 199554,
	199649, 199650, 199767, 199768, 199769, 199770, 199771, 199830, 199892,
	199894, 199896, 199897, 199899, 199900, 199902, 200116, 200142, 200148,
	200160, 200178, 200198, 200249, 200469, 200550, 200551, 200597, 200628,
	200630, 200631, 200636, 200640, 200707, 200857, 200869, 200878, 200926,
	200960, 200999, 201435, 201815, 201927, 201930, 201931, 201933, 202019,
	202020, 202021, 202022, 202042, 202102, 202207, 202253, 202261, 202283,
	202309, 202360, 202711, 202851, 202856, 202859, 202862, 202865, 203716,
	203725, 203734, 203757, 203852, 204170, 204220, 204256, 204257, 204262,
	204389, 204675, 204686, 204687, 204818, 205045, 205255, 205418, 205419,
	205463, 205688, 205796, 205904, 205908, 205936, 205963, 206008, 206038,
	206043, 206195, 206267, 206268, 206343, 206347, 206565, 206696, 206993,
	207092, 207099, 207730, 208057, 208058, 208092, 208096, 208186, 208415,
	208421, 208433, 208658, 208798, 208825, 209035, 209052, 209858, 209859,
	209944, 210042, 210411, 210497, 210656, 210725, 210864, 211424,
}
E.Octo_Table.OctoTable_itemID_Cataloged_Research = {
	{itemiD = 186685, count = 1},
	{itemiD = 187322, count = 8},
	{itemiD = 187457, count = 8},
	{itemiD = 187324, count = 8},
	{itemiD = 187323, count = 8},
	{itemiD = 187460, count = 8},
	{itemiD = 187458, count = 8},
	{itemiD = 187459, count = 8},
	{itemiD = 187465, count = 48},
	{itemiD = 187327, count = 48},
	{itemiD = 187463, count = 48},
	{itemiD = 187325, count = 48},
	{itemiD = 187325, count = 48},
	{itemiD = 187326, count = 48},
	{itemiD = 187462, count = 48},
	{itemiD = 187478, count = 48},
	{itemiD = 187336, count = 100},
	{itemiD = 187466, count = 100},
	{itemiD = 187332, count = 100},
	{itemiD = 187328, count = 100},
	{itemiD = 187334, count = 100},
	{itemiD = 187330, count = 150},
	{itemiD = 187329, count = 150},
	{itemiD = 187467, count = 150},
	{itemiD = 187331, count = 150},
	{itemiD = 187311, count = 300},
	{itemiD = 187333, count = 300},
	{itemiD = 187350, count = 300},
}