local GlobalAddonName, E = ...
--------------------------------------------------------------------------------
E.OctoTable_QuestID_Paragon = {
	83740, -- Дурная слава у визиря
	83739, -- Дурная слава у генерала
	83738, -- Дурная слава у Прядильщицы
	79220, -- Известность у Ассамблеи глубин
	79219, -- Известность у совета Дорногала
	79218, -- Известность среди Арати Тайносводья
	79196, -- Известность у Отрезанных нитей
	76425, -- Известность у Стражей Сна
	75290, -- Известность среди лоаммских ниффов
	71023, -- Известность в союзе Вальдраккена
	66511, -- Знаменитость среди искарских клыкарров
	66156, -- Известность в Драконьей экспедиции
	65606, -- Знаменитость среди Маруук
	64867, -- Припасы Просветленных
	64267, -- Таинственные подарки Ве'нари
	64266, -- Припасы Кодекса архивариуса
	64012, -- Припасы Легиона Смерти
	61100, -- Припасы Двора Жнецов
	61098, -- Припасы Дикой Охоты
	61097, -- Припасы перерожденных
	61095, -- Припасы Неумирающей армии
	58097, -- Припасы от Ульдумского союза
	58096, -- Припасы от клана Раджани
	55976, -- Припасы Клинков Волн
	55348, -- Припасы от Ржавоболтского сопротивления
	54462, -- Благодарность империи Зандалари
	54461, -- Благодарность жителей Вол'дуна
	54460, -- Благодарность экспедиции Таланджи
	54458, -- Благодарность адмиралтейства Праудмуров
	54457, -- Благодарность ордена Возрождения Шторма
	54456, -- Благодарность ордена Пылающих Углей
	54455, -- Благодарность Армии Чести
	54454, -- Благодарность 7-го легиона
	54453, -- Благодарность Магни
	54451, -- Благодарность тортолланских искателей
	53982, -- Припасы от Освобожденных
	48977, -- Припасы от Армии Света
	48976, -- Припасы от Защитников Аргуса
	46777, -- Награда Армии погибели Легиона
	46749, -- Припасы Стражей
	46748, -- Припасы помраченных
	46747, -- Припасы Ткачей Снов
	46746, -- Припасы валарьяров
	46745, -- Припасы от Двора Фарондиса
	46743, -- Припасы из Крутогорья
}
E.OctoTable_QuestID = {
				57876,
			57877,
			57878,
	24545,
	24743,
	24547,
	24749,
	24756,
	24757,
	24548,
	24549,
	24748,
	38242,
	39246,
	46246,
	46666,
	43533,
	75630,
	75629,
	75628,
	75627,
	78319,
	77990,
	78039,
	77942,
	77944,
	77982,
	78211,
	77864,
	77989,
	77862,
	77867,
	78212,
	78213,
	77940,
	78210,
	77570,
	77878,
	77859,
	78214,
	78263,
	77943,
	77890,
	77856,
	77994,
	77941,
	78015,
	77846,
	77863,
	77872,
	77950,
	78005,
	78107,
	78359,
	77858,
	78120,
	78006,
	78360,
	78361,
	78550,
	78551,
	78547,
	78552,
	78033,
	78095,
	78367,
	78368,
	77855,
	77857,
	77860,
	78831,
	78911,
	78833,
	78834,
	78835,
	76982,
	75918,
	75919,
	75920,
	75921,
	75922,
	75923,
	76317,
	76318,
	76319,
	76320,
	76321,
	76322,
	77818,
	76323,
	76324,
	76325,
	76326,
	77283,
	77436,
	76433,
	76434,
	76435,
	76437,
	76441,
	76442,
	76443,
	76403,
	76342,
	76343,
	76344,
	76345,
	76532,
	76348,
	76347,
	77178,
	76327,
	76328,
	78646,
	76329,
	76330,
	76334,
	76332,
	76331,
	76335,
	76333,
	76336,
	76337,
	76384,
	76416,
	76386,
	76385,
	76436,
	76387,
	76388,
	76389,
	76398,
	76401,
	76402,
	77780,
	76276,
	77329,
	77200,
	77201,
	76280,
	76281,
	77781,
	76282,
	76283,
	85574, -- Туманный ящик с праздника
	85523, -- Заплесневевший ящик с праздника
	84909, -- Призрачный ящик с праздника
	84773, -- Кристаллизованный ящик с праздника
	84767, -- Обгорелый ящик с праздника
	84625, -- Неожиданно чистый ящик с праздника
	84624, -- Покрытый песком ящик с праздника
	84470, -- Грязный ящик с праздника
	84426, -- Промокший насквозь ящик с праздника
	83931, -- Потрепанный ящик с праздника
	83794, -- Мокрый ящик с праздника
	82659, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Неруб'арский дворец
	82516, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: заключение пакта
	82512, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: босс вне подземелья
	82511, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Машина пробуждения
	82510, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Неруб'арский дворец
	82509, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Неруб'арский дворец
	82508, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Гнездовье
	82507, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: приорат Священного Пламени
	82506, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: расселина Темного Пламени
	82505, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Каменный Свод
	82504, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Город Нитей
	82503, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Искроварня
	82502, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Ара-Кара, Город Отголосков
	82501, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: "Сияющий Рассвет"
	82500, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Гнездовье
	82499, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: приорат Священного Пламени
	82498, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: расселина Темного Пламени
	82497, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Каменный Свод
	82496, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Город Нитей
	82495, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Искроварня
	82494, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Ара-Кара, Город Отголосков
	82493, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: "Сияющий Рассвет"
	82492, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Город Нитей
	82491, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Ара-Кара, Город Отголосков
	82490, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: приорат Священного Пламени
	82489, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: "Сияющий Рассвет"
	82488, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: расселина Темного Пламени
	82487, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Каменный Свод
	82486, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Гнездовье
	82485, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Искроварня
	82483, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: благодать Света
	82482, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: разнюхивание
	82453, -- |A:Wrapperavailablequesticon:14:14:0:0|a Воспоминание души мира: на бис!
	82452, -- |A:Wrapperavailablequesticon:14:14:0:0|a Воспоминание души мира: локальные задания
	-- 82449, -- |A:Wrapperavailablequesticon:14:14:0:0|a Зов души мира
	82321, -- Воспоминание души мира: древние исследователи
	82286, -- Воспоминание души мира: отвергнутые Древние боги
	82285, -- Воспоминание души мира: раненая душа
	82263, -- Воспоминание души мира: неистовство стихий
	82260, -- Воспоминание души мира: первобытные охотники
	82207, -- Воспоминание души мира: наследник дальних морей
	82164, -- Воспоминание души мира: правление Древних богов
	81985, -- Воспоминание души мира: великие резчики
}
E.OctoTable_QuestIDTEST = {
}

E.OctoTable_Quest_Bastion = {
	-- "ASoulbindInNeed"
	59773,
	59774,
	57102,
	57584,
	60735,
	57261,
	57676,
	57677,
	-- "TheAspirantsCrucible"
	57709,
	57710,
	57711,
	57263,
	57267,
	57265,
	59920,
	57713,
	57908,
	57909,
	57288,
	57714,
	57291,
	57266,
	57715,
	60217,
	60218,
	60219,
	60220,
	60221,
	60222,
	60223,
	60224,
	60225,
	60226,
	60229,
	58174,
	-- "TheTempleofPurity"
	57270,
	57977,
	57264,
	57716,
	57717,
	57037,
	59147,
	57719,
	60292,
	57446,
	57269,
	57447,
	-- "ChasingaMemory"
	58976,
	58771,
	58799,
	58800,
	58977,
	58978,
	58979,
	58980,
	58843,
	60180,
	60013,
	-- "BytheArchonsWill"
	59196,
	59197,
	59198,
	59199,
	59200,
	59426,
	-- "TheTempleofCourage"
	60005,
	60006,
	60007,
	60008,
	60009,
	60052,
	60053,
	60054,
	60055,
	-- "ChampionofPain"
	61096,
	61107,
	57386,
	57390,
	60020,
	60021,
	57425,
	57511,
	57512,
	60179,
	60181,
	57515,
}



E.OctoTable_Quest_Maldraxus = {
	-- ChampionofPain
	61096,
	61107,
	57386,
	57390,
	60020,
	60021,
	57425,
	57511,
	57512,
	60179,
	60181,
	57515,

	-- HouseoftheChosen
	57514,
	57516,
	58351,
	58617,
	60451,
	58616,
	58618,
	58726,
	60428,
	60453,
	60461,
	60886,

	-- MatronofSpies
	58751,
	59171,
	58821,
	59172,
	59210,
	59185,
	59188,
	59190,
	59025,
	59009,

	-- HouseofConstructs
	57912,
	57976,
	60557,
	58268,
	57979,
	59616,
	57983,
	57984,
	57985,
	57986,
	57987,
	57982,
	57993,
	57994,
	60733,

	-- HouseofPlagues
	59130,
	58011,
	58016,
	58027,
	58031,
	58036,
	58045,
	59223,
	60831,
	59231,

	-- RitualfortheDamned
	59202,
	59874,
	59897,
	60972,
	59960,
	59959,
	59962,
	59966,
	59973,
	61190,
	62654,
	59974,

	-- TheEmptyThrone
	59011,
	60737,
	59206,
	61715,
	61716,
}



E.OctoTable_Quest_Ardenweald = {
	-- "Welcome to Ardenweald"
	60338,
	60763,
	60341,
	60778,
	60857,
	60859,
	57787,
	-- "Aiding Tirna Vaal"
	57816,
	57947,
	60567,
	60563,
	60575,
	60577,
	60594,
	57948,
	57949,
	57950,
	57951,
	-- "Waning Grove"
	60600,
	60624,
	60637,
	60638,
	60639,
	60647,
	60648,
	60671,
	60709,
	60724,
	60519,
	-- "Glitterfall Heights"
	60521,
	60628,
	60629,
	60630,
	60631,
	60632,
	60522,
	60520,
	-- "This Is the Way"
	60738,
	60764,
	60839,
	60856,
	60881,
	60901,
	60905,
	-- "The Fallen Tree"
	58473,
	58480,
	58484,
	58483,
	58486,
	58488,
	58524,
	-- "Visions of the Dreamer"
	60572,
	58589,
	58591,
	58592,
	58590,
	60578,
	58593,
	-- "Awaken the Dreamer"
	58714,
	58719,
	58720,
	60621,
	58869,
	60661,
	58721,
	58723,
	58724,
}



E.OctoTable_Quest_Revendreth = {
	-- "WelcometoRevendreth"
	57025,
	57026,
	57007,
	56829,
	57381,
	56942,
	56955,
	58433,
	56978,


	-- "TheMaster"
	57174,
	58654,
	57178,
	57179,

	-- "TheAccuser"
	57161,
	57173,
	58931,
	58932,
	59021,
	57175,
	59023,
	57176,
	57180,
	57182,
	59232,

	-- "ThePenitentHunt"
	57098,
	58916,
	58941,
	59014,
	57131,
	57136,
	57164,
	60506,
	57159,
	60313,
	57189,
	59209,
	57190,
	59256,

	-- "TheMadDuke"
	57240,
	57380,
	57405,
	57426,
	57427,
	57428,
	57442,
	57460,
	57461,
	60566,
	57724,

	-- "PrinceRenathal"
	59327,
	57689,
	57690,
	57691,
	57693,
	57694,

	-- "TheMasterofLies"
	58086,
	59644,







}