local GlobalAddonName, E = ...
local AddonTitle = C_AddOns.GetAddOnMetadata(GlobalAddonName, "Title")
--------------------------------------------------------------------------------
E.Octo_Table.OctoTable_QuestID = {
85947, -- |A:Recurringavailablequesticon:14:14:0:0|a Первозданное путешествие во времени
84446, -- Известность в Каз Алгаре
84365, -- |A:importantavailablequesticon:14:14:0:0|a Загадки на горизонте
84133, -- |A:Recurringavailablequesticon:14:14:0:0|a Требуются услуги алхимика
84132, -- |A:Recurringavailablequesticon:14:14:0:0|a Требуются услуги портного
84131, -- |A:Recurringavailablequesticon:14:14:0:0|a Требуются услуги кожевника
84130, -- |A:Recurringavailablequesticon:14:14:0:0|a Требуются услуги ювелира
84129, -- |A:Recurringavailablequesticon:14:14:0:0|a Требуются услуги начертателя
84128, -- |A:Recurringavailablequesticon:14:14:0:0|a Требуются услуги инженера
84127, -- |A:Recurringavailablequesticon:14:14:0:0|a Требуются услуги кузнеца
84086, -- |A:Recurringavailablequesticon:14:14:0:0|a Ценная редкость
84022, -- Сплетая отрезанные нити
83740, -- Дурная слава у визиря
83739, -- Дурная слава у генерала
83738, -- Дурная слава у Прядильщицы
83639, -- Открытое общение
83552, -- Аз-Кахет
83551, -- Тайносводье
83550, -- Гулкие глубины
83548, -- Остров Дорн
83543, -- Приключения в Каз Алгаре
83459, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a "Сияющий Рассвет"
83458, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Приорат Священного Пламени
83457, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Каменный Свод
83443, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Расселина Темного Пламени
83366, -- |A:Recurringavailablequesticon:14:14:0:0|a Мир ждет
83339, -- Разрушители шпилей
83338, -- Убийца Магов
83337, -- Оскал бури
83335, -- Разыскивается: попиратель
83333, -- |A:Recurringavailablequesticon:14:14:0:0|a Шестеренки неприятностей
83331, -- Важные (?) находки
83322, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a "Сияющий Рассвет": первый взлет
83315, -- Подготовка к неизвестному
83286, -- Что скрыто под Дорногалом
83274, -- |A:Recurringavailablequesticon:14:14:0:0|a Первозданный путь сквозь время
83271, -- Всегда найдется тайна
83247, -- Подозрительная натура
83240, -- |A:Recurringavailablequesticon:14:14:0:0|a Театральная труппа
83181, -- Друзья до конца
83162, -- Верни на место!
83153, -- Образцы газа
83102, -- |A:Recurringavailablequesticon:14:14:0:0|a Весомый висмут
83087, -- Старый страж
83057, -- Финальная черта
82992, -- |A:Recurringavailablequesticon:14:14:0:0|a Заряженный бурей товар
82958, -- |A:Recurringavailablequesticon:14:14:0:0|a Благодать в каждом цветочке
82946, -- |A:Recurringavailablequesticon:14:14:0:0|a Вниз в глубины
82895, -- Бремя долга
82848, -- Су-шеф
82836, -- Укокошь Зерош
82814, -- Утилизация заразы
82801, -- Жуки и драгоценности
82768, -- Облака на крючке
82708, -- |A:Wrapperavailablequesticon:14:14:0:0|a Вылазки: злобные нерубы
82678, -- |A:Wrapperavailablequesticon:14:14:0:0|a Архивы: первый диск
82653, -- Скопище кошмаров
82540, -- Воспоминания о былых приключениях
82511, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Машина пробуждения
82485, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: Искроварня
82482, -- |A:Wrapperavailablequesticon:14:14:0:0|a Душа мира: разнюхивание
82480, -- Дружелюбный робот-убийца
82452, -- |A:Wrapperavailablequesticon:14:14:0:0|a Воспоминание души мира: локальные задания
82291, -- Робобой
82284, -- Поминовение павших
82153, -- Посольства и посланники
82144, -- В пути
82050, -- |A:importantavailablequesticon:14:14:0:0|a Предвестница гербов
81999, -- Новый дом – новая свечка!
81966, -- Каменный сон
81963, -- Плоды наших трудов
81915, -- Домой в гнездо
81914, -- Дар Озтан
81913, -- Азы полетов, раздел третий
81912, -- Азы полетов, раздел второй
81798, -- Возвращение к Мойре
81713, -- Слизьмодей
81690, -- Свет в конце туннеля
81689, -- Ознакомление: Гундаргаз
81685, -- Первый красильщик Аз-Кахета
81672, -- Клешни прочь
81632, -- |A:Recurringavailablequesticon:14:14:0:0|a Ящерица-воровка
81574, -- |A:Recurringavailablequesticon:14:14:0:0|a Неудержимая поросль
81559, -- По следам тумана
80678, -- Утерянное время
80672, -- |A:Wrapperavailablequesticon:14:14:0:0|a Десница визиря
80671, -- |A:Wrapperavailablequesticon:14:14:0:0|a Клинок генерала
80670, -- |A:Wrapperavailablequesticon:14:14:0:0|a Глаза Прядильщицы
80572, -- Диссонирующие меры
80517, -- Туда, где все началось
80516, -- Долой босса
80502, -- Аз-Кахет слезам не верит
80500, -- Семейство Бронзобородов
80434, -- В подземные глубины
80407, -- Похитительница Свечеблеск
80399, -- Еда развязывает языки
80382, -- Все яйца в одну корзину
80334, -- Расколотые шпили
80316, -- Обратно в море
80189, -- |A:Recurringavailablequesticon:14:14:0:0|a Выживание в команде
80187, -- |A:Recurringavailablequesticon:14:14:0:0|a Выживание в стычках
80186, -- |A:Recurringavailablequesticon:14:14:0:0|a Выживание на войне
80179, -- В поисках правосудия
80145, -- Золотая жила
80082, -- Назад в Гундаргаз
80079, -- Палки в шестернях
80049, -- Пламя не угасло
80022, -- Призыв к странникам бурь
80004, -- |A:Recurringavailablequesticon:14:14:0:0|a Дай краба!
79999, -- Разжигание надежды
79944, -- Бушующие разломы
79728, -- Ничего особенного
79721, -- Разойдись!
79715, -- Опаснейшие амфибии
79703, -- Надежда – обман
79701, -- Кавалерия прибыла
79683, -- Где свечка, там и дом
79682, -- Давление критическое!
79650, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Приорат Священного Пламени: братское горе
79625, -- Скорее жив, чем мертв
79580, -- Ответная атака
79565, -- Халтуриковы свечи
79553, -- Естественное лекарство
79546, -- Закрытый бар глашатаев
79541, -- Гори все огнем
79525, -- Доклад на Высоту надзирателя
79510, -- Свечка без фитиля
79480, -- Дань уважения
79477, -- Заблудшие овечки
79476, -- Непреодолимый зов
79475, -- Ввысь к молниям
79471, -- Бледные пески
79470, -- Воды войны
79469, -- Затаившиеся в глубине
79380, -- Бой с болотными бестиями
79371, -- Королевское лекарство
79357, -- Срезанная шляпка
79354, -- Глашатаи механизмов
79349, -- Корпорация дельцов
79346, -- |A:Recurringavailablequesticon:14:14:0:0|a Жвачка против кошмаров
79344, -- Городская одиссея
79342, -- Расставание
79333, -- Прибытие флота
79329, -- Светящийся урожай
79328, -- Посольства и посланники
79325, -- Темная жила
79324, -- На водокачку
79313, -- То, что растет во тьме
79303, -- Директор честных правил
79297, -- Ночная стража
79282, -- Торжественный дебют
79267, -- Чем ярче, тем лучше
79266, -- Наследие Бронзобородов
79244, -- Новости из глубин
79243, -- Сфабрикованный бунт
79241, -- Поднимем шум
79240, -- Переметнувшийся агент
79239, -- Оковы королевы
79237, -- Сотворение чудовища
79233, -- Допуск в лабораторию
79230, -- Крадясь по коридорам
79227, -- Паучий глаз
79224, -- Сбор разведданных
79222, -- Закаленная тенью ходовая пружина
79220, -- Известность у Ассамблеи глубин
79219, -- Известность у совета Дорногала
79218, -- Известность среди Арати Тайносводья
79217, -- Назад к своим
79216, -- |A:Recurringavailablequesticon:14:14:0:0|a Паутина манипуляции
79205, -- В хозяйстве все сгодится
79197, -- Выход на поверхность
79196, -- Известность у Отрезанных нитей
79175, -- Трудные будни трутней
79173, -- |A:Recurringavailablequesticon:14:14:0:0|a Помощь с припасами
79168, -- Гамбит Света
79160, -- Рыбалка расслабляет
79157, -- Титанические меры
79156, -- Эдикты
79154, -- Последнее прощание
79147, -- Азы полетов
79146, -- Бьющие с земли
79145, -- Металл и камень
79140, -- Битье баклуш
79139, -- Один во тьме
79129, -- Сбор буреклювов
79124, -- Проводник южной бури
79122, -- Нюхачи-навозники
79110, -- Спасение Томоти
79107, -- После бури
79089, -- Вместо прощания
79030, -- Глас глашатаев
79029, -- Это саботаж
79028, -- Нужно больше минералов
79027, -- Боязнь элементалей
79026, -- Водокачка должна качать
79025, -- Все по плану
79024, -- Промышленный шпионаж
79023, -- Маленькие друзья и большие планы
79022, -- Загадочный сигнал
78999, -- Сердце героя
78972, -- |A:Recurringavailablequesticon:14:14:0:0|a Полевой переполох
78954, -- Исцеление Пламени
78952, -- Последнее сопротивление
78951, -- Питающие тьму
78941, -- Остановить волну
78939, -- Потемневшее пламя
78937, -- Тень среди теней
78936, -- Большая рыба
78934, -- Клинки Арати
78933, -- |A:Recurringavailablequesticon:14:14:0:0|a Сладкое затмение
78932, -- Грубая рыба
78929, -- Темные хитрости
78915, -- |A:Recurringavailablequesticon:14:14:0:0|a Тыквенная угроза
78839, -- Контроль численности
78838, -- Шестеренки механизма
78837, -- О благоразумии
78821, -- |A:Recurringavailablequesticon:14:14:0:0|a Цветение во Сне
78761, -- В Машину
78760, -- Выжечь черным железом
78759, -- Пробуждение гиганта
78742, -- Битва за мастерскую
78741, -- Глашатаи-друзья
78738, -- Безучастный лидер
78716, -- Горькие уроки
78715, -- Голос Азерот
78714, -- Вам не рады
78713, -- Сокрытая война
78706, -- Тайна верховного глашатая
78705, -- То, что видела она
78704, -- В поисках бригадира
78703, -- Похороненное среди камней
78701, -- Что написано мелом...
78700, -- По пути
78697, -- Город-призрак
78696, -- Не ходите в Таэллок
78695, -- Фонарь зажжен
78685, -- Конец туннеля
78672, -- Долг фонарщика
78671, -- Сияние башни Рассвета
78670, -- Долой осадные орудия
78669, -- Только для шестиногих
78668, -- На борту "Рассвета"
78667, -- Яркие воспоминания
78666, -- Хороший паук – это...
78665, -- Проблемы с подкопами
78659, -- Там, куда приходит свет
78658, -- Тропа таинства
78657, -- Полночная стража
78656, -- |A:Recurringavailablequesticon:14:14:0:0|a Отмыть начисто
78646, -- Пожарная охрана
78642, -- Новая свеча – новая надежда
78641, -- Негодяй Пламескал
78640, -- Все любят листовки
78639, -- Свободу кобольдам!
78638, -- Так не доставайся ж ты никому
78637, -- Взломщик Винтогрыз
78636, -- Битва за рудники
78635, -- Роковые свечи
78634, -- Чтобы помнили
78631, -- Разговор с глашатаями
78630, -- Взлет "Расплаты"
78629, -- Резервные силы
78628, -- Подземный капкан
78627, -- Последняя линия фронта
78626, -- Время тренировок
78624, -- Свеча горит во тьме
78621, -- Растущая тень
78620, -- Перекресток сумерек
78615, -- Колокольный звон
78614, -- Свет Мерельдара
78613, -- Бастион Тайносводья
78590, -- Световые технологии
78574, -- Король корней
78564, -- Старый новый смысл
78557, -- Блудная вагонетка
78555, -- Подземные беды
78546, -- Компенсация
78545, -- Возвращение в Артерию
78544, -- Да грянет гром
78543, -- Рой разъяренных пауков
78542, -- Зона эвакуации
78541, -- Сладкая ловушка
78540, -- В Искроварню
78539, -- Длительное восстановление
78538, -- Командная работа
78536, -- Непреодолимое препятствие
78535, -- Пришельцы из глубин
78534, -- В Дорногал
78533, -- Позиция на берегу
78532, -- Нестабильные артефакты
78531, -- Срочное восстановление
78530, -- Устранение диверсантов
78529, -- Жесткое столкновение
78504, -- Слегка помятый подарок
78471, -- Конвергенция
78470, -- Авансцена
78468, -- Архив
78464, -- Вылазка под землю
78463, -- Камни для фундамента
78462, -- Отголоски сострадания
78461, -- Четвертое место
78460, -- Гипоцентр
78459, -- Ситуация с союзом
78457, -- Камни Дорногала
78444, -- |A:Recurringavailablequesticon:14:14:0:0|a Достойный союзник: Стражи Сна
78393, -- Передышка?..
78392, -- Тугая паутина
78384, -- Погоня за Светом
78383, -- Колющий козырь
78354, -- Направляющая нить
78353, -- Бойся древней крови
78352, -- Не все полезно, что дает земля
78350, -- Герои не умирают
78348, -- Друзья познаются во тьме
78319, -- |A:Recurringavailablequesticon:14:14:0:0|a Цветочный бум
78294, -- Громовой бык
78256, -- Согласие генерала
78255, -- Непринужденный вид
78254, -- Украденная власть
78251, -- Бедствующие даларанцы
78250, -- Генеральный агент
78249, -- Особые личности
78248, -- То, что у нас осталось
78244, -- Кахетское гостеприимство
78237, -- Полный вперед!
78236, -- Отставший, но не отчаявшийся
78234, -- Напролом
78233, -- Подарок Прядильщицы
78232, -- Переписывая переписанное
78231, -- Наблюдение со стороны
78228, -- В город многоногих
78226, -- Прелюбопытное приглашение
78131, -- Подарок к Зимнему Покрову
78033, -- Магический цветок
78015, -- Фистия Огнемеченная
77982, -- Жадный Джесси
77878, -- Посланник Зимы
77867, -- Морууд
77818, -- Жестокая
77781, -- Специфичный юмор
77780, -- Пусть его видят все
77747, -- Полная бочка
77746, -- Полная бочка
77745, -- Полная бочка
77744, -- Полная бочка
77679, -- Помощь Соридорми
77570, -- Нуоберон, дикий сон ребенка
77437, -- Грань Эпохи
77436, -- Пылающий курган
77414, -- Исследование Прилива Снов
77329, -- Торжественная церемония
77283, -- Война на несколько фронтов
77251, -- |A:Recurringavailablequesticon:14:14:0:0|a Укрощение Прилива Снов
77236, -- |A:Recurringavailablequesticon:14:14:0:0|a Исцелить само время
77201, -- От себя лично
77200, -- Подношение колодцу
77178, -- Тактическое отступление
77155, -- Полная бочка
77153, -- Полная бочка
77152, -- Полная бочка
77099, -- Полная бочка
77097, -- Полная бочка
77096, -- Полная бочка
77095, -- Полная бочка
76997, -- |A:Recurringavailablequesticon:14:14:0:0|a Потерявшиеся во тьме
76982, -- A Sentinel's Summon
76733, -- |A:Recurringavailablequesticon:14:14:0:0|a В поисках картофеля
76600, -- |A:Recurringavailablequesticon:14:14:0:0|a Прямо между гироокуляров
76586, -- Принеси им свет
76548, -- Пахучий подарок
76547, -- Все, что блестит
76546, -- Идеология боголомов
76544, -- Воины безжизненных пустошей
76533, -- Опасные документы
76532, -- Нападение на Источник
76531, -- Полная бочка
76521, -- Робот Боффинс
76459, -- Сопротивление
76453, -- Память камня
76449, -- Вечное противостояние
76443, -- Огонь надвигается
76442, -- Напрасная надежда
76441, -- Мрачная работа
76437, -- Горящая земля
76436, -- Клочок надежды
76435, -- Тлеющая роща
76434, -- Не все потеряно
76433, -- Земля пепла
76425, -- Известность у Стражей Сна
76416, -- Сквозь огонь
76406, -- Грехи Испепелителя
76404, -- Шестеренки в системе
76403, -- Воплощение беспорядка
76402, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Амирдрассил, Надежда Сна: Фиракк
76401, -- Эхо Огненных Просторов
76398, -- Превосходство в воздухе
76389, -- Время смертных
76388, -- Огонь против огня
76387, -- Защита древних
76386, -- Битва льда и пламени
76385, -- Опасное садоводство
76384, -- Цветение
76379, -- Заходят как-то мурлок и дракон в портал времени...
76362, -- Рогатый череп
76351, -- Звери титанов
76348, -- И клей не нужен
76347, -- Вулкана в мешке не утаишь
76345, -- В поисках Терро
76344, -- Стихийные перебежчики
76343, -- По секрету всему свету
76342, -- Долой порталы
76338, -- Улучшенный кромсатель капусты
76337, -- Угли еще дымятся
76336, -- Лети и бей
76335, -- Могущество леса
76334, -- Добрый совет
76333, -- Тройная угроза
76332, -- Взвести капкан
76331, -- Гамбит Меритры
76330, -- Специалист по разоружению
76329, -- Бесшумно, как сова
76328, -- Очередной головорез
76327, -- Око Изеры
76326, -- Дом во Сне
76325, -- Между Фиракком и наковальней
76324, -- Жертвы пламени
76323, -- Амирдрассил
76322, -- Лица врагов наших
76321, -- Огненная волна
76320, -- Дикие боги среди нас
76319, -- Пир во время пожара
76318, -- Добро пожаловать в Сон
76317, -- Зов Сна
76283, -- Анду-фала-дор
76282, -- Тревожные предчувствия
76281, -- В честь надежды
76280, -- Новолуние
76276, -- Новая земля
76169, -- |A:Recurringavailablequesticon:14:14:0:0|a Свечение во тьме
76140, -- Рассвет Бесконечности
76122, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Славный бой – это уже награда
76084, -- Ловкость Ледяного Огня
76081, -- Духовные лжецы
76027, -- Крича и дергаясь
76016, -- Живая дрель
76015, -- Железное сердце
76014, -- Ожившая статуя
75996, -- Твой вес золотом
75923, -- Поднять тревогу
75922, -- Обжигающие новости
75921, -- Сквозь пламя
75920, -- Огненные взгляды
75919, -- Остудить обереги
75918, -- Огнеопасная вылазка
75888, -- Лагерь насыщения
75887, -- Силы Фиракка
75705, -- Ремонт монумента
75694, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Аберрий, Затененное Горнило: Саркарет
75665, -- |A:Recurringavailablequesticon:14:14:0:0|a Достойный союзник: лоаммские ниффы
75664, -- Диссонирующие кристаллы
75624, -- Состязание чемпионов
75622, -- Всем бойцам!
75621, -- Шепот стихий
75620, -- Обманчивый свет
75619, -- Юркие воришки
75612, -- Зов каскадов
75611, -- Лови мерцокуня, пока не уплыл
75517, -- Спрячься и понюхай
75516, -- Успешное вмешательство
75506, -- Гребни пламени Тьмы
75497, -- Дар катализатора
75494, -- Удар по знаменам
75478, -- Голодная-преголодная гидра
75471, -- Исследование кристаллов
75461, -- Магмохват-матриарх
75455, -- Заговор огней
75454, -- Мортира войны
75451, -- Неидеальное равновесие
75450, -- Сейсмическая церемония
75441, -- Вонючая драка
75397, -- Ох уж эти черви
75393, -- Источник запахов
75390, -- Вертикальная аномалия
75370, -- Благовоняния
75290, -- Известность среди лоаммских ниффов
75239, -- Ученик Фиракка: Шадейсетал
75234, -- Поскрести, понюхать
75222, -- Под огнем
75156, -- Стресс-экспресс
74905, -- Исследователи под огнем
74775, -- Ученик Фиракка: Кретченрат
74771, -- Охота за ключами
74570, -- |A:Recurringavailablequesticon:14:14:0:0|a Помощь раненым
74568, -- |A:Recurringavailablequesticon:14:14:0:0|a Смерть поджигателям
74378, -- Неистовство бури
74352, -- Кружащийся ветерок
74349, -- Укобород
74347, -- Ангварди Убийца Змеев
74346, -- Кэрри Лютоглаз
74345, -- Велтракс
74344, -- Леди Шаз'ра
74343, -- Грагот Крушитель Кораблей
74342, -- Галахад
74341, -- Просеиватель костей Марвак
74339, -- Рейза Утопленница
74338, -- Ишира
74337, -- Газ'раксес
74336, -- Вракен Охотник
74333, -- Неистовый аметист
74332, -- Люттрок
74331, -- Агни Пылающее Копыто
74330, -- Фимбул
74325, -- Кузнец приливов Зарвисс
74321, -- Гарид
74307, -- Кривоклык
74306, -- Манафема
74305, -- Профессор Клешнер
74300, -- Тектоний
72693, -- Припасы за известность
72690, -- Припасы за известность
72688, -- Припасы за известность
71232, -- Известность на Драконьих островах
71026, -- |A:Recurringavailablequesticon:14:14:0:0|a Вопреки всему
71023, -- Известность в союзе Вальдраккена
70916, -- Известность и слава
70885, -- Припасы за известность
70882, -- Припасы за известность
66875, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Сохранение прошлого: академия Алгет'ар
66874, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Сохранение прошлого: Чертоги Насыщения
66873, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Сохранение прошлого: Лазурное хранилище
66871, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Сохранение прошлого: наступление клана Нокхуд
66870, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Сохранение прошлого: Рубиновые Омуты Жизни
66868, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Сохранение прошлого: наследие Тира
66866, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Поиски реликвии: Чертоги Насыщения
66865, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Поиски реликвии: Лазурное хранилище
66864, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Поиски реликвии: лощина Бурошкуров
66862, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Поиски реликвии: Рубиновые Омуты Жизни
66861, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Поиски реликвии: Нелтарий
66860, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Поиски реликвии: наследие Тира
66511, -- Знаменитость среди искарских клыкарров
66419, -- Присяга
66156, -- Известность в Драконьей экспедиции
66133, -- Ключи преданности
66042, -- |A:CampaignAvailableQuestIcon:11:11:0:0|a Закономерности в закономерностях
65606, -- Знаменитость среди Маруук
65266, -- |A:Recurringavailablequesticon:14:14:0:0|a Пропавшие исследования
65143, -- Антрос
64867, -- Припасы Просветленных
64710, -- |A:Recurringavailablequesticon:14:14:0:0|a Шепчущий кристалл пламени Скверны
64709, -- |A:Recurringavailablequesticon:14:14:0:0|a Путь Скверны сквозь время
64531, -- Мор'гет
64522, -- |A:Recurringavailablequesticon:14:14:0:0|a Украденные кортийские припасы
64273, -- Сдержать Верных Хелии
64267, -- Таинственные подарки Ве'нари
64266, -- Припасы Кодекса архивариуса
64012, -- Припасы Легиона Смерти
63953, -- Месть Коррака
63949, -- |A:Recurringavailablequesticon:14:14:0:0|a Определяя судьбу
62869, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62868, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62867, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62866, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62865, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62864, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62863, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62862, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62861, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62860, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62859, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62858, -- |A:Recurringavailablequesticon:14:14:0:0|a Возвращение потерянных душ
62640, -- |A:Recurringavailablequesticon:14:14:0:0|a Зов арены
62638, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Посланник войны
62637, -- |A:Recurringavailablequesticon:14:14:0:0|a Призыв к бою
62636, -- |A:Recurringavailablequesticon:14:14:0:0|a Дикий путь сквозь время
62635, -- |A:Recurringavailablequesticon:14:14:0:0|a Затуманенный путь сквозь время
62633, -- |A:Recurringavailablequesticon:14:14:0:0|a Замерзший путь сквозь время
62632, -- |A:Recurringavailablequesticon:14:14:0:0|a Пылающий путь сквозь время
62631, -- |A:Recurringavailablequesticon:14:14:0:0|a Мир ждет
62234, -- |A:Recurringavailablequesticon:14:14:0:0|a Мощь колосса
62214, -- |A:Recurringavailablequesticon:14:14:0:0|a Вечные мученики
61984, -- |A:Recurringavailablequesticon:14:14:0:0|a Наполнение резервуара
61983, -- |A:Recurringavailablequesticon:14:14:0:0|a Наполнение резервуара
61982, -- |A:Recurringavailablequesticon:14:14:0:0|a Наполнение резервуара
61981, -- |A:Recurringavailablequesticon:14:14:0:0|a Наполнение резервуара
61816, -- Мортанис
61104, -- |A:Recurringavailablequesticon:14:14:0:0|a Граталакс Извлекатель
61100, -- Припасы Двора Жнецов
61098, -- Припасы Дикой Охоты
61097, -- Припасы перерожденных
61095, -- Припасы Неумирающей армии
61088, -- |A:Recurringavailablequesticon:14:14:0:0|a Прах к праху!
60256, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Ценная находка: Чертоги Покаяния
60254, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Ценная находка: Тирна Скитт
60253, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Ценная находка: Смертельная тризна
60247, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Обмен услугами: Театр Боли
60244, -- |A:questlog-questtypeicon-dungeon:14:14:0:0|a Обмен услугами: Чертоги Покаяния
58097, -- Припасы от Ульдумского союза
58096, -- Припасы от клана Раджани
57300, -- |A:Recurringavailablequesticon:14:14:0:0|a Вневременной солдат
56339, -- Тремблейд должна умереть
56337, -- Сбор фрагментов артефактов
55976, -- Припасы Клинков Волн
55511, -- Убить их всех!
55509, -- Победа на озере Ледяных Оков
55499, -- |A:Recurringavailablequesticon:14:14:0:0|a Мерцающий кристалл
55498, -- |A:Recurringavailablequesticon:14:14:0:0|a Мерцающий кристалл
55348, -- Припасы от Ржавоболтского сопротивления
54462, -- Благодарность империи Зандалари
54461, -- Благодарность жителей Вол'дуна
54460, -- Благодарность экспедиции Таланджи
54458, -- Благодарность адмиралтейства Праудмуров
54457, -- Благодарность ордена Возрождения Шторма
54456, -- Благодарность ордена Пылающих Углей
54455, -- Благодарность Армии Чести
54454, -- Благодарность 7-го легиона
54453, -- Благодарность Магни
54451, -- Благодарность тортолланских искателей
53982, -- Припасы от Освобожденных
49015, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Анторус, Пылающий Трон: смерть титана
48977, -- Припасы от Армии Света
48976, -- Припасы от Защитников Аргуса
47148, -- |A:Recurringavailablequesticon:14:14:0:0|a Кое-что новенькое
46777, -- Награда Армии погибели Легиона
46749, -- Припасы Стражей
46748, -- Припасы помраченных
46747, -- Припасы Ткачей Снов
46746, -- Припасы валарьяров
46745, -- Припасы от Двора Фарондиса
46743, -- Припасы из Крутогорья
46666, -- Золотая жила
46246, -- Уничтожить всех
45563, -- |A:Recurringavailablequesticon:14:14:0:0|a Затуманенная монета
43533, -- |A:questlog-storylineicon:14:14:0:0|a Баланс сил
40787, -- |A:Recurringavailablequesticon:14:14:0:0|a Тлеющий уголек
40786, -- |A:Recurringavailablequesticon:14:14:0:0|a Тлеющий уголек
40173, -- |A:Recurringavailablequesticon:14:14:0:0|a Нестабильная призма
40168, -- |A:Recurringavailablequesticon:14:14:0:0|a Бурлящий фиал
39246, -- Владычество над морями
38242, -- Раскопанная магия
36614, -- Моя собственная крепость
36567, -- Лучше больше, да лучше
34378, -- Создание гарнизона
32325, -- Проникновение в Черный храм
32324, -- В поисках сигнала
32317, -- В поисках камней души
32310, -- История шести мастеров
32309, -- История шести мастеров
32307, -- Чтец мертвого языка
32295, -- Необычная книга
24757, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Сила льда
24756, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Сила крови
24749, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Сила нечестивости
24748, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Последняя битва Короля-лича
24743, -- |A:legendaryavailablequesticon:14:14:0:0|a Грань Тьмы
24548, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Расколотый трон
24547, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Пиршество душ
24545, -- |A:questlog-questtypeicon-raid:14:14:0:0|a Святость и скверна
14062, -- |A:Recurringavailablequesticon:14:14:0:0|a Не забыть про запеканку!
14061, -- |A:Recurringavailablequesticon:14:14:0:0|a Слишком мало индеек
14060, -- |A:Recurringavailablequesticon:14:14:0:0|a Проще пареной тыквы
14059, -- |A:Recurringavailablequesticon:14:14:0:0|a У нас опять кончился соус?
14058, -- |A:Recurringavailablequesticon:14:14:0:0|a Батат – значит, батат!
14055, -- |A:Recurringavailablequesticon:14:14:0:0|a Батат – значит, батат!
14054, -- |A:Recurringavailablequesticon:14:14:0:0|a Проще пареной тыквы
14053, -- |A:Recurringavailablequesticon:14:14:0:0|a У нас опять кончился соус?
14048, -- |A:Recurringavailablequesticon:14:14:0:0|a Слишком мало индеек
13183, -- |A:Recurringavailablequesticon:14:14:0:0|a Победа на озере Ледяных Оков
8803, -- Подарок в разноцветной упаковке
8769, -- Тикающий подарок
8768, -- Подарок в яркой упаковке
8744, -- Тщательно упакованный подарок
7045, -- Благодарность от "Пастбищ Дымного Леса"!
7043, -- |A:Recurringavailablequesticon:14:14:0:0|a Прохладное чувство юмора
6983, -- |A:Recurringavailablequesticon:14:14:0:0|a Прохладное чувство юмора
80562, -- notitle
79158, -- notitle
66867, -- notitle
66863, -- notitle
62634, -- notitle
61103, -- notitle
60646, -- notitle
60251, -- notitle
60248, -- notitle
60243, -- notitle
75576, -- notitle
74329, -- notitle
74328, -- notitle
74322, -- notitle
63543, -- notitle
60775, -- notitle
24549, -- notitle
14051, -- notitle


	-- 88738, -- notitle
	-- 88739, -- notitle
	-- 64753, -- notitle
	-- 64754, -- notitle
	-- 64755, -- notitle
	-- 64756, -- notitle
	-- 64757, -- notitle
	-- 64828, -- notitle
	-- 65282, -- notitle
	-- 72166, -- notitle
	-- 72167, -- notitle
	-- 72168, -- notitle
	-- 72169, -- notitle
	-- 72170, -- notitle
	-- 72171, -- notitle
	-- 72646, -- notitle
	-- 72647, -- notitle
	-- 72648, -- notitle
	-- 72649, -- notitle
	-- 72719, -- notitle
	-- 72720, -- notitle
	-- 72721, -- notitle
	-- 72722, -- notitle
	-- 72723, -- notitle
	-- 72724, -- notitle
	-- 72725, -- notitle
	-- 72726, -- notitle
	-- 72727, -- notitle
	-- 72728, -- notitle
	-- 72810, -- notitle
	-- 74569, -- notitle
	-- 74871, -- notitle
	-- 75627, -- notitle
	-- 75628, -- notitle
	-- 75629, -- notitle
	-- 75630, -- notitle
	-- 83460, -- notitle
	-- 83280, -- notitle
	-- 83281, -- notitle
	-- 82582, -- notitle
	-- 84084, -- notitle
	-- 84085, -- notitle
	-- 82965, -- notitle
	-- 82916, -- notitle
	-- 82962, -- notitle
	-- 82970, -- notitle
	-- 83105, -- notitle
	-- 83106, -- notitle
	-- 83104, -- notitle
	-- 83103, -- notitle
	-- 83098, -- notitle
	-- 82993, -- notitle
	-- 83100, -- notitle
	-- 83097, -- notitle
	-- 82778, -- notitle
	-- 83529, -- notitle
	-- 83530, -- notitle
	-- 83531, -- notitle
	-- 83532, -- notitle
	-- 84737, -- notitle
	-- 84736, -- notitle
	-- 76394, -- notitle
	-- 81794, -- notitle
	-- 81795, -- notitle
	-- 81796, -- notitle
	-- 72282, -- notitle
	-- 72692, -- notitle
	-- 72696, -- notitle
	-- 72671, -- notitle
	-- 72673, -- notitle
	-- 72691, -- notitle
	-- 72694, -- notitle
	-- 72284, -- notitle
	-- 72697, -- notitle
	-- 72695, -- notitle
	-- 72682, -- notitle
	-- 72685, -- notitle
	-- 72669, -- notitle
	-- 72672, -- notitle
	-- 72687, -- notitle
	-- 72698, -- notitle
	-- 72689, -- notitle
	-- 72701, -- notitle
	-- 72283, -- notitle
	-- 72702, -- notitle
	-- 72704, -- notitle
	-- 72703, -- notitle
	-- 6984, -- notitle
	-- 77846, -- notitle
	-- 77855, -- notitle
	-- 77856, -- notitle
	-- 77857, -- notitle
	-- 77858, -- notitle
	-- 77859, -- notitle
	-- 77860, -- notitle
	-- 77862, -- notitle
	-- 77863, -- notitle
	-- 77864, -- notitle
	-- 77872, -- notitle
	-- 77890, -- notitle
	-- 77940, -- notitle
	-- 77941, -- notitle
	-- 77942, -- notitle
	-- 77943, -- notitle
	-- 77944, -- notitle
	-- 77950, -- notitle
	-- 77989, -- notitle
	-- 77990, -- notitle
	-- 77994, -- notitle
	-- 78005, -- notitle
	-- 78006, -- notitle
	-- 78039, -- notitle
	-- 78095, -- notitle
	-- 78107, -- notitle
	-- 78120, -- notitle
	-- 78210, -- notitle
	-- 78211, -- notitle
	-- 78212, -- notitle
	-- 78213, -- notitle
	-- 78214, -- notitle
	-- 78263, -- notitle
	-- 78359, -- notitle
	-- 78360, -- notitle
	-- 78361, -- notitle
	-- 78367, -- notitle
	-- 78368, -- notitle
	-- 78547, -- notitle
	-- 78550, -- notitle
	-- 78551, -- notitle
	-- 78552, -- notitle
	-- 78831, -- notitle
	-- 78833, -- notitle
	-- 78834, -- notitle
	-- 78835, -- notitle
	-- 78911, -- notitle
	-- 60242, -- notitle
	-- 60245, -- notitle
	-- 60246, -- notitle
	-- 60249, -- notitle
	-- 60250, -- notitle
	-- 60252, -- notitle
	-- 60255, -- notitle
	-- 60257, -- notitle
	-- 60762, -- notitle
	-- 61075, -- notitle
	-- 61079, -- notitle
	-- 61765, -- notitle
	-- 61813, -- notitle
	-- 61814, -- notitle
	-- 61815, -- notitle
	-- 62284, -- notitle
	-- 62285, -- notitle
	-- 62286, -- notitle
	-- 62287, -- notitle
	-- 62288, -- notitle
	-- 62639, -- notitle
	-- 63815, -- notitle
	-- 63816, -- notitle
	-- 63817, -- notitle
	-- 63818, -- notitle
	-- 63822, -- notitle
	-- 63823, -- notitle
	-- 63824, -- notitle
	-- 63825, -- notitle
	-- 63826, -- notitle
	-- 63830, -- notitle
	-- 63993, -- notitle
	-- 63995, -- notitle
	-- 63996, -- notitle
	-- 63997, -- notitle
	-- 63998, -- notitle
	-- 63999, -- notitle
	-- 64021, -- notitle
	-- 64027, -- notitle
	-- 64044, -- notitle
	-- 64045, -- notitle
	-- 64055, -- notitle
	-- 64056, -- notitle
	-- 64057, -- notitle
	-- 64058, -- notitle
	-- 64059, -- notitle
	-- 64060, -- notitle
	-- 64061, -- notitle
	-- 64152, -- notitle
	-- 64209, -- notitle
	-- 64232, -- notitle
	-- 64233, -- notitle
	-- 64243, -- notitle
	-- 64245, -- notitle
	-- 64246, -- notitle
	-- 64247, -- notitle
	-- 64251, -- notitle
	-- 64256, -- notitle
	-- 64257, -- notitle
	-- 64258, -- notitle
	-- 64263, -- notitle
	-- 64265, -- notitle
	-- 64269, -- notitle
	-- 64270, -- notitle
	-- 64272, -- notitle
	-- 64276, -- notitle
	-- 64278, -- notitle
	-- 64283, -- notitle
	-- 64284, -- notitle
	-- 64285, -- notitle
	-- 64291, -- notitle
	-- 64300, -- notitle
	-- 64303, -- notitle
	-- 64307, -- notitle
	-- 64313, -- notitle
	-- 64316, -- notitle
	-- 64317, -- notitle
	-- 64318, -- notitle
	-- 64320, -- notitle
	-- 64338, -- notitle
	-- 64339, -- notitle
	-- 64341, -- notitle
	-- 64342, -- notitle
	-- 64343, -- notitle
	-- 64344, -- notitle
	-- 64347, -- notitle
	-- 64348, -- notitle
	-- 64349, -- notitle
	-- 64351, -- notitle
	-- 64354, -- notitle
	-- 64355, -- notitle
	-- 64356, -- notitle
	-- 64357, -- notitle
	-- 64358, -- notitle
	-- 64359, -- notitle
	-- 64360, -- notitle
	-- 64361, -- notitle
	-- 64362, -- notitle
	-- 64363, -- notitle
	-- 64364, -- notitle
	-- 64366, -- notitle
	-- 64367, -- notitle
	-- 64428, -- notitle
	-- 64433, -- notitle
	-- 64434, -- notitle
	-- 64435, -- notitle
	-- 64436, -- notitle
	-- 64439, -- notitle
	-- 64440, -- notitle
	-- 64442, -- notitle
	-- 64455, -- notitle
	-- 64456, -- notitle
	-- 64457, -- notitle
	-- 64470, -- notitle
	-- 64471, -- notitle
	-- 64472, -- notitle
	-- 64564, -- notitle
	-- 64565, -- notitle
	-- 64575, -- notitle
	-- 64747, -- notitle
	-- 64748, -- notitle
	-- 64749, -- notitle
	-- 64750, -- notitle
	-- 64751, -- notitle
	-- 64752, -- notitle
	-- 73180, -- notitle
	-- 73182, -- notitle
	-- 73928, -- notitle
	-- 73936, -- notitle
	-- 74843, -- notitle
	-- 74844, -- notitle
	-- 74845, -- notitle
}
E.Octo_Table.OctoTable_QuestID_Paragon = {
	83740, -- Дурная слава у визиря
	83739, -- Дурная слава у генерала
	83738, -- Дурная слава у Прядильщицы
	79220, -- Известность у Ассамблеи глубин
	79219, -- Известность у совета Дорногала
	79218, -- Известность среди Арати Тайносводья
	79196, -- Известность у Отрезанных нитей
	76425, -- Известность у Стражей Сна
	75290, -- Известность среди лоаммских ниффов
	71023, -- Известность в союзе Вальдраккена
	66511, -- Знаменитость среди искарских клыкарров
	66156, -- Известность в Драконьей экспедиции
	65606, -- Знаменитость среди Маруук
	64867, -- Припасы Просветленных
	64267, -- Таинственные подарки Ве'нари
	64266, -- Припасы Кодекса архивариуса
	64012, -- Припасы Легиона Смерти
	61100, -- Припасы Двора Жнецов
	61098, -- Припасы Дикой Охоты
	61097, -- Припасы перерожденных
	61095, -- Припасы Неумирающей армии
	58097, -- Припасы от Ульдумского союза
	58096, -- Припасы от клана Раджани
	55976, -- Припасы Клинков Волн
	55348, -- Припасы от Ржавоболтского сопротивления
	54462, -- Благодарность империи Зандалари
	54461, -- Благодарность жителей Вол'дуна
	54460, -- Благодарность экспедиции Таланджи
	54458, -- Благодарность адмиралтейства Праудмуров
	54457, -- Благодарность ордена Возрождения Шторма
	54456, -- Благодарность ордена Пылающих Углей
	54455, -- Благодарность Армии Чести
	54454, -- Благодарность 7-го легиона
	54453, -- Благодарность Магни
	54451, -- Благодарность тортолланских искателей
	53982, -- Припасы от Освобожденных
	48977, -- Припасы от Армии Света
	48976, -- Припасы от Защитников Аргуса
	46777, -- Награда Армии погибели Легиона
	46749, -- Припасы Стражей
	46748, -- Припасы помраченных
	46747, -- Припасы Ткачей Снов
	46746, -- Припасы валарьяров
	46745, -- Припасы от Двора Фарондиса
	46743, -- Припасы из Крутогорья
}
E.Octo_Table.OctoTable_QuestIDTEST ={
	85947, -- |A:Recurringavailablequesticon:14:14:0:0|a Первозданный путь сквозь время
	83274, -- |A:Recurringavailablequesticon:14:14:0:0|a Первозданный путь сквозь время
}