local GlobalAddonName, E = ...
local AddonTitle = C_AddOns.GetAddOnMetadata(GlobalAddonName, "Title")
--------------------------------------------------------------------------------
E.Octo_Table.OctoTable_QuestID = {
	6983, -- Прохладное чувство юмора
	6984, -- Благодарность от "Пастбищ Дымного Леса"!
	7043, -- Прохладное чувство юмора
	8744, -- Тщательно упакованный подарок
	8768, -- Подарок в яркой упаковке
	8769, -- Тикающий подарок
	8803, -- Подарок в разноцветной упаковке
	13183, -- Победа на озере Ледяных Оков
	14048, -- Слишком мало индеек
	14051, -- Не забыть про запеканку!
	14053, -- У нас опять кончился соус?
	14054, -- Проще пареной тыквы
	14055, -- Батат – значит, батат!
	14058, -- Батат – значит, батат!
	14059, -- У нас опять кончился соус?
	14060, -- Проще пареной тыквы
	14061, -- Слишком мало индеек
	14062, -- Не забыть про запеканку!
	24545, -- Святость и скверна
	24547, -- Пиршество душ
	24548, -- Расколотый трон
	24549, -- Темная Скорбь...
	24743, -- Грань Тьмы
	24748, -- Последняя битва Короля-лича
	24749, -- Сила нечестивости
	24756, -- Сила крови
	24757, -- Сила льда
	32295, -- Необычная книга
	32307, -- Чтец мертвого языка
	32309, -- История шести мастеров
	32310, -- История шести мастеров
	32317, -- В поисках камней души
	32324, -- В поисках сигнала
	32325, -- Проникновение в Черный храм
	34378, -- Создание гарнизона
	36567, -- Лучше больше, да лучше
	36614, -- Моя собственная крепость
	38242, -- Раскопанная магия
	39246, -- Владычество над морями
	40168, -- Бурлящий фиал
	40173, -- Нестабильная призма
	40786, -- Тлеющий уголек
	40787, -- Тлеющий уголек
	43533, -- Баланс сил
	45563, -- Затуманенная монета
	46246, -- Уничтожить всех
	46666, -- Золотая жила
	46743, -- Припасы из Крутогорья
	46745, -- Припасы от Двора Фарондиса
	46746, -- Припасы валарьяров
	46747, -- Припасы Ткачей Снов
	46748, -- Припасы помраченных
	46749, -- Припасы Стражей
	46777, -- Награда Армии погибели Легиона
	47148, -- Кое-что новенькое
	48976, -- Припасы от Защитников Аргуса
	48977, -- Припасы от Армии Света
	49015, -- Анторус, Пылающий Трон: смерть титана
	53982, -- Припасы от Освобожденных
	54451, -- Благодарность тортолланских искателей
	54453, -- Благодарность Магни
	54454, -- Благодарность 7-го легиона
	54455, -- Благодарность Армии Чести
	54456, -- Благодарность ордена Пылающих Углей
	54457, -- Благодарность ордена Возрождения Шторма
	54458, -- Благодарность адмиралтейства Праудмуров
	54460, -- Благодарность экспедиции Таланджи
	54461, -- Благодарность жителей Вол'дуна
	54462, -- Благодарность империи Зандалари
	55348, -- Припасы от Ржавоболтского сопротивления
	55498, -- Мерцающий кристалл
	55499, -- Мерцающий кристалл
	55509, -- Победа на озере Ледяных Оков
	55511, -- Убить их всех!
	55976, -- Припасы Клинков Волн
	56337, -- Сбор фрагментов артефактов
	56339, -- Тремблейд должна умереть
	58096, -- Припасы от клана Раджани
	58097, -- Припасы от Ульдумского союза
	60242, -- Обмен услугами: Смертельная тризна
	60243, -- Обмен услугами: Кровавые катакомбы
	60246, -- Обмен услугами: Тирна Скитт
	60248, -- Обмен услугами: Чумные каскады
	60251, -- Ценная находка: Чумные каскады
	60252, -- Ценная находка: Шпили Перерождения
	60254, -- Ценная находка: Тирна Скитт
	60255, -- Ценная находка: Та Сторона
	60256, -- Ценная находка: Чертоги Покаяния
	60646, -- Горестный долг
	60762, -- Частицы смерти
	60775, -- Достойная участь
	61079, -- Доля Тюремщика
	61088, -- Прах к праху!
	61095, -- Припасы Неумирающей армии
	61097, -- Припасы перерожденных
	61098, -- Припасы Дикой Охоты
	61100, -- Припасы Двора Жнецов
	61104, -- Граталакс Извлекатель
	61765, -- Опасная защита
	61813, -- "Валинор", Светоч Эпох
	61814, -- Нургаш Жижерожденный
	61981, -- Наполнение резервуара
	61982, -- Наполнение резервуара
	61983, -- Наполнение резервуара
	61984, -- Наполнение резервуара
	62214, -- Вечные мученики
	62234, -- Мощь колосса
	62631, -- Мир ждет
	62632, -- Пылающий путь сквозь время
	62633, -- Замерзший путь сквозь время
	62634, -- Разрушенный путь сквозь время
	62635, -- Затуманенный путь сквозь время
	62636, -- Дикий путь сквозь время
	62637, -- Призыв к бою
	62638, -- Посланник войны
	62640, -- Зов арены
	62858, -- Возвращение потерянных душ
	62859, -- Возвращение потерянных душ
	62860, -- Возвращение потерянных душ
	62861, -- Возвращение потерянных душ
	62862, -- Возвращение потерянных душ
	62863, -- Возвращение потерянных душ
	62864, -- Возвращение потерянных душ
	62865, -- Возвращение потерянных душ
	62866, -- Возвращение потерянных душ
	62867, -- Возвращение потерянных душ
	62868, -- Возвращение потерянных душ
	62869, -- Возвращение потерянных душ
	63543, -- Атака некролордов
	63822, -- Атака вентиров
	63949, -- Определяя судьбу
	64012, -- Припасы Легиона Смерти
	64266, -- Припасы Кодекса архивариуса
	64267, -- Таинственные подарки Ве'нари
	64273, -- Сдержать Верных Хелии
	64522, -- Украденные кортийские припасы
	64531, -- Мор'гет
	64709, -- Путь Скверны сквозь время
	64710, -- Шепчущий кристалл пламени Скверны
	64867, -- Припасы Просветленных
	65143, -- Антрос
	65266, -- Пропавшие исследования
	65606, -- Знаменитость среди Маруук
	66042, -- Закономерности в закономерностях
	66133, -- Ключи преданности
	66156, -- Известность в Драконьей экспедиции
	66419, -- Присяга
	66511, -- Знаменитость среди искарских клыкарров
	66860, -- Поиски реликвии: наследие Тира
	66861, -- Поиски реликвии: Нелтарий
	66862, -- Поиски реликвии: Рубиновые Омуты Жизни
	66863, -- Поиски реликвии: наступление клана Нокхуд
	66864, -- Поиски реликвии: лощина Бурошкуров
	66865, -- Поиски реликвии: Лазурное хранилище
	66866, -- Поиски реликвии: Чертоги Насыщения
	66867, -- Поиски реликвии: академия Алгет'ар
	66868, -- Сохранение прошлого: наследие Тира
	66870, -- Сохранение прошлого: Рубиновые Омуты Жизни
	66871, -- Сохранение прошлого: наступление клана Нокхуд
	66873, -- Сохранение прошлого: Лазурное хранилище
	66874, -- Сохранение прошлого: Чертоги Насыщения
	66875, -- Сохранение прошлого: академия Алгет'ар
	71023, -- Известность в союзе Вальдраккена
	71026, -- Вопреки всему
	74300, -- Тектоний
	74305, -- Профессор Клешнер
	74306, -- Манафема
	74307, -- Кривоклык
	74321, -- Гарид
	74322, -- Фавнос
	74325, -- Кузнец приливов Зарвисс
	74328, -- Чаротрикс
	74329, -- Кангало
	74330, -- Фимбул
	74332, -- Люттрок
	74336, -- Вракен Охотник
	74337, -- Газ'раксес
	74338, -- Ишира
	74339, -- Рейза Утопленница
	74341, -- Просеиватель костей Марвак
	74342, -- Галахад
	74343, -- Грагот Крушитель Кораблей
	74344, -- Леди Шаз'ра
	74345, -- Велтракс
	74346, -- Кэрри Лютоглаз
	74347, -- Ангварди Убийца Змеев
	74349, -- Укобород
	74352, -- Кружащийся ветерок
	74378, -- Неистовство бури
	74568, -- Смерть поджигателям
	74569, -- Никаких ресурсов
	74570, -- Помощь раненым
	74771, -- Охота за ключами
	74775, -- Ученик Фиракка: Кретченрат
	74905, -- Исследователи под огнем
	75156, -- Стресс-экспресс
	75222, -- Под огнем
	75234, -- Поскрести, понюхать
	75239, -- Ученик Фиракка: Шадейсетал
	75267, -- Коб'рок
	75269, -- Капраку
	75271, -- Аквифон
	75274, -- Жижек
	75276, -- Костеплет
	75285, -- Алканон
	75290, -- Известность среди лоаммских ниффов
	75292, -- Профессор Гастринакс
	75296, -- Генерал Зкорро
	75298, -- Беспросветная королева
	75322, -- Клакатак
	75326, -- Брулло Мощный
	75334, -- Карокта
	75336, -- Инвок
	75340, -- Магтембо
	75349, -- Скорнак
	75353, -- Динн
	75358, -- Жарик
	75360, -- Подземарк
	75364, -- Углемрак
	75366, -- Зеленый король
	75370, -- Благовоняния
	75390, -- Вертикальная аномалия
	75393, -- Источник запахов
	75397, -- Ох уж эти черви
	75441, -- Вонючая драка
	75450, -- Сейсмическая церемония
	75451, -- Неидеальное равновесие
	75454, -- Мортира войны
	75455, -- Заговор огней
	75459, -- Новейшие раскопки
	75461, -- Магмохват-матриарх
	75471, -- Исследование кристаллов
	75476, -- Колоссиан
	75478, -- Голодная-преголодная гидра
	75494, -- Удар по знаменам
	75497, -- Дар катализатора
	75506, -- Гребни пламени Тьмы
	75516, -- Успешное вмешательство
	75517, -- Спрячься и понюхай
	75611, -- Лови мерцокуня, пока не уплыл
	75612, -- Зов каскадов
	75619, -- Юркие воришки
	75620, -- Обманчивый свет
	75621, -- Шепот стихий
	75622, -- Всем бойцам!
	75624, -- Состязание чемпионов
	75664, -- Диссонирующие кристаллы
	75665, -- Достойный союзник: лоаммские ниффы
	75694, -- Аберрий, Затененное Горнило: Саркарет
	75705, -- Ремонт монумента
	75887, -- Силы Фиракка
	75888, -- Лагерь насыщения
	75918, -- Огнеопасная вылазка
	75919, -- Остудить обереги
	75920, -- Огненные взгляды
	75921, -- Сквозь пламя
	75922, -- Обжигающие новости
	75923, -- Поднять тревогу
	75996, -- Твой вес золотом
	76014, -- Ожившая статуя
	76015, -- Железное сердце
	76016, -- Живая дрель
	76027, -- Крича и дергаясь
	76081, -- Духовные лжецы
	76084, -- Ловкость Ледяного Огня
	76122, -- Славный бой – это уже награда
	76140, -- Рассвет Бесконечности
	76169, -- Свечение во тьме
	76276, -- Новая земля
	76280, -- Новолуние
	76281, -- В честь надежды
	76282, -- Тревожные предчувствия
	76283, -- Анду-фала-дор
	76317, -- Зов Сна
	76318, -- Добро пожаловать в Сон
	76319, -- Пир во время пожара
	76320, -- Дикие боги среди нас
	76321, -- Огненная волна
	76322, -- Лица врагов наших
	76323, -- Амирдрассил
	76324, -- Жертвы пламени
	76325, -- Между Фиракком и наковальней
	76326, -- Дом во Сне
	76327, -- Око Изеры
	76328, -- Очередной головорез
	76329, -- Бесшумно, как сова
	76330, -- Специалист по разоружению
	76331, -- Гамбит Меритры
	76332, -- Взвести капкан
	76333, -- Тройная угроза
	76334, -- Добрый совет
	76335, -- Могущество леса
	76336, -- Лети и бей
	76337, -- Угли еще дымятся
	76338, -- Улучшенный кромсатель капусты
	76342, -- Долой порталы
	76343, -- По секрету всему свету
	76344, -- Стихийные перебежчики
	76345, -- В поисках Терро
	76347, -- Вулкана в мешке не утаишь
	76348, -- И клей не нужен
	76351, -- Звери титанов
	76362, -- Рогатый череп
	76379, -- Заходят как-то мурлок и дракон в портал времени...
	76384, -- Цветение
	76385, -- Опасное садоводство
	76386, -- Битва льда и пламени
	76387, -- Защита древних
	76388, -- Огонь против огня
	76389, -- Время смертных
	76394, -- Вкусовые тени
	76398, -- Превосходство в воздухе
	76401, -- Эхо Огненных Просторов
	76402, -- Амирдрассил, Надежда Сна: Фиракк
	76403, -- Воплощение беспорядка
	76404, -- Шестеренки в системе
	76406, -- Грехи Испепелителя
	76416, -- Сквозь огонь
	76425, -- Известность у Стражей Сна
	76433, -- Земля пепла
	76434, -- Не все потеряно
	76435, -- Тлеющая роща
	76436, -- Клочок надежды
	76437, -- Горящая земля
	76441, -- Мрачная работа
	76442, -- Напрасная надежда
	76443, -- Огонь надвигается
	76449, -- Вечное противостояние
	76453, -- Память камня
	76459, -- Сопротивление
	76521, -- Робот Боффинс
	76531, -- Полная бочка
	76532, -- Нападение на Источник
	76533, -- Опасные документы
	76544, -- Воины безжизненных пустошей
	76546, -- Идеология боголомов
	76547, -- Все, что блестит
	76548, -- Пахучий подарок
	76586, -- Принеси им свет
	76600, -- Прямо между гироокуляров
	76733, -- В поисках картофеля
	76982, -- A Sentinel's Summon
	76997, -- Потерявшиеся во тьме
	77095, -- Полная бочка
	77096, -- Полная бочка
	77097, -- Полная бочка
	77099, -- Полная бочка
	77152, -- Полная бочка
	77153, -- Полная бочка
	77155, -- Полная бочка
	77178, -- Тактическое отступление
	77200, -- Подношение колодцу
	77201, -- От себя лично
	77236, -- Исцелить само время
	77251, -- Укрощение Прилива Снов
	77283, -- Война на несколько фронтов
	77329, -- Торжественная церемония
	77414, -- Исследование Прилива Снов
	77436, -- Пылающий курган
	77437, -- Грань Эпохи
	77570, -- Нуоберон, дикий сон ребенка
	77679, -- Помощь Соридорми
	77744, -- Полная бочка
	77745, -- Полная бочка
	77746, -- Полная бочка
	77747, -- Полная бочка
	77780, -- Пусть его видят все
	77781, -- Специфичный юмор
	77818, -- Жестокая
	77867, -- Морууд
	77878, -- Посланник Зимы
	77982, -- Жадный Джесси
	78015, -- Фистия Огнемеченная
	78033, -- Магический цветок
	78131, -- Подарок к Зимнему Покрову
	78226, -- Прелюбопытное приглашение
	78228, -- В город многоногих
	78231, -- Наблюдение со стороны
	78232, -- Переписывая переписанное
	78233, -- Подарок Прядильщицы
	78234, -- Напролом
	78236, -- Отставший, но не отчаявшийся
	78237, -- Полный вперед!
	78244, -- Кахетское гостеприимство
	78248, -- То, что у нас осталось
	78249, -- Особые личности
	78250, -- Генеральный агент
	78251, -- Бедствующие даларанцы
	78254, -- Украденная власть
	78255, -- Непринужденный вид
	78256, -- Согласие генерала
	78294, -- Громовой бык
	78319, -- Цветочный бум
	78348, -- Друзья познаются во тьме
	78350, -- Герои не умирают
	78352, -- Не все полезно, что дает земля
	78353, -- Бойся древней крови
	78354, -- Направляющая нить
	78383, -- Колющий козырь
	78384, -- Погоня за Светом
	78392, -- Тугая паутина
	78393, -- Передышка?..
	78444, -- Достойный союзник: Стражи Сна
	78457, -- Камни Дорногала
	78459, -- Ситуация с союзом
	78460, -- Гипоцентр
	78461, -- Четвертое место
	78462, -- Отголоски сострадания
	78463, -- Камни для фундамента
	78464, -- Вылазка под землю
	78468, -- Архив
	78470, -- Авансцена
	78471, -- Конвергенция
	78504, -- Слегка помятый подарок
	78529, -- Жесткое столкновение
	78530, -- Устранение диверсантов
	78531, -- Срочное восстановление
	78532, -- Нестабильные артефакты
	78533, -- Позиция на берегу
	78534, -- В Дорногал
	78535, -- Пришельцы из глубин
	78536, -- Непреодолимое препятствие
	78538, -- Командная работа
	78539, -- Длительное восстановление
	78540, -- В Искроварню
	78541, -- Сладкая ловушка
	78542, -- Зона эвакуации
	78543, -- Рой разъяренных пауков
	78544, -- Да грянет гром
	78545, -- Возвращение в Артерию
	78546, -- Компенсация
	78555, -- Подземные беды
	78557, -- Блудная вагонетка
	78564, -- Старый новый смысл
	78574, -- Король корней
	78590, -- Световые технологии
	78613, -- Бастион Тайносводья
	78614, -- Свет Мерельдара
	78615, -- Колокольный звон
	78620, -- Перекресток сумерек
	78621, -- Растущая тень
	78624, -- Свеча горит во тьме
	78626, -- Время тренировок
	78627, -- Последняя линия фронта
	78628, -- Подземный капкан
	78629, -- Резервные силы
	78630, -- Взлет "Расплаты"
	78631, -- Разговор с глашатаями
	78634, -- Чтобы помнили
	78635, -- Роковые свечи
	78636, -- Битва за рудники
	78637, -- Взломщик Винтогрыз
	78638, -- Так не доставайся ж ты никому
	78639, -- Свободу кобольдам!
	78640, -- Все любят листовки
	78641, -- Негодяй Пламескал
	78642, -- Новая свеча – новая надежда
	78646, -- Пожарная охрана
	78656, -- Отмыть начисто
	78657, -- Полночная стража
	78658, -- Тропа таинства
	78659, -- Там, куда приходит свет
	78665, -- Проблемы с подкопами
	78666, -- Хороший паук – это...
	78667, -- Яркие воспоминания
	78668, -- На борту "Рассвета"
	78669, -- Только для шестиногих
	78670, -- Долой осадные орудия
	78671, -- Сияние башни Рассвета
	78672, -- Долг фонарщика
	78685, -- Конец туннеля
	78695, -- Фонарь зажжен
	78696, -- Не ходите в Таэллок
	78697, -- Город-призрак
	78700, -- По пути
	78701, -- Что написано мелом...
	78703, -- Похороненное среди камней
	78704, -- В поисках бригадира
	78705, -- То, что видела она
	78706, -- Тайна верховного глашатая
	78713, -- Сокрытая война
	78714, -- Вам не рады
	78715, -- Голос Азерот
	78716, -- Горькие уроки
	78738, -- Безучастный лидер
	78741, -- Глашатаи-друзья
	78742, -- Битва за мастерскую
	78759, -- Пробуждение гиганта
	78760, -- Выжечь черным железом
	78761, -- В Машину
	78821, -- Цветение во Сне
	78837, -- О благоразумии
	78838, -- Шестеренки механизма
	78839, -- Контроль численности
	78915, -- Тыквенная угроза
	78929, -- Темные хитрости
	78932, -- Грубая рыба
	78933, -- Сладкое затмение
	78934, -- Клинки Арати
	78936, -- Большая рыба
	78937, -- Тень среди теней
	78939, -- Потемневшее пламя
	78941, -- Остановить волну
	78951, -- Питающие тьму
	78952, -- Последнее сопротивление
	78954, -- Исцеление Пламени
	78972, -- Полевой переполох
	78999, -- Сердце героя
	79022, -- Загадочный сигнал
	79023, -- Маленькие друзья и большие планы
	79024, -- Промышленный шпионаж
	79025, -- Все по плану
	79026, -- Водокачка должна качать
	79027, -- Боязнь элементалей
	79028, -- Нужно больше минералов
	79029, -- Это саботаж
	79030, -- Глас глашатаев
	79089, -- Вместо прощания
	79107, -- После бури
	79110, -- Спасение Томоти
	79122, -- Нюхачи-навозники
	79124, -- Проводник южной бури
	79129, -- Сбор буреклювов
	79139, -- Один во тьме
	79140, -- Битье баклуш
	79145, -- Металл и камень
	79146, -- Бьющие с земли
	79147, -- Азы полетов
	79154, -- Последнее прощание
	79156, -- Эдикты
	79157, -- Титанические меры
	79158, -- Спасительные семена
	79160, -- Рыбалка расслабляет
	79168, -- Гамбит Света
	79173, -- Помощь с припасами
	79175, -- Трудные будни трутней
	79197, -- Выход на поверхность
	79205, -- В хозяйстве все сгодится
	79216, -- Паутина манипуляции
	79217, -- Назад к своим
	79222, -- Закаленная тенью ходовая пружина
	79224, -- Сбор разведданных
	79227, -- Паучий глаз
	79230, -- Крадясь по коридорам
	79233, -- Допуск в лабораторию
	79237, -- Сотворение чудовища
	79239, -- Оковы королевы
	79240, -- Переметнувшийся агент
	79241, -- Поднимем шум
	79243, -- Сфабрикованный бунт
	79244, -- Новости из глубин
	79266, -- Наследие Бронзобородов
	79267, -- Чем ярче, тем лучше
	79282, -- Торжественный дебют
	79297, -- Ночная стража
	79303, -- Директор честных правил
	79313, -- То, что растет во тьме
	79324, -- На водокачку
	79325, -- Темная жила
	79328, -- Посольства и посланники
	79329, -- Светящийся урожай
	79333, -- Прибытие флота
	79342, -- Расставание
	79344, -- Городская одиссея
	79346, -- Жвачка против кошмаров
	79349, -- Корпорация дельцов
	79354, -- Глашатаи механизмов
	79357, -- Срезанная шляпка
	79371, -- Королевское лекарство
	79380, -- Бой с болотными бестиями
	79469, -- Затаившиеся в глубине
	79470, -- Воды войны
	79471, -- Бледные пески
	79475, -- Ввысь к молниям
	79476, -- Непреодолимый зов
	79477, -- Заблудшие овечки
	79480, -- Дань уважения
	79510, -- Свечка без фитиля
	79525, -- Доклад на Высоту надзирателя
	79541, -- Гори все огнем
	79546, -- Закрытый бар глашатаев
	79553, -- Естественное лекарство
	79565, -- Халтуриковы свечи
	79580, -- Ответная атака
	79625, -- Скорее жив, чем мертв
	79650, -- Приорат Священного Пламени: братское горе
	79682, -- Давление критическое!
	79683, -- Где свечка, там и дом
	79701, -- Кавалерия прибыла
	79703, -- Надежда – обман
	79715, -- Опаснейшие амфибии
	79721, -- Разойдись!
	79728, -- Ничего особенного
	79944, -- Бушующие разломы
	79999, -- Разжигание надежды
	80004, -- Дай краба!
	80022, -- Призыв к странникам бурь
	80049, -- Пламя не угасло
	80079, -- Палки в шестернях
	80082, -- Назад в Гундаргаз
	80145, -- Золотая жила
	80179, -- В поисках правосудия
	80186, -- Выживание на войне
	80187, -- Выживание в стычках
	80189, -- Выживание в команде
	80316, -- Обратно в море
	80334, -- Расколотые шпили
	80382, -- Все яйца в одну корзину
	80399, -- Еда развязывает языки
	80407, -- Похитительница Свечеблеск
	80434, -- В подземные глубины
	80500, -- Семейство Бронзобородов
	80502, -- Аз-Кахет слезам не верит
	80516, -- Долой босса
	80517, -- Туда, где все началось
	80562, -- Цветущее лакомство
	80572, -- Диссонирующие меры
	80670, -- Глаза Прядильщицы
	80671, -- Клинок генерала
	80672, -- Десница визиря
	80678, -- Утерянное время
	81559, -- По следам тумана
	81574, -- Неудержимая поросль
	81632, -- Ящерица-воровка
	81672, -- Клешни прочь
	81685, -- Первый красильщик Аз-Кахета
	81689, -- Ознакомление: Гундаргаз
	81690, -- Свет в конце туннеля
	81713, -- Слизьмодей
	81794, -- Искры войны: Гулкие глубины
	81795, -- Искры войны: Тайносводье
	81798, -- Возвращение к Мойре
	81912, -- Азы полетов, раздел второй
	81913, -- Азы полетов, раздел третий
	81914, -- Дар Озтан
	81915, -- Домой в гнездо
	81963, -- Плоды наших трудов
	81966, -- Каменный сон
	81999, -- Новый дом – новая свечка!
	82050, -- Предвестница гербов
	82144, -- В пути
	82153, -- Посольства и посланники
	82284, -- Поминовение павших
	82291, -- Робобой
	82452, -- Воспоминание души мира: локальные задания
	82480, -- Дружелюбный робот-убийца
	82482, -- Душа мира: разнюхивание
	82485, -- Душа мира: Искроварня
	82511, -- Душа мира: Машина пробуждения
	82540, -- Воспоминания о былых приключениях
	82678, -- Архивы: первый диск
	82708, -- Вылазки: злобные нерубы
	82768, -- Облака на крючке
	82801, -- Жуки и драгоценности
	82814, -- Утилизация заразы
	82836, -- Укокошь Зерош
	82848, -- Су-шеф
	82895, -- Бремя долга
	82916, -- Когда грибы цветут
	82946, -- Вниз в глубины
	82965, -- Свет и тень
	82992, -- Заряженный бурей товар
	83057, -- Финальная черта
	83087, -- Старый страж
	83100, -- Раскол панциря
	83102, -- Весомый висмут
	83105, -- Запарный заказ
	83153, -- Образцы газа
	83162, -- Верни на место!
	83181, -- Друзья до конца
	83240, -- Театральная труппа
	83247, -- Подозрительная натура
	83271, -- Всегда найдется тайна
	83286, -- Что скрыто под Дорногалом
	83315, -- Подготовка к неизвестному
	83322, -- "Сияющий Рассвет": первый взлет
	83331, -- Важные (?) находки
	83333, -- Шестеренки неприятностей
	83335, -- Разыскивается: попиратель
	83337, -- Оскал бури
	83338, -- Убийца Магов
	83339, -- Разрушители шпилей
	83366, -- Мир ждет
	83443, -- Расселина Темного Пламени
	83457, -- Каменный Свод
	83458, -- Приорат Священного Пламени
	83459, -- "Сияющий Рассвет"
	83529, -- Рыбоборье в Тайносводье
	83532, -- Рыбоборье в Тайносводье
	83543, -- Приключения в Каз Алгаре
	83548, -- Остров Дорн
	83550, -- Гулкие глубины
	83551, -- Тайносводье
	83552, -- Аз-Кахет
	83639, -- Открытое общение
	84022, -- Сплетая отрезанные нити
	84086, -- Ценная редкость
	84127, -- Требуются услуги кузнеца
	84128, -- Требуются услуги инженера
	84129, -- Требуются услуги начертателя
	84130, -- Требуются услуги ювелира
	84131, -- Требуются услуги кожевника
	84132, -- Требуются услуги портного
	84133, -- Требуются услуги алхимика
	84365, -- Загадки на горизонте
	84446, -- Известность в Каз Алгаре
}



E.Octo_Table.OctoTable_QuestID_Paragon = {
	46743, -- Припасы из Крутогорья
	46745, -- Припасы от Двора Фарондиса
	46746, -- Припасы валарьяров
	46747, -- Припасы Ткачей Снов
	46748, -- Припасы помраченных
	46749, -- Припасы Стражей
	46777, -- Награда Армии погибели Легиона
	48976, -- Припасы от Защитников Аргуса
	48977, -- Припасы от Армии Света
	53982, -- Припасы от Освобожденных
	54451, -- Благодарность тортолланских искателей
	54453, -- Благодарность Магни
	54454, -- Благодарность 7-го легиона
	54455, -- Благодарность Армии Чести
	54456, -- Благодарность ордена Пылающих Углей
	54457, -- Благодарность ордена Возрождения Шторма
	54458, -- Благодарность адмиралтейства Праудмуров
	54460, -- Благодарность экспедиции Таланджи
	54461, -- Благодарность жителей Вол'дуна
	54462, -- Благодарность империи Зандалари
	55348, -- Припасы от Ржавоболтского сопротивления
	55976, -- Припасы Клинков Волн
	58096, -- Припасы от клана Раджани
	58097, -- Припасы от Ульдумского союза
	61095, -- Припасы Неумирающей армии
	61097, -- Припасы перерожденных
	61098, -- Припасы Дикой Охоты
	61100, -- Припасы Двора Жнецов
	64012, -- Припасы Легиона Смерти
	64266, -- Припасы Кодекса архивариуса
	64267, -- Таинственные подарки Ве'нари
	64867, -- Припасы Просветленных
	65606, -- Знаменитость среди Маруук
	66156, -- Известность в Драконьей экспедиции
	66511, -- Знаменитость среди искарских клыкарров
	71023, -- Известность в союзе Вальдраккена
	75290, -- Известность среди лоаммских ниффов
	76425, -- Известность у Стражей Сна
}