local GlobalAddonName, E = ...
local AddonTitle = C_AddOns.GetAddOnMetadata(GlobalAddonName, "Title")
--------------------------------------------------------------------------------
E.Octo_Table.OctoTable_itemID_Config = {
	-- 224073, -- Зачарованный позолоченный герб Предвестницы
	-- 224072, -- Зачарованный рунический герб Предвестницы
	-- 224069, -- Зачарованный истертый герб Предвестницы
	-- 220790, -- Формирующийся рунический герб Предвестницы
	-- 220789, -- Формирующийся позолоченный герб Предвестницы
	-- 220788, -- Формирующийся истертый герб Предвестницы
	-- 200652, -- Мешочек алхимических приправ
	-- 200095, -- Горшок с припасами
	-- 166750, -- Настой десяти краев
	-- 137642, -- Почетный знак
	-- 122284, -- Жетон WoW




	-- 188152,
	-- 37011, -- Волшебная метла
	-- 33226, -- Тыквовинские сладости
	-- 224412,
	-- 222955,
	-- 222922,




}

E.Octo_Table.OctoTable_itemID_ALL = {
	232877, -- Своевременный мешочек с полезными вещицами
	232366, -- Искаженный временем ключ от реликвария
	232365, -- Искаженный временем ключ от реликвария
	231510, -- Искаженный временем ключ от реликвария
	229899, -- Осколок ключа от сундука
	229359, -- Мешочек с полезными вещицами Хроми
	226813, -- Золотой камень доблести
	226505, -- Нерубский ткач самоцветов
	224556, -- Сейф славного соперника
	224461, -- Кости Маннорота
	224073, -- Зачарованный позолоченный герб Предвестницы
	224072, -- Зачарованный рунический герб Предвестницы
	224069, -- Зачарованный истертый герб Предвестницы
	223909, -- Средний бронзовый ларь
	221509, -- Оружие путешественника во времени
	220790, -- Формирующийся рунический герб Предвестницы
	220789, -- Формирующийся позолоченный герб Предвестницы
	220788, -- Формирующийся истертый герб Предвестницы
	220773, -- Праздничный комплект рунических гербов Предвестницы
	220769, -- Алгарийский знак признания
	220767, -- Триумфальная сумка с резными гербами Предвестницы
	220520, -- Сияющий отголосок
	218114, -- Око пробуждения
	217930, -- Сертификат Ноствина
	217409, -- Знак признания Аспектов
	217382, -- Рубиновый драконий камень
	216665, -- Пространственный сжиматель для банка отряда
	213089, -- Старинный бронзовый слиток
	212493, -- Странный кусок воска
	212384, -- Неспокойная сумка с пробужденными гребнями дракона
	212367, -- Пригоршня пробужденных гребней змея
	211952, -- Сумка с пробужденными гребнями дракона
	211951, -- Мешочек с пробужденными гребнями дракончика
	211950, -- Оживленная пригоршня пробужденных гребней змея
	211516, -- Искра пробуждения
	211515, -- Расщепленная искра пробуждения
	211495, -- Сновидческая руна усиления
	211376, -- Проросшее семя
	211297, -- Расколотая искра Знамения
	211296, -- Искра Знамения
	211279, -- Тайник с сокровищами Бесконечности
	210944, -- Изумрудный знак искусности
	210871, -- Большой уголь Фир'алата
	210780, -- Малый уголь Фир'алата
	210776, -- Малый настой Сна
	210737, -- Папка с исследовательскими записями
	210494, -- Раскаленная сущность
	210436, -- Колыбель природы
	210346, -- Самопекущееся печенье на травах
	210333, -- Плащ бесконечных возможностей
	210254, -- Кокон Прилива Снов
	210049, -- Легенда об Элун'ахире
	210041, -- Партия товаров
	209856, -- Капсула растянутого времени
	209419, -- Обугленные останки элементалей
	208951, -- Параказуальная друза
	208945, -- Параказуальный ящик
	208821, -- Знак признания Аспектов
	208649, -- "О природе Сна"
	208619, -- "Трагедия Эринетрии"
	208396, -- Расщепленная искра снов
	208153, -- Хризалида Дикого Сна
	208068, -- Гнилая вкуснятина
	208067, -- Сочное семя сна
	208066, -- Малое семя сна
	208047, -- Огромное семя сна
	207728, -- Фир'алат Воздаятель Снов
	207584, -- Ящик нестабильной реальности
	207583, -- Ящик коллапсировавшей реальности
	207582, -- Ящик измененной реальности
	207030, -- Капсула растянутого времени
	207026, -- Слияние Прилива Снов
	207002, -- Инкапсулированная судьба
	206961, -- Зачарованный гребень Аспекта из Сна
	206960, -- Зачарованный гребень змея из Сна
	206959, -- Искра снов
	206366, -- Надтреснутый трофей раздора
	206350, -- Сияющие останки
	206144, -- Любопытный изначальный гриб
	206143, -- Наполненные энергией временные споры
	206142, -- Зелье с камешками
	206141, -- Радужная улиточья слизь
	206140, -- Успокаивающий изумрудный чай
	206139, -- Нестабильные багровые угли
	206046, -- Тронутая бездной реликвия
	206034, -- Набросок шипящей руны
	206031, -- Витиеватые руны закали
	206030, -- Знамя с роскошной вышивкой
	206028, -- Сундук с золотом
	206025, -- Израсходованная аптечка с эластичными бинтами
	206021, -- Фосфоресцирующая чешуйка Коб'рока
	206019, -- Брошенный запасной парашют
	206017, -- Скрижаль уробороса
	206016, -- Скрижаль уробороса
	206015, -- Скрижаль уробороса
	206014, -- Скрижаль уробороса
	206013, -- Чертежи души
	206012, -- Чертежи разума
	206011, -- Чертежи кости
	206010, -- Чертежи плоти
	206009, -- Скрижаль уробороса
	205999, -- Вулканический резец
	205989, -- Символ дружбы
	205988, -- Копье старейшины закали
	205987, -- Серный спасательный круг
	205986, -- Старый потертый горн
	205984, -- Выменянная карта раскопок
	205982, -- Потерянная карта раскопок
	205903, -- Обменный камушек
	205878, -- Земляной камень обсидианового аспекта
	205686, -- Щелкающая клешня
	205370, -- Дар исследователя
	205369, -- Дар признательного исследователя
	205368, -- Дар благодарного исследователя
	205367, -- Дар обязанного исследователя
	205347, -- Ниффские припасы
	205288, -- Зарытые вещи ниффов
	205250, -- Подарок Ее Ароматейшества
	205249, -- Жгучие благовония ниффов
	205225, -- Знак признания Аспектов
	205219, -- Бесполезный бартерный булыжник
	205216, -- Слегка сколотые самоцветы
	205214, -- Редкие резные раковины
	205213, -- Подозрительный грибок
	205212, -- Костная слизь
	205211, -- Питательная протожидкость
	205188, -- Бартерный булыжник
	205151, -- Извилиск
	205001, -- Резонирующий магический кристалл
	204999, -- Сияющая водяная сфера
	204990, -- Покрытый лавой сумрачный кристалл
	204988, -- Пропитанные серой кожи
	204987, -- Закаленный лавой "нож" кожевника
	204986, -- Напитанное огнем прогорклое масло
	204985, -- Обменный кирпич
	204855, -- Разогнанное ядро решимости
	204853, -- Использованный дракотистовый бур
	204850, -- Пригоршня каз'горитовых болтов
	204843, -- Драконий знак искусности
	204727, -- Желанная безделушка
	204726, -- Огромный сундук дракона
	204725, -- Большой сундук дракона
	204724, -- Малый сундук дракона
	204723, -- Большой сундук дракончика
	204722, -- Огромный сундук дракончика
	204721, -- Малый сундук дракончика
	204717, -- Расщепленная искра пламени Тьмы
	204715, -- Выкопанная ароматная монета
	204710, -- Закаленная в пламени Тьмы броневая пластина
	204697, -- Зачарованный гребень Аспекта из пламени Тьмы
	204682, -- Зачарованный гребень змея из пламени Тьмы
	204681, -- Зачарованный гребень дракончика из пламени Тьмы
	204579, -- Концентрированная некротическая магия
	204578, -- Концентрированная тайная магия
	204577, -- Концентрированная магия природы
	204576, -- Концентрированная темная магия
	204575, -- Концентрированная магия земли
	204574, -- Концентрированная магия льда
	204573, -- Концентрированная магия огня
	204560, -- Лазурный кристалл прорицателя
	204559, -- Сущность прорицания
	204558, -- Свиток зоркости из реликвария
	204475, -- Сломанный драконий генератор червоточин
	204471, -- Бракованный набор для выживания
	204470, -- Спешно отбракованная бомба
	204469, -- Потерянные схемы потоков лавы Аберрия
	204464, -- Сущность пламени Тьмы
	204463, -- Дракотист
	204440, -- Искра пламени Тьмы
	204403, -- Мешочек с мешочком странных вещиц
	204383, -- Мешочек странных вещиц
	204381, -- Сияющая сумка с припасами союза Вальдраккена
	204380, -- Сияющий мешок с припасами кентавров Маруук
	204379, -- Сияющая сумка с искарскими припасами
	204378, -- Сияющая сумка с припасами Драконьей экспедиции
	204359, -- Кошелек гонщика Запретного края
	204352, -- Остатки слизи стихий
	204276, -- Неведомое запретное знание
	204233, -- Непробиваемое ядро стихий
	204232, -- Коготь вожака лис-виверн
	204231, -- Королевская баранья шкура
	204230, -- Крепкое омытое копье
	204229, -- Мерцающая руна Чаротрикса
	204228, -- Непереваренный лепесток хоэнвейса
	204227, -- Самотекучий антифриз
	204226, -- Пепел пламенного копыта
	204225, -- Безупречное перо ветра
	204224, -- Крупица магического познания
	204222, -- Аметриновый осколок-проводник
	204217, -- Нестабильный элементий
	204215, -- Дремлющий изначальный фрагмент
	204191, -- Малый обсидиановый герб чести
	204190, -- Обсидиановый герб чести
	204189, -- Великий обсидиановый герб чести
	204188, -- Малый обсидиановый трофей завоеваний
	204187, -- Обсидиановый трофей завоеваний
	204186, -- Великий обсидиановый трофей завоеваний
	203710, -- Негасимый ключ
	203702, -- Экспериментальный объединитель
	203683, -- Оберег Фиракка
	203681, -- Штормовой сундук воинов стихий
	203430, -- Оберег Игиры
	203224, -- Сундук с лишними припасами Вальдраккена
	203222, -- Комплект с лишними припасами Маруук
	203220, -- Сумка с лишними искарскими припасами
	203217, -- Ящик с лишними припасами экспедиции
	202872, -- Знак благословения
	202871, -- Драконий артефакт
	202870, -- Таинственные записи
	202670, -- Запечатанный свиток знаний
	202669, -- Запечатанный свиток рыбы
	202668, -- Запечатанный свиток духа
	202667, -- Запечатанный свиток артефакта
	202395, -- Обертка Warcraft Rumble
	202371, -- Сияющий сундук воинов стихий
	202196, -- Ключ от Зкерского хранилища
	202173, -- Магмовая частица
	202171, -- Обсидиановый драконий камень
	202163, -- Призовой сундучок Warcraft Rumble
	202162, -- Монета Warcraft Rumble
	202152, -- Заряженный молнией манипулятор
	202142, -- Сейф Драконьей Погибели
	202098, -- Яркий ящик разной руды
	202097, -- Навороченный набор шикарных шкур
	202094, -- Знак кентавров Маруук
	202093, -- Знак союза Вальдраккена
	202092, -- Знак искарских клыкарров
	202091, -- Знак Драконьей экспедиции
	202080, -- Тайник с сокровищами из хранилища
	202079, -- Тайник с сокровищами из хранилища
	202052, -- Терпение Дозорного Времени
	202039, -- Субстанция шторма
	202017, -- Спасенные фурболгские артефакты
	202016, -- Заряженная кость
	202014, -- Насыщенная пыльца
	202011, -- Заряженный стихиями камень
	201991, -- Печатка Сарги
	201924, -- Знак союза Вальдраккена
	201923, -- Знак кентавров Маруук
	201922, -- Знак искарских клыкарров
	201921, -- Знак Драконьей экспедиции
	201836, -- Знак признания Аспектов
	201817, -- Сумеречный тайник
	201782, -- Благословение Тира
	201781, -- Память Тира
	201756, -- Набитый монетами кошелек
	201755, -- Сейф обсидианового главного кузнеца
	201728, -- Сейф Вакрила
	201462, -- Желудок любопытной формы
	201439, -- Восстановленный сон
	201352, -- Сумка с реагентами для кожи
	201326, -- Драконья сумка сотрудничества
	201325, -- Драконья руна усиления
	201301, -- Радужная руда
	201300, -- Радужные куски руды
	201278, -- Редкие записи шкуродера
	201277, -- Редкие записи рудокопа
	201276, -- Редкие записи травника
	201275, -- Редкие схемы кожевника
	201274, -- Редкие иллюстрации ювелира
	201273, -- Редкие черновики инженера
	201272, -- Редкие исследования зачаровывателя
	201271, -- Редкие схемы портного
	201270, -- Редкие исследования алхимика
	201269, -- Редкие рунические наброски начертателя
	201268, -- Редкие схемы кузнеца
	201250, -- Сейф победоносного соперника
	201023, -- Драконий трактат о снятии шкур
	201020, -- Шелковый сюрприз
	201018, -- Побывавший в деле барабан
	201017, -- Огневой самоцвет
	201016, -- Гармонический кристальный гармонизатор
	201015, -- Поддельная колода карт Новолуния
	201014, -- Ракета "Бумтир"
	201013, -- Останки со следами магии
	201012, -- Зачарованные обломки
	201011, -- Магические клещи
	201010, -- Диаграмма оружия куалаши
	201009, -- Наброски рукавицы сокольничего
	201008, -- Расплавленный слиток
	201006, -- Драконий плавень
	201005, -- Любопытные слитки
	201003, -- Мохнатый кисель
	200982, -- Пыльные записи шкуродера
	200981, -- Пыльные записи рудокопа
	200980, -- Пыльные записи травника
	200979, -- Пыльные схемы кожевника
	200978, -- Пыльные иллюстрации ювелира
	200977, -- Пыльные черновики инженера
	200976, -- Пыльные исследования зачаровывателя
	200975, -- Пыльные схемы портного
	200974, -- Пыльные исследования алхимика
	200973, -- Пыльные рунические наброски начертателя
	200972, -- Пыльные схемы кузнеца
	200846, -- Стрелы без оперения
	200811, -- Капля сгустившегося сока
	200764, -- Осклизлые блестяшки
	200686, -- Изначальное средоточие
	200678, -- Сноцвет
	200677, -- Лепесток сноцвета
	200652, -- Мешочек алхимических приправ
	200611, -- Награда за гонку драконов – 3-е место
	200610, -- Награда за гонку драконов – 2-е место
	200609, -- Награда за гонку драконов – 1-е место
	200516, -- Трофеи великой охоты
	200515, -- Трофеи великой охоты
	200513, -- Трофеи великой охоты
	200468, -- Трофеи великой охоты
	200455, -- Знак союза Вальдраккена
	200454, -- Знак кентавров Маруук
	200453, -- Знак искарских клыкарров
	200452, -- Знак Драконьей экспедиции
	200300, -- Мешок добычи
	200289, -- Знак союза Вальдраккена
	200288, -- Знак кентавров Маруук
	200287, -- Знак искарских клыкарров
	200285, -- Знак Драконьей экспедиции
	200224, -- Знак Сарги
	200095, -- Горшок с припасами
	200073, -- Вальдраккенские сокровища
	200072, -- Сейф Драконьей Погибели
	200070, -- Обсидиановый сейф
	200069, -- Обсидиановый тайник
	199839, -- Тусклая первобытная вода
	199838, -- Тусклая первобытная буря
	199837, -- Тусклая первобытная земля
	199836, -- Тусклый первобытный огонь
	199475, -- Переполненная сумка с припасами союза Вальдраккена
	199474, -- Переполненный мешок с припасами кентавров Маруук
	199473, -- Переполненная сумка с искарскими припасами
	199472, -- Переполненная сумка с припасами Драконьей экспедиции
	199197, -- Бутилированная сущность
	199192, -- Кошелек участника драконьей гонки
	199128, -- Полевые заметки мастера снятия шкур
	199122, -- Полевые заметки рудокопа
	199115, -- Полевые заметки травника
	198978, -- До смешного удачный шов
	198977, -- Нить Он'ары
	198976, -- Исключительно мягкая кожа
	198975, -- Окостеневшая шкура
	198974, -- Украшение с удивительным узором
	198973, -- Светящаяся реликвия
	198972, -- Драконьи чары
	198971, -- Любопытная джарадинская руна
	198970, -- Бесконечные разъемы
	198969, -- Метка хранителя
	198968, -- Амулет воина стихий
	198967, -- Первозданный эфир
	198966, -- Расплавленная капля
	198965, -- Фрагмент первобытной земли
	198964, -- Стихийная щепка
	198963, -- Разлагающаяся мокрота
	198869, -- Большая сумка с припасами союза Вальдраккена
	198868, -- Маленькая сумка с припасами союза Вальдраккена
	198866, -- Маленькая сумка с искарскими припасами
	198864, -- Крупный мешок с припасами кентавров Маруук
	198863, -- Маленькая сумка с припасами Драконьей экспедиции
	198841, -- Крупный образец необычной шкуры
	198837, -- Обрезки необычной шкуры
	198789, -- Неповрежденная катушка конденсатора
	198712, -- Образец огненного порошка
	198711, -- Сумка браконьера
	198710, -- Фляга с подозрительной водой
	198704, -- Пульсирующая руна земли
	198703, -- Памятка по языку жестов
	198702, -- Опаленная чужеземная ткань
	198699, -- Таинственное знамя
	198697, -- Контрабандное снадобье
	198696, -- Благословленная ветром шкура
	198693, -- Пыльная карта Новолуния
	198692, -- Примечательный обрывок ковра
	198690, -- Прогнившая чешуя
	198687, -- Тщательно охраняемая блестяшка
	198686, -- Заиндевевший пергамент
	198685, -- Хорошо изолированная кружка
	198684, -- Крошечное знамя бронзовых драконов
	198683, -- Обработанные шкуры
	198682, -- Друза алекстразита
	198680, -- Гнилое одеяло Бурошкуров
	198670, -- Высокий малигит
	198669, -- Как обучить дракончика
	198667, -- Запасные инструменты джарадинов
	198664, -- Кристаллические заросли
	198663, -- Закаленное льдом зелье
	198662, -- Интригующий рулон синей ткани
	198660, -- Разбитый ключ
	198659, -- Книга забывчивого ученика
	198658, -- Насыщенное гнилью дубильное масло
	198656, -- Красивый самоцвет художника
	198613, -- Эскизы кожевенника
	198612, -- Образцы огранки для ювелира
	198611, -- Инженерные детали
	198610, -- Письмена зачаровывателя
	198609, -- Образцы для портного
	198608, -- Алхимические заметки
	198607, -- Символы начертателя
	198606, -- Бумага кузнеца
	198599, -- Экспериментальный образец разложения
	198510, -- Драконий трактат об инженерном деле
	198454, -- Драконий трактат о кузнечном деле
	198438, -- Драконий рецепт в бутылке
	198395, -- Тусклый моллюск с шипами
	198156, -- Генератор червоточин: Драконьи острова
	198046, -- Концентрированный изначальный настой
	197921, -- Изначальный настой
	195502, -- Плененный сердечник Терроса
	195496, -- Око мстительного урагана
	194337, -- Жидкая храбрость
	194081, -- Мутировавший корень
	194080, -- Необычный бутон
	194079, -- Чистый самородок серевита
	194078, -- Идеальная драконитовая чешуйка
	194077, -- Безупречная крепкая чешуя
	194076, -- Экзотическая эластичная кожа
	194072, -- Мешок золота
	194068, -- Чешуя прародителей
	194067, -- Гниющая туша
	194066, -- Мерзлая шкура
	194064, -- Фигурная жеода
	194063, -- Сияющий фрагмент
	194062, -- Неподатливый каменный обломок
	194061, -- Удушающие споры
	194055, -- Первозданная почва
	194054, -- Выкопанный саженец
	194041, -- Побег струецвета
	194040, -- Шкура синекожего
	194039, -- Горячий образец руды
	193913, -- Целые части тела животного
	193910, -- Расплавленная чешуя дракона
	193907, -- Отколотый камень Тира
	193905, -- Торговый журнал искарских клыкарров
	193904, -- Острое перо феникса
	193903, -- Сердечник дозорного
	193902, -- Заржавленное устройство титанов
	193901, -- Изначальная пыль
	193900, -- Призматическая линза
	193899, -- Катушка изначальной нити
	193898, -- Игла из темной кости
	193897, -- Пробужденный катализатор
	193891, -- Экспериментальное вещество
	193201, -- Деталь ключа
	192132, -- Драконитовое точило для клинков
	192131, -- Вальдраккенская цепь для оружия
	192130, -- Оружейная форма Расколотого Пламени
	191915, -- Косматик
	191784, -- Драконий осколок знания
	191264, -- Собранный обсидиановый ключ
	191251, -- Фрагменты ключа
	190456, -- Рвение мастера
	190455, -- Концентрированное изначальное средоточие
	190454, -- Истощенный изначальный хаос
	190453, -- Искра искусности
	190189, -- Пустынная реликвия
	189765, -- Мешок с припасами кентавров Маруук
	188152, -- Осколок управления вратами
	187508, -- Клетка с дрессированным громитом
	185834, -- Ориборейские награды
	183616, -- Проклятый сувенир
	180817, -- Шифр перемещения
	174768, -- Проклятая реликвия
	174767, -- Реликвия могу
	174766, -- Реликвия богомолов
	174765, -- Реликвия тол'виров
	174764, -- Фрагмент реликвии тол'виров
	174761, -- Реликвия акиров
	174760, -- Фрагмент реликвии богомолов
	174759, -- Фрагмент реликвии могу
	174758, -- Искаженный Бездной фрагмент реликвии
	174756, -- Фрагмент реликвии акиров
	173363, -- Сосуд жутких видений
	172924, -- Генератор червоточин: Темные Земли
	169610, -- Ящик "ЗПЧСТ"
	169223, -- Ашжра'камас, Покров Решимости
	168946, -- Набор деталей для переработки
	168832, -- Гальванический осциллятор
	168808, -- Генератор червоточин: Зандалар
	168807, -- Генератор червоточин: Кул-Тирас
	168327, -- Цепь зажигания
	168217, -- Закаленная пружина
	168216, -- Закаленная обшивка
	168215, -- Фрезерованный шестеренный механизм
	167862, -- Набор для сборки планера Орды
	166971, -- Разряженный аккумулятор
	166970, -- Аккумулятор
	166846, -- Запасные части
	166751, -- Настой десяти краев
	166750, -- Настой десяти краев
	158075, -- Сердце Азерот
	151652, -- Генератор червоточин: Аргус
	141652, -- Камень поиска маны
	141605, -- Свисток распорядителя полетов
	140192, -- Камень возвращения в Даларан
	138729, -- Зелье обостренных чувств
	138728, -- Зелье обыкновенной невидимости
	138727, -- Зелье непокорности
	138488, -- Зелье соленой воды
	138486, -- Зелье "третьего дыхания"
	137642, -- Почетный знак
	128353, -- Адмиральский компас
	124640, -- Чернильно-черное зелье
	124124, -- Кровь Саргераса
	122457, -- Идеальный тренировочный камень для питомцев
	122284, -- Жетон WoW
	113681, -- Обломки доспехов Железной Орды
	113509, -- Сотворенные булочки из маны
	112059, -- Центрифуга червоточины
	111820, -- Перестановочный бластер
	110560, -- Камень возвращения в гарнизон
	109599, -- Нейроглушитель
	92471, -- Дневник Джубеки
	92441, -- Кодекс Зеррата
	92426, -- Запечатанный фолиант Потерянного Легиона
	87215, -- Генератор червоточин: Пандария
	86547, -- Осколок небес
	83078, -- Наследие мастеров (ч. I)
	81055, -- Билет на аттракцион ярмарки Новолуния
	71998, -- Эссенция разрушения
	69237, -- Живой огонь
	64527, -- Наручи гладиаторской битвы
	52253, -- Музыкальная шкатулка Сильваны
	52252, -- Гербовая накидка Светоносного
	52251, -- Медальон Джайны
	52201, -- Благоволение Мурадина
	52200, -- Поводья багрового коня смерти
	52078, -- Сфера хаоса
	52019, -- Ленточка Прелести
	51321, -- Кровь Сильваны
	51320, -- Знак Серебряной Длани
	51319, -- Тренировочный меч Артаса
	51318, -- Медальон Джайны
	51317, -- Осколок души Александроса
	51316, -- Незапечатанный сундук
	50274, -- Осколок Льда Тьмы
	49908, -- Древнейший саронит
	49888, -- Грань Тьмы
	49623, -- Темная Скорбь
	49040, -- Дживс
	48933, -- Генератор червоточин: Нордскол
	47556, -- Сфера рыцаря
	45087, -- Руническая сфера
	44812, -- Индейкомет
	43102, -- Ледяной шар
	37829, -- Призовой жетон Хмельного фестиваля
	37011, -- Волшебная метла
	36942, -- Ледяная Скорбь
	34664, -- Частица солнца
	33226, -- Тыквовинские сладости
	32428, -- Сердце тьмы
	30183, -- Воронка Пустоты
	24919, -- Башмаки Темной Чешуи
	24918, -- Пояс Темной Чешуи
	24917, -- Наручи Пустоверти
	24916, -- Наплечные щитки Пустоверти
	24915, -- Набедренники Пустоверти
	23572, -- Изначальная Пустота
	23247, -- Пылающий цвет
	6948, -- Камень возвращения

}

E.Octo_Table.OctoTable_itemID_AutoOpen = {
	215362,
	200095,
	226263,
	225239,
	233014, -- Сундук с сокровищами торжества бронзовых драконов
	232877, -- Своевременный мешочек с полезными вещицами
	229359, -- Мешочек с полезными вещицами Хроми
	224556, -- Сейф славного соперника
	223953, -- Прощальные дары путешественника во времени
	223909, -- Средний бронзовый ларь
	223908, -- Малый бронзовый ларь
	221509, -- Оружие путешественника во времени
	218130, -- Ларь искателя приключений
	213190, -- Сохранившийся фолиант джарадинов
	213186, -- Пыльный фолиант ниффов
	213185, -- Пыльный фолиант кентавров
	211414, -- Цветущий тайник Сна
	211413, -- Расцветающий тайник Сна
	211411, -- Разрастающийся тайник Сна
	211410, -- Расцветший тайник дикарей
	211394, -- Тайник собранных семян сна
	211389, -- Тайник с интенсивно цветущими сокровищами
	211373, -- Сумка множества чудес
	211303, -- Мешок с припасами дриад.
	211279, -- Тайник с сокровищами Бесконечности
	210992, -- Переполненная сокровищница Стражей сна
	210872, -- Сумка снов
	210657, -- Слегка помятый подарок
	210549, -- Кошелек гонщика Сна
	210224, -- Маленький изумрудный цветок
	210218, -- Большая награда Сна
	210217, -- Маленькая награда Сна
	210063, -- Сумка захватчика с полезными вещами
	210062, -- Железная сумка с полезными вещами
	209871, -- Подарок к Зимнему Покрову
	209833, -- Ящик с доспехами преданного Сну
	209026, -- Набитая добычей тыква
	209024, -- Заполненная добычей тыква
	208211, -- Подарок на годовщину
	208142, -- Зарытая сумка
	208090, -- Сжатая паракаузальность
	207584, -- Ящик нестабильной реальности
	207583, -- Ящик коллапсировавшей реальности
	207582, -- Ящик измененной реальности
	206271, -- Сокровища Коварнессы
	206039, -- Комплект вражды
	205983, -- Нюхопомрачительные ниффские сокровища
	205968, -- Переполненная сумка с лоаммскими припасами
	205965, -- Большая сумка с лоаммскими припасами
	205964, -- Маленькая сумка с лоаммскими припасами
	205877, -- Ларь искателя приключений
	205371, -- Собранные припасы признательного исследователя
	205370, -- Дар исследователя
	205369, -- Дар признательного исследователя
	205368, -- Дар благодарного исследователя
	205367, -- Дар обязанного исследователя
	205347, -- Ниффские припасы
	205346, -- Спрятанное сокровище ниффов
	205288, -- Зарытые вещи ниффов
	205247, -- Грязный позванивающий мешочек
	205226, -- Кошелек пещерного гонщика
	204911, -- Скопление спор
	204712, -- Переполненный мешок с припасами лоаммских ниффов
	204359, -- Кошелек гонщика Запретного края
	203700, -- Рваная подарочная упаковка
	203699, -- Рваная подарочная упаковка
	203681, -- Штормовой сундук воинов стихий
	203476, -- Сундук воинов стихий
	203222, -- Комплект с лишними припасами Маруук
	203220, -- Сумка с лишними искарскими припасами
	203217, -- Ящик с лишними припасами экспедиции
	202371, -- Сияющий сундук воинов стихий
	202172, -- Переполненная сумка монет
	202171, -- Обсидиановый драконий камень
	202142, -- Сейф Драконьей Погибели
	201818, -- Сумеречный тайник
	201756, -- Набитый монетами кошелек
	201754, -- Сундук обсидианового главного кузнеца
	201439, -- Восстановленный сон
	201326, -- Драконья сумка сотрудничества
	201250, -- Сейф победоносного соперника
	200516, -- Трофеи великой охоты
	200515, -- Трофеи великой охоты
	200513, -- Трофеи великой охоты
	200468, -- Трофеи великой охоты
	200073, -- Вальдраккенские сокровища
	200072, -- Сейф Драконьей Погибели
	200070, -- Обсидиановый сейф
	200069, -- Обсидиановый тайник
	199341, -- Отрыгнутый мешок сокровищ рогоплава
	199192, -- Кошелек участника драконьей гонки
	198869, -- Большая сумка с припасами союза Вальдраккена
	198868, -- Маленькая сумка с припасами союза Вальдраккена
	198867, -- Большая сумка с искарскими припасами
	198866, -- Маленькая сумка с искарскими припасами
	198865, -- Большая сумка с припасами Драконьей экспедиции
	198864, -- Крупный мешок с припасами кентавров Маруук
	198863, -- Маленькая сумка с припасами Драконьей экспедиции
	191139, -- Дар старейшин Просветленных
	190178, -- Сумка с первозданными материалами
	189765, -- Мешок с припасами кентавров Маруук
	187574, -- Полное ведро брокера
	187561, -- Подарок к Зимнему Покрову
	187551, -- Сундучок с кортийскими припасами
	187520, -- Слегка помятый подарок
	187440, -- Шлем с плюмажем из перьев
	187354, -- Брошенная сумка брокера
	187278, -- Пронзенная когтями шкатулка Верных Утробе
	186708, -- Стакан для кистей с золотом
	186706, -- Шляпа с золотом
	186692, -- Шлем с золотом
	186691, -- Сумка с золотом
	186688, -- Ведерко с золотом
	186533, -- Тайник с сокровищами Святилища
	186196, -- Трофейный сундук Легиона Смерти
	185993, -- Трофейный сундук перерожденных
	185992, -- Трофейный сундук Неумирающей армии
	185991, -- Трофейный сундук Дикой Охоты
	185990, -- Трофейный сундук Жнецов
	185972, -- Тайник мучителя
	185906, -- Подарок на годовщину
	185765, -- Груз толстых загрубевших шкур
	184642, -- Тайник защитника-травника
	184641, -- Тайник защитника-горняка
	184640, -- Тайник защитника-шкуродера
	184638, -- Рыбный тайник героя
	184636, -- Тайник странствующего шкуродера
	184635, -- Тайник странствующего горняка
	184634, -- Тайник странствующего травника
	184633, -- Мясной тайник защитника
	184631, -- Тайник странствующего зачаровывателя
	184630, -- Тайник странствующего портного
	184395, -- Тайник павшего искателя приключений
	183702, -- Великолепие природы
	183701, -- Материалы для ритуалов очищения
	183699, -- Изысканные ингредиенты
	181741, -- Дар идеала
	181733, -- Дар верных долгу
	181732, -- Дар честолюбивых
	181557, -- Благосклонность Двора
	181556, -- Дар Двора
	181476, -- Дар Дикой Охоты
	181475, -- Дар хранителей рощи
	181372, -- Дар перерожденных
	180985, -- Набитая сумка ученика
	180984, -- Набитая сумка подмастерья
	180981, -- Большая сумка ученика
	180980, -- Большая сумка подмастерья
	180977, -- Сумка хранителя духов
	180976, -- Сумка умельца
	180975, -- Сумка подмастерья
	180974, -- Сумка ученика
	178128, -- Сумка с блестяшками
	174959, -- Тайник роя богомолов
	173372, -- Тайник Темной Империи
	171305, -- Найденный контейнер с экипировкой
	170074, -- Посеченный сейф Молота Ашрана
	168740, -- Запечатанный подарок "Блескотрона-7000"
	156698, -- Излучающая спокойствие сумка с полезными предметами
	156689, -- Опаленная сумка с полезными предметами
	156688, -- Обледеневшая сумка с полезными предметами
	156683, -- Сумка с полезными вещами
	156682, -- Сумка с полезными вещами из иного мира
	153248, -- Сокровище Света
	153132, -- Сундук с аргусским снаряжением
	153122, -- Магический тайник змееустов
	149574, -- Набитая добычей тыква
	149504, -- Особенный подарок от "Пастбищ Дымного Леса"
	147432, -- Снаряжение защитника
	144345, -- Горка товаров для питомцев
	144330, -- Зубчатый контейнер
	140227, -- Добыча кровавого охотника
	140226, -- Подсвеченный маной мешок
	140225, -- Трофейная броня
	140224, -- Разделанное мясо
	140221, -- Мешочек с найденными самоцветами
	140220, -- Трофейная ткань
	139137, -- Вещи колдуньи
	133549, -- Грязные ботинки
	132892, -- Запечатанный подарок "Блескотрона-6000"
	117394, -- Сумка с замороженными товарами
	117393, -- Сундук сокровищ в форме бочонка
	117392, -- Заполненная добычей тыква
	116762, -- Украденный подарок
	116404, -- Дары странников
	113258, -- Запечатанный подарок "Блескотрона-5000"
	104272, -- Небесный сундук сокровищ
	103624, -- Сокровища Дола
	93724, -- Приз ярмарки Новолуния
	92718, -- Кошелек бойца
	90840, -- Сияющий мешок с золотом мародера
	87217, -- Небольшой мешок с полезными вещами
	86623, -- Запечатанный подарок "Блескотрона-4000"
	78910, -- Мешок жетонов
	78904, -- Мешочек жетонов
	54537, -- Коробочка в виде сердца
	54516, -- Заполненная добычей тыква
	52002, -- Сумка с полезными вещами
	49909, -- Коробка шоколадных конфет
	46007, -- Мешок рыбацких сокровищ
	44475, -- Усиленный ящик
	44113, -- Маленький мешочек со специями
	37586, -- Пригоршня конфет
	35348, -- Мешок рыбацких сокровищ
	35313, -- Раздувшаяся колючеусая форель
	34863, -- Мешок рыбацких сокровищ
	33857, -- Ящик мяса
	33844, -- Бочка с рыбой
	32724, -- Покрытый тиной предмет
	21363, -- Подарок в разноцветной упаковке
	21327, -- Тикающий подарок
	21310, -- Подарок в яркой упаковке
	21191, -- Тщательно упакованный подарок
	20393, -- Сумка с лакомствами
	17727, -- Подарочный набор от "Пастбищ Дымного Леса"
	17726, -- Особый подарок от "Пастбищ Дымного Леса"
	17685, -- Образчик продукции "Пастбищ Дымного Леса"
	15874, -- Мягкотелый моллюск
	7973, -- Моллюск-болтун
}